00001  IDENTIFICATION DIVISION.                                         04/18/98
00002                                                                   EL512
00003  PROGRAM-ID.                 EL512 .                                 LV012
00004 *              PROGRAM CONVERTED BY                               EL512
00005 *              COBOL CONVERSION AID PO 5785-ABJ                   EL512
00006 *              CONVERSION DATE 07/14/94 14:40:53.                 EL512
00007 *            PROGRAM REVIEWED FOR YEAR 2000 COMPLIANCE            EL512
00008 *                            VMOD=2.034                              CL**4
00009                                                                   EL512
00010 *AUTHOR.     LOGIC INC.                                           EL512
00011 *            DALLAS, TEXAS.                                       EL512
00012                                                                   EL512
00013 *DATE-COMPILED.                                                   EL512
00014                                                                   EL512
00015 *SECURITY.   *****************************************************EL512
00016 *            *                                                  * EL512
00017 *            *  THIS PROGRAM IS THE PROPERTY OF LOGIC INC.      * EL512
00018 *            *                                                  * EL512
00019 *            *  USE OF THIS PROGRAM BY OTHER THAN THE EMPLOYEES * EL512
00020 *            *  OF LOGIC INC. IS EXPRESSLY PROHIBITED WITHOUT   * EL512
00021 *            *  THE PRIOR WRITTEN PERMISSION OF LOGIC INC.      * EL512
00022 *            *                                                  * EL512
00023 *            *****************************************************EL512
00024                                                                   EL512
00025 *REMARKS.                                                         EL512
00026 *       GENERAL FUNCTION IS TO PRODUCE THE DATA LOAD PRE-EDIT     EL512
00027 *       LISTING AND LOAD DATA TAPE FOR NEW BUSINESS BATCH INPUT.  EL512
00028 *       REPORT OF ALL NEW BUSINESS ADDS IS GENERATED BY BATCH     EL512
00029 *       NUMBER.  SUMMARIES INCLUDE BATCH ENTERED, CONTROL, AND    EL512
00030 *       DIFFERENCE AMOUNTS FOR BATCHES OUT OF BALANCE.            EL512
00031 *                                                                 EL512
00032 *       INPUT FILES-    PENDING NEW BUSINESS (ISSUES AND CANCELS) EL512
00033 *                       ADDERS DISK FILE (CARDS-IN)               EL512
00034 *                       DATE CARD FILE                            EL512
00035 *                                                                 EL512
00036 *       OUTPUT-         DATA LOAD PRE-EDIT LISTING  (EL512)       EL512
00037 *                       PENDING BUSINESS LOAD FILE                EL512
011904******************************************************************
011904*                   C H A N G E   L O G
011904*
011904* CHANGES ARE MARKED BY THE CHANGE EFFECTIVE DATE.
011904*-----------------------------------------------------------------
011904*  CHANGE   CHANGE REQUEST PGMR  DESCRIPTION OF CHANGE
010904* EFFECTIVE    NUMBER
011904*-----------------------------------------------------------------
011904* 011904                   PEMA  ADD TOTAL FEE PROCESSING
032306* 032306                   PEMA  ADD BOW LOAN NUMBER
032109* 032109    2009021700002  PEMA  ADD CRED BENE TO PNDB REC
032409* 032409    2009031600001  AJRA  ADD VIN NUMBER 
110712* 110712    2012110700001  PEMA  correct data type mismatches
112712* 112712    2012112600002  PEMA  correct data type mismatches
040414* 040414  CR2014040400001  PEMA  ADD JNT BIRTHDATE
062017* 062017  CR2015091000001  PEMA  ADD PROCESSING FOR TN REF INTEREST
011904******************************************************************
00038                                                                   EL512
00039      EJECT                                                        EL512
00040  ENVIRONMENT DIVISION.                                            EL512
00041                                                                   EL512
00042  INPUT-OUTPUT SECTION.                                            EL512
00043                                                                   EL512
00044  FILE-CONTROL.                                                    EL512
00045                                                                   EL512
00046      SELECT CARDS-IN         ASSIGN TO SYS006-UR-2540R-S-SYS006   EL512
00047                              FILE STATUS IS SYS006-FILE-STATUS.   EL512
00048                                                                   EL512
00049      SELECT PENDING-IN       ASSIGN TO SYS010-UT-2400-S-SYS010    EL512
00050                              FILE STATUS IS SYS010-FILE-STATUS.   EL512
00051                                                                   EL512
00052      SELECT PENDING-OUT      ASSIGN TO SYS011-UT-2400-S-SYS011.   EL512
00053                                                                   EL512
00054      SELECT PRNTR            ASSIGN TO SYS008-UR-1403-S-SYS008.   EL512
00055                                                                   EL512
00056      SELECT DISK-DATE        ASSIGN TO SYS019-3380-S-SYS019.      EL512
00057                                                                   EL512
00058      SELECT FICH             ASSIGN TO SYS020-UT-2400-S-SYS020.   EL512
00059                                                                   EL512
00060      SELECT ERACCT           ASSIGN TO SYS021-3380-ERACCT2        EL512
00061                              ORGANIZATION IS INDEXED              EL512
00062                              ACCESS IS DYNAMIC                    EL512
00063                              RECORD KEY IS AM-CONTROL-BY-VAR-GRP  EL512
00064                              FILE STATUS IS ERACCT-FILE-STATUS.   EL512
00065                                                                   EL512
00066      SELECT ELCNTL           ASSIGN TO SYS022-3380-ELCNTL         EL512
00067                              ORGANIZATION IS INDEXED              EL512
00068                              ACCESS IS DYNAMIC                    EL512
00069                              RECORD KEY IS CF-CONTROL-PRIMARY     EL512
00070                              FILE STATUS IS ELCNTL-FILE-STATUS.   EL512
00071                                                                   EL512
00072      SELECT ELREPT           ASSIGN TO SYS023-3380-ELREPT         EL512
00073                              ORGANIZATION IS INDEXED              EL512
00074                              ACCESS IS DYNAMIC                    EL512
00075                              RECORD KEY IS RF-CONTROL-PRIMARY     EL512
00076                              FILE STATUS IS DTE-VSAM-FLAGS.       EL512
00077                                                                   EL512
00078      SELECT SORT-FILE        ASSIGN TO SYS001-UT-3380-S-SORTWK1.  EL512
00079                                                                   EL512
00080  DATA DIVISION.                                                   EL512
00081                                                                   EL512
00082  FILE SECTION.                                                    EL512
00083                                                                   EL512
00084  FD  CARDS-IN                                                     EL512
00085      BLOCK CONTAINS 0 RECORDS
00086      RECORDING MODE F.                                            EL512
00087  01  CARD-INPUT                  PIC X(80).                       EL512
00088                                                                   EL512
00089  FD  PENDING-IN                                                   EL512
00090      BLOCK CONTAINS 0 RECORDS
00091      RECORDING MODE F.                                            EL512
00092  01  PENDING-BUSINESS-MASTER-IN  PIC X(80).                       EL512
00093                                                                   EL512
00094  FD  PENDING-OUT                                                  EL512
00095      BLOCK CONTAINS 0 RECORDS
00096      RECORDING MODE F.                                            EL512
00097                              COPY ERCPNDB.
00098      EJECT                                                        EL512
00099  FD  PRNTR                   COPY ELCPRTFD.                       EL512
00100      EJECT                                                        EL512
00101  FD  DISK-DATE               COPY ELCDTEFD.                       EL512
00102      EJECT                                                        EL512
00103  FD  FICH                    COPY ELCFCHFD.                       EL512
00104      EJECT                                                        EL512
00105  FD  ELREPT                  COPY ELCRPTFD.                       EL512
00106      EJECT                                                        EL512
00107                              COPY ELCREPT.                        EL512
00108      EJECT                                                        EL512
00109  FD  ERACCT.                                                      EL512
00110                              COPY ERCACCT.                        EL512
00111      EJECT                                                        EL512
00112  FD  ELCNTL.                                                      EL512
00113                              COPY ELCCNTL.                        EL512
00114      EJECT                                                        EL512
00115  SD  SORT-FILE.                                                   EL512
00116  01  SORT-RECORD.                                                 EL512
00117      05  SR-CONTROL.                                              EL512
00118          10  SR-VALID-ACCOUNT-SW     PIC X.                       EL512
00119              88  CURRENT-ACCOUNT-INVALID VALUE '0'.               EL512
00120              88  CURRENT-ACCOUNT-VALID   VALUE '1'.               EL512
00121          10  SR-COMPANY.                                          EL512
00122              15  SR-CARRIER          PIC X.                       EL512
00123              15  SR-GROUPING         PIC X(6).                    EL512
00124          10  SR-STATE                PIC XX.                      EL512
00125          10  SR-ACCOUNT              PIC X(10).                   EL512
110712         10  SR-BATCH-NO             PIC X(6).                    EL512
00127          10  SR-SEQ-NO               PIC S9(4) COMP.              EL512
00128          10  SR-ISSUE-STATUS         PIC S9.                      EL512
00129              88  SR-VALID-ISSUE-STATUS   VALUE +2 +3
                           +4 +5 +6 +7 +8.
00130                                                                   EL512
00131      05  SR-REST-OF-RECORD           PIC X(80).                   EL512
00132      05  SR-ACCOUNT-NAME             PIC X(20).                   EL512
00133                                                                   EL512
00134      EJECT                                                        EL512
00135  WORKING-STORAGE SECTION.                                         EL512
00136  01  LCP-ABND-CODE                 PIC S999 COMP VALUE +519.      EL512
00137                                                                   EL512
00138  77  FILLER  PIC X(32) VALUE '********************************'.  EL512
00139  77  FILLER  PIC X(32) VALUE '      EL512  WORKING-STORAGE    '.  EL512
00140  77  FILLER  PIC X(32) VALUE '*********** VMOD=2.034 *********'.     CL**4
00141                                                                   EL512
00142  01  FILLER                          COMP-3.                      EL512
00143      05  WS-PAGE                     PIC S9(5)   VALUE ZERO.      EL512
00144      05  WS-LINE-COUNT               PIC S9(3)   VALUE +99.       EL512
00145      05  WS-LINE-COUNT-MAX           PIC S9(3)   VALUE +58.       EL512
00146      05  WS-ZERO                     PIC S9      VALUE ZERO.      EL512
00147      05  WS-RETURN-CODE              PIC S9(3)   VALUE ZERO.      EL512
00148      05  WS-TOT-RECORDS-RELEASED     PIC S9(7)   VALUE ZERO.      EL512
00149                                                                   EL512
00150  01  FILLER.                                                      EL512
00151      05  WS-ABEND-MESSAGE            PIC X(80)   VALUE SPACES.    EL512
00152      05  WS-ABEND-FILE-STATUS        PIC XX      VALUE ZERO.      EL512
00153      05  ERACCT-FILE-STATUS          PIC XX      VALUE ZERO.      EL512
00154      05  ELCNTL-FILE-STATUS          PIC XX      VALUE ZERO.      EL512
00155      05  SYS006-FILE-STATUS          PIC XX      VALUE ZERO.      EL512
00156      05  SYS010-FILE-STATUS          PIC XX      VALUE ZERO.      EL512
00157                                                                   EL512
00158      05  WS-SAVE-PRINT-RECORD        PIC X(133) VALUE SPACES.     EL512
00159                                                                   EL512
00160      05  WS-ACCOUNT-FILL.                                         EL512
00161          10  WS-FIRST-PLACE          PIC X.                       EL512
00162          10  FILLER                  PIC X(9).                    EL512
00163                                                                   EL512
00164      05  WS-SR-CONTROL.                                           EL512
00165          10  WS-SR-VALID-ACCOUNT-SW  PIC X.                       EL512
00166          10  WS-SR-COMPANY.                                       EL512
00167              15  WS-SR-CARRIER       PIC X      VALUE SPACES.     EL512
00168              15  WS-SR-GROUPING      PIC X(6)   VALUE SPACES.     EL512
00169          10  WS-SR-STATE             PIC XX     VALUE SPACES.     EL512
00170          10  WS-SR-ACCOUNT           PIC X(10)  VALUE SPACES.     EL512
110712         10  WS-SR-BATCH-NO          PIC X(6)   VALUE ZEROS.      EL512
00172          10  WS-SR-SEQ-NO            PIC S9(4)  VALUE +0 COMP.    EL512
00173          10  WS-SR-ISSUE-STATUS      PIC S9     VALUE +0.         EL512
00174                                                                   EL512
00175      05  WS-SAVE-COMPANY-CD          PIC X      VALUE SPACES.     EL512
00176      05  WS-SAVE-CERT-NO             PIC X(11)  VALUE SPACES.     EL512
00177                                                                   EL512
00178      05  WS-SAVE-KEY.                                             EL512
00179          10  WS-SAVE-CARRIER         PIC X     VALUE SPACES.      EL512
00180          10  WS-SAVE-GROUPING        PIC X(6)  VALUE SPACES.      EL512
00181          10  WS-SAVE-STATE           PIC XX    VALUE SPACES.      EL512
00182          10  WS-SAVE-ACCOUNT         PIC X(10) VALUE '**********'.EL512
00183                                                                   EL512
00184      05  WS-PREVIOUS-ISSUE-TYPE      PIC X      VALUE SPACES.     EL512
00185          88  PREVIOUS-ISSUE-FORM1               VALUE 'I' 'O'.    EL512
00186      05  WS-PREVIOUS-CANCEL-TYPE     PIC X      VALUE SPACES.     EL512
00187      05  WS-INVALID-ACCOUNT-SW       PIC XX     VALUE LOW-VALUES. EL512
00188          88  PREVIOUS-ACCOUNT-INVALID           VALUE HIGH-VALUES.EL512
110712     05  WS-SAVE-BATCH-NO            PIC X(6)   VALUE ZEROS.      EL512
00190      05  WS-SAVE-SEQ-NO              PIC S9(4)  VALUE +0  COMP.   EL512
00191      05  WS-ACCOUNT-NAME             PIC X(30)  VALUE SPACES.     EL512
00192                                                                   EL512
00193      05  WS-ALL-NINES                PIC X(9)  VALUE '999999999'. EL512
00194 **   05  X                           PIC 9     VALUE 0.           EL512
CIDMOD     05  X                           PIC X.                       EL512
00195      05  WS-PROCESSOR-ID             PIC X(4)  VALUE SPACES.      EL512
00196      05  WS-MONTH-END-DATE           PIC XX    VALUE LOW-VALUES.  EL512
00197      05  WS-SAVE-DATE                PIC XX.                      EL512
00198      05  WS-SAVE-TIME                PIC 9(6).                    EL512
00199      05  WS-SAVE-BIN-DATE            PIC XX.                      EL512
00200      05  WS-121212-BIN-DATE          PIC XX    VALUE X'A96C'.     EL512
110712     05  WS-BATCH-NO                 PIC X(6)  VALUE ZERO.        EL512
110712     05  WS-BATCH-NO-N REDEFINES WS-BATCH-NO
110712                                     PIC 9(6).
00202      05  SUB1                        PIC S9(4) COMP  VALUE +0.    EL512
00203      05  WS-SEQ-NO                   PIC S9(4) COMP  VALUE +0.    EL512
00204      05  WS-LAST-SEQ-NO              PIC S9(4) COMP  VALUE +0.    EL512
00205      05  PGM-SUB                     PIC S9(4) COMP  VALUE +512.  EL512
00206      05  ABEND-CODE                  PIC XXXX  VALUE SPACES.      EL512
00207      05  ABEND-OPTION                PIC X     VALUE SPACES.      EL512
00208      05  OLC-REPORT-NAME             PIC X(5)  VALUE 'EL512'.     EL512
00209                                                                   EL512
00210      05  WS-BENEFIT-WORK.                                         EL512
00211          10  WS-FIRST-POS            PIC X     VALUE SPACE.       EL512
00212          10  WS-SECOND-POS           PIC X     VALUE SPACE.       EL512
00213                                                                   EL512
00214      05  WS-NO-OF-INPUTS             PIC S9    VALUE +0.          EL512
00215          88  MORE-INPUT                        VALUE +1 THRU +9.  EL512
00216                                                                   EL512
00217      05  WS-PROCESS-SW               PIC S99   VALUE +0.          EL512
00218          88  PROCESSING-CARDS                  VALUE +0.          EL512
00219                                                                   EL512
00220      05  WS-FIRST-BATCH-SW           PIC S99   VALUE +0.          EL512
00221          88  FIRST-BATCH                       VALUE +0.          EL512
00222          88  LAST-BATCH                        VALUE +99.         EL512
00223                                                                   EL512
00224      05  WS-FIRST-ACCOUNT-SW         PIC S99   VALUE +0.          EL512
00225          88  FIRST-ACCOUNT                     VALUE +0.          EL512
00226          88  LAST-ACCOUNT                      VALUE +99.         EL512
00227                                                                   EL512
00228      05  WS-ERROR-CNT                PIC S99   VALUE +0.          EL512
00229          88  NO-ERRORS-FOUND                   VALUE +0.          EL512
00230          88  NO-SEVERE-ERRORS                  VALUE +0 THRU +90. EL512
00231          88  ERRORS-FOUND                      VALUE +1 THRU +99. EL512
00232          88  MULTIPLE-ERRORS                   VALUE +2 THRU +90. EL512
00233                                                                   EL512
00234      05  WS-BALANCE-SW.                                           EL512
00235          10  WS-BATCH-BALANCE-SW     PIC S9    VALUE +0.          EL512
00236              88  BATCH-NOT-IN-BALANCE          VALUE +1.          EL512
00237          10  WS-ACCOUNT-BALANCE-SW   PIC S9    VALUE +0.          EL512
00238              88  ACCOUNT-NOT-IN-BALANCE        VALUE +1.          EL512
00239                                                                   EL512
00240      05  WS-VALID-BATCH-SW           PIC S9    VALUE +0.          EL512
00241          88  VALID-BATCH                       VALUE +0.          EL512
00242                                                                   EL512
00243      05  WS-NO-BATCHES               PIC S999  VALUE +0.          EL512
00244          88  ONLY-ONE-BATCH-IN-ACCOUNT         VALUE +1.          EL512
00245                                                                   EL512
00246      05  WS-COMPLETE-BATCH-SW        PIC S9    VALUE +0.          EL512
00247          88  COMPLETE-BATCH                    VALUE +1.          EL512
00248                                                                   EL512
00249      05  WS-PENDING-STATUS-SW        PIC S9    VALUE +0.          EL512
00250          88  PENDING-OPEN                      VALUE +1.          EL512
00251                                                                   EL512
00252      05  WS-FIRST-TIME-SW            PIC X(01) VALUE 'Y'.         EL512
00253                                                                   EL512
00254      05  WS-CLIENT-BATCH-ID          PIC X(03) VALUE SPACES.      EL512
00255                                                                   EL512
00256      05  WS-ERROR-TABLE.                                          EL512
00257          10  ER-1000                 PIC X(32) VALUE              EL512
00258              'SEQUENCE 3 PREMIUM   SET TO ZERO'.                  EL512
00259          10  ER-1001                 PIC X(32) VALUE              EL512
00260              'SEQUENCE 3 REFUND    SET TO ZERO'.                  EL512
00261          10  ER-1002                 PIC X(32) VALUE              EL512
00262              'SEQUENCE 4 PREMIUM   SET TO ZERO'.                  EL512
00263          10  ER-1003                 PIC X(32) VALUE              EL512
00264              'SEQUENCE 4 REFUND    SET TO ZERO'.                  EL512
00265          10  ER-1004                 PIC X(32) VALUE              EL512
00266              'CERT ISSUE COUNT     SET TO ZERO'.                  EL512
00267          10  ER-1005                 PIC X(32) VALUE              EL512
00268              'CERT CANCEL COUNT    SET TO ZERO'.                  EL512
00269          10  ER-1006                 PIC X(32) VALUE              EL512
00270              'REMIT CERT EFF DATE  SET TO ZERO'.                  EL512
00271          10  ER-1007                 PIC X(32) VALUE              EL512
00272              'ISSUE CERT EFF DATE PLUGGED     '.                  EL512
00273          10  ER-1008                 PIC X(32) VALUE              EL512
00274              'ISSUE ORIG TERM      SET TO ZERO'.                  EL512
00275          10  ER-1009                 PIC X(32) VALUE              EL512
00276              'SEQUENCE 3 PREMIUM   SET TO ZERO'.                  EL512
00277          10  ER-1010                 PIC X(32) VALUE              EL512
00278              'SEQUENCE 4 PREMIUM   SET TO ZERO'.                  EL512
00279          10  ER-1011                 PIC X(32) VALUE              EL512
00280              'SEQUENCE 3 BENEFIT   SET TO ZERO'.                  EL512
00281          10  ER-1012                 PIC X(32) VALUE              EL512
00282              'SEQUENCE 4 BENEFIT   SET TO ZERO'.                  EL512
00283          10  ER-1013                 PIC X(32) VALUE              EL512
00284              'INSURED AGE          SET TO ZERO'.                  EL512
00285          10  ER-1014                 PIC X(32) VALUE              EL512
00286              'OB RATE IN SEQ 3     SET TO ZERO'.                  EL512
00287          10  ER-1015                 PIC X(32) VALUE              EL512
00288              'OB RATE IN SEQ 4     SET TO ZERO'.                  EL512
00289          10  ER-1016                 PIC X(32) VALUE              EL512
00290              'LOAN APR             SET TO ZERO'.                  EL512
00291          10  ER-1017                 PIC X(32) VALUE              EL512
00292              'PAY FREQUENCY        SET TO ZERO'.                  EL512
00293          10  ER-1018                 PIC X(32) VALUE              EL512
00294              'BIRTH DATE           SET TO ZERO'.                  EL512
00295          10  ER-1019                 PIC X(32) VALUE              EL512
00296              'SPOUSE ISSUE AGE     SET TO ZERO'.                  EL512
00297          10  ER-1020                 PIC X(32) VALUE              EL512
00298              'LOAN TERM            SET TO ZERO'.                  EL512
00299          10  ER-1021                 PIC X(32) VALUE              EL512
00300              'CANCEL CERT EFF DATE PLUGGED    '.                  EL512
00301          10  ER-1022                 PIC X(32) VALUE              EL512
00302              'CANCEL DATE          SET TO ZERO'.                  EL512
00303          10  ER-1023                 PIC X(32) VALUE              EL512
00304              'SEQUENCE 3 REFUND    SET TO ZERO'.                  EL512
00305          10  ER-1024                 PIC X(32) VALUE              EL512
00306              'SEQUENCE 4 REFUND    SET TO ZERO'.                  EL512
00307          10  ER-1025                 PIC X(32) VALUE              EL512
00308              'ACCOUNT DOES NOT MATCH BATCH    '.                  EL512
00309          10  ER-1026                 PIC X(32) VALUE              EL512
00310              'INVALID TRANSACTION CODE        '.                  EL512
00311          10  ER-1027                 PIC X(32) VALUE              EL512
00312              'NOT IN ACCOUNT DATE RANGE       '.                  EL512
00313          10  ER-1028                 PIC X(32) VALUE              EL512
00314              '**** BATCH OUT OF BALANCE  *****'.                  EL512
00315          10  ER-1029                 PIC X(32) VALUE              EL512
00316              'ACCOUNT IS INACTIVE             '.                  EL512
00317          10  ER-1030                 PIC X(32) VALUE              EL512
00318              '****ACCOUNT OUT OF BALANCE *****'.                  EL512
00319          10  ER-1031                 PIC X(32) VALUE              EL512
00320              'INVALID TRANSACTION CODE        '.                  EL512
00321          10  ER-1032                 PIC X(32) VALUE              EL512
00322              'INVALID FORM2 ISSUE TRANSACTION '.                  EL512
00323          10  ER-1033                 PIC X(32) VALUE              EL512
00324              'NO MATCHING FORM1 ISSUE RECORD  '.                  EL512
00325          10  ER-1034                 PIC X(32) VALUE              EL512
00326              'NO PENDING BUSINESS FOR BATCH   '.                  EL512
00327          10  ER-1035                 PIC X(32) VALUE              EL512
00328              'SEQUENCE 4 PYMT AMT  SET TO ZERO'.                  EL512
00329          10  ER-1036                 PIC X(40) VALUE              EL512
00330              'FURTHER RESEARCH IS REQUIRED            '.          EL512
00331                                                                   EL512
00332  01  WS-DATE-AREA.                                                EL512
00333      12  WS-CURRENT-DT.                                           EL512
00334          16  WS-CURRENT-CCYY.                                     EL512
00335              18  WS-CURRENT-CC   PIC X(2)    VALUE SPACES.        EL512
00336              18  WS-CURRENT-YR   PIC X(2)    VALUE SPACES.        EL512
00337          16  FILLER              PIC X(4)    VALUE SPACES.        EL512
00338                                                                   EL512
00339      12  WS-SAVE-BIRTH-DATE.                                      EL512
00340          16  WS-SAVE-BIRTH-CCYY.                                  EL512
00341              18  WS-SAVE-BIRTH-CC PIC X(2)   VALUE SPACES.        EL512
00342              18  WS-SAVE-BIRTH-YR PIC X(2)   VALUE SPACES.        EL512
00343          16  FILLER               PIC X(4)   VALUE SPACES.        EL512
00344                                                                   EL512
00345      12  CENTURY-ADJ             PIC S9(08) VALUE +38400 COMP.    EL512
00346      12  WS-WORK-BIN-RED         PIC S9(08) VALUE +0 COMP.        EL512
00347      12  FILLER REDEFINES WS-WORK-BIN-RED.                        EL512
00348          16  FILLER              PIC XX.                             CL**3
00349          16  WS-WORK-BIN-DT      PIC XX.                             CL**3
00350                                                                   EL512
00351  01  WS-TRAN-ERROR.                                               EL512
00352      05  FILLER                      PIC X(5)  VALUE 'TRAN='.     EL512
00353      05  WS-TRAN-TYPE                PIC X.                       EL512
00354                                                                   EL512
00355      EJECT                                                        EL512
00356                                                                   EL512
00357                                      COPY ELCACCTV.               EL512
00358                                                                   EL512
00359                                      COPY ERCPNDBI.
00360                                                                   EL512
00361  01  ALTERNATE-PENDING-IN            REDEFINES                    EL512
00362      PENDING-BUSINESS-IN.                                         EL512
00363      12  1ST-THREE                   PIC X(3).                    EL512
00364          88  NULL-FILE                           VALUE 'ZAP'.     EL512
00365      12  FILLER                      PIC X(77).                   EL512
00366      EJECT                                                        EL512
00367  01  WS-SAVE-BATCH-RECORD            PIC X(585).                  EL512
00368                                                                   EL512
00369  01  WS-SAVE-PENDING-RECORD          PIC X(585).                  EL512
00370                                                                   EL512
00371  01  WS-SAVE-REMIT-KEY.                                           EL512
00372      16  WS-REM-CARRIER               PIC X.                      EL512
00373      16  WS-REM-GROUPING              PIC X(6).                   EL512
00374      16  WS-REM-STATE                 PIC XX.                     EL512
00375      16  WS-REM-ACCOUNT               PIC X(10).                  EL512
00376                                                                   EL512
00377  01  WS-MAILING-DATA.                                             EL512
00378      16  WS-M-INSURED-LAST-NAME       PIC X(15).                  EL512
00379      16  WS-M-INSURED-FIRST-NAME      PIC X(10).                  EL512
00380      16  WS-M-INSURED-MID-INIT        PIC X.                      EL512
00381      16  WS-M-INSURED-AGE             PIC 99.                     EL512
00382      16  WS-M-INSURED-BIRTHDAY        PIC XX.                     EL512
00383      16  WS-M-INSURED-SEX             PIC X.                      EL512
00384      16  WS-M-INSURED-SOC-SEC-NO      PIC X(11).                  EL512
00385      16  WS-M-INSURED-ADDRESS-1       PIC X(30).                  EL512
00386      16  WS-M-INSURED-ADDRESS-2       PIC X(30).                  EL512
00387      16  WS-M-INSURED-CITY-STATE.
               20  WS-M-INSURED-CITY        PIC X(28).
               20  WS-M-INSURED-STATE       PIC XX.
00388      16  WS-M-INSURED-ZIP-CODE        PIC X(9).                   EL512
00389      16  WS-M-INSURED-PHONE-NO        PIC 9(10).
           16  WS-M-CRED-BENE-NAME          PIC X(30).
           16  WS-M-CRED-BENE-ADDR1         PIC X(30).
           16  WS-M-CRED-BENE-ADDR2         PIC X(30).
           16  WS-M-CRED-BENE-CITYST.
               20  WS-M-CRED-BENE-CITY      PIC X(28).
               20  WS-M-CRED-BENE-STATE     PIC XX.

00391                                      COPY ELCDATE.                   CL*12
00392      EJECT                                                        EL512
00393                                      COPY ELCDTECX.               EL512
00394      EJECT                                                        EL512
00395                                      COPY ELCDTEVR.               EL512
00396      EJECT                                                        EL512
00397                                                                   EL512
00398  01  WS-HEADING1.                                                 EL512
00399      05  FILLER                      PIC X(48) VALUE '1'.         EL512
00400      05  FILLER                      PIC X(26) VALUE              EL512
00401          'DATA LOAD PRE-EDIT LISTING'.                            EL512
00402      05  FILLER                      PIC X(46) VALUE SPACES.      EL512
00403      05  FILLER                      PIC X(8)  VALUE 'EL512  '.   EL512
00404                                                                   EL512
00405  01  WS-HEADING2.                                                 EL512
00406      05  FILLER                      PIC X(45) VALUE SPACES.      EL512
00407      05  WS-H2-CLIENT-NAME           PIC X(30) VALUE SPACES.      EL512
00408      05  FILLER                      PIC X(45) VALUE SPACES.      EL512
00409      05  WS-H2-DATE                  PIC X(8).                    EL512
00410                                                                   EL512
00411  01  WS-HEADING3.                                                 EL512
00412      05  FILLER                      PIC X(52) VALUE              EL512
00413          ' CAR  GROUP  ST  ACCOUNT     ACCOUNT NAME'.             EL512
00414      05  WS-H3-DATE                  PIC X(18).                   EL512
00415      05  FILLER                      PIC X(50) VALUE SPACES.      EL512
00416      05  FILLER                      PIC X(4)  VALUE 'PAGE'.      EL512
00417      05  WS-H3-PAGE                  PIC ZZZ9.                    EL512
00418                                                                   EL512
00419  01  WS-HEADING4.                                                 EL512
00420      05  FILLER                      PIC XX    VALUE  '0'.        EL512
00421      05  H4-CARRIER                  PIC X     VALUE  SPACE.      EL512
00422      05  FILLER                      PIC XX    VALUE  SPACES.     EL512
00423      05  H4-GROUPING                 PIC X(6)  VALUE  SPACES.     EL512
00424      05  FILLER                      PIC XX    VALUE  SPACES.     EL512
00425      05  H4-STATE                    PIC XX    VALUE  SPACES.     EL512
00426      05  FILLER                      PIC XX    VALUE  SPACES.     EL512
00427      05  H4-ACCOUNT                  PIC X(10) VALUE  SPACES.     EL512
00428      05  FILLER                      PIC XX    VALUE  SPACES.     EL512
00429      05  H4-ACCOUNT-NAME             PIC X(30) VALUE  SPACES.     EL512
00430                                                                   EL512
00431  01  WS-HEADING5.                                                 EL512
00432      05  FILLER                      PIC X(42) VALUE  SPACES.     EL512
00433      05  H5-L1                       PIC X(6).                    EL512
00434      05  FILLER                      PIC X(10) VALUE SPACES.      EL512
00435      05  H5-L2                       PIC X(6).                    EL512
00436      05  FILLER                      PIC X(10) VALUE  SPACES.     EL512
00437      05  H5-A1                       PIC X(6).                    EL512
00438      05  FILLER                      PIC X(10) VALUE SPACES.      EL512
00439      05  H5-A2                       PIC X(6).                    EL512
00440      05  FILLER                      PIC X(30).                   EL512
00441                                                                   EL512
00442  01  WS-HEADING6.                                                 EL512
00443      05  FILLER                      PIC X(40) VALUE              EL512
00444          ' BATCH NO  SEQ NO  TYPE  CERT NUMBER    '.              EL512
00445      05  FILLER                      PIC X(40)  VALUE             EL512
00446          '  PREMIUM          REFUND         PREMIU'.              EL512
00447      05  FILLER                      PIC X(40) VALUE              EL512
00448          'M          REFUND   ************ ERRORS '.              EL512
00449      05  FILLER                      PIC X(12) VALUE              EL512
00450          '************'.                                          EL512
00451                                                                   EL512
00452  01  WS-HEADING7.                                                 EL512
00453      05  FILLER                      PIC X(132) VALUE             EL512
00454          '0** BATCH TOTALS ** ISS CNT CAN CNT     '.              EL512
00455                                                                   EL512
00456  01  WS-HEADING8.                                                 EL512
00457      05  FILLER                      PIC X(132) VALUE             EL512
00458          '0**ACCOUNT TOTALS** ISS CNT CAN CNT     '.              EL512
00459                                                                   EL512
00460  01  WS-HEADING9.                                                 EL512
00461      05  FILLER                      PIC X(132) VALUE             EL512
00462          '0** FINAL TOTALS ** ISS CNT CAN CNT     '.              EL512
00463                                                                   EL512
00464  01  WS-DETAIL1.                                                  EL512
00465      05  WS-DETAIL1A.                                             EL512
00466          10  FILLER                  PIC X.                       EL512
00467          10  P-BATCH-NO              PIC X(6).                    EL512
00468          10  FILLER                  PIC X(5).                    EL512
00469          10  P-SEQ-NO                PIC X(4).                    EL512
00470          10  FILLER                  PIC XX.                      EL512
00471          10  P-TYPE                  PIC X(6).                    EL512
00472          10  FILLER                  PIC XX.                      EL512
00473          10  P-CERT-NO               PIC X(11).                   EL512
00474          10  FILLER                  PIC X.                       EL512
00475          10  P-LF-PREMIUM            PIC Z,ZZZ,ZZZ.99-.           EL512
00476          10  FILLER                  PIC XXX.                     EL512
00477          10  P-LF-REFUND             PIC Z,ZZZ,ZZZ.99-.           EL512
00478          10  FILLER                  PIC XXX.                     EL512
00479          10  P-AH-PREMIUM            PIC Z,ZZZ,ZZZ.99-.           EL512
00480          10  FILLER                  PIC XXX.                     EL512
00481          10  P-AH-REFUND             PIC Z,ZZZ,ZZZ.99-.           EL512
00482          10  FILLER                  PIC X.                       EL512
00483      05  WS-DETAIL1B.                                             EL512
00484          10  P-ERROR-DESC            PIC X(40).                   EL512
00485                                                                   EL512
00486  01  WS-TOTAL-LINE1                  REDEFINES                    EL512
00487      WS-DETAIL1.                                                  EL512
00488      05  WS-T1-CTL                   PIC X.                       EL512
00489      05  WS-T1-DESC                  PIC X(18).                   EL512
00490      05  FILLER                      PIC XX.                      EL512
00491      05  WS-T1-ISSUE-COUNT           PIC ZZ,ZZ9-.                 EL512
00492      05  FILLER                      PIC X.                       EL512
00493      05  WS-T1-CANCEL-COUNT          PIC ZZ,ZZ9-.                 EL512
00494      05  FILLER                      PIC XX.                      EL512
00495      05  WS-T1-LIFE-PREMIUM          PIC Z,ZZZ,ZZZ.99-.           EL512
00496      05  FILLER                      PIC XXX.                     EL512
00497      05  WS-T1-LIFE-REFUND           PIC Z,ZZZ,ZZZ.99-.           EL512
00498      05  FILLER                      PIC XXX.                     EL512
00499      05  WS-T1-AH-PREMIUM            PIC Z,ZZZ,ZZZ.99-.           EL512
00500      05  FILLER                      PIC XXX.                     EL512
00501      05  WS-T1-AH-REFUND             PIC Z,ZZZ,ZZZ.99-.           EL512
00502      05  FILLER                      PIC X.                       EL512
00503      05  WS-T1-ERROR-DESC            PIC X(32).                   EL512
00504                                                                   EL512
00505  01  WS-TOTAL-LINE2                  REDEFINES                    EL512
00506      WS-DETAIL1.                                                  EL512
00507      05  FILLER                      PIC X.                       EL512
00508      05  WS-T2-DESC                  PIC X(33).                   EL512
00509      05  FILLER                      PIC XX.                      EL512
00510      05  WS-T2-COUNT                 PIC Z,ZZZ,ZZ9-.              EL512
00511      05  FILLER                      PIC X(86).                   EL512
00512                                                                   EL512
00513  01  WS-SAVE-DETAIL1A                PIC X(100) VALUE SPACES.     EL512
00514                                                                   EL512
00515      EJECT                                                        EL512
00516  01  WS-TOTAL-LINES-AREA.                                         EL512
00517    02  WS-TOTAL-1.                                                EL512
00518      05  FILLER                      PIC X(18) VALUE              EL512
00519          'REMITTED'.                                              EL512
00520      05  WS-BT-CNTL-ISS-CNT          PIC S9(5)    COMP-3 VALUE +0.EL512
00521      05  WS-BT-CNTL-CAN-CNT          PIC S9(5)    COMP-3 VALUE +0.EL512
00522      05  WS-BT-CNTL-LF-PREMIUM       PIC S9(7)V99 COMP-3 VALUE +0.EL512
00523      05  WS-BT-CNTL-LF-REFUND        PIC S9(7)V99 COMP-3 VALUE +0.EL512
00524      05  WS-BT-CNTL-AH-PREMIUM       PIC S9(7)V99 COMP-3 VALUE +0.EL512
00525      05  WS-BT-CNTL-AH-REFUND        PIC S9(7)V99 COMP-3 VALUE +0.EL512
00526                                                                   EL512
00527    02  WS-TOTAL-2.                                                EL512
00528      05  FILLER                      PIC X(18) VALUE              EL512
00529          'ENTERED'.                                               EL512
00530      05  WS-BT-ENTR-ISS-CNT          PIC S9(5)    COMP-3 VALUE +0.EL512
00531      05  WS-BT-ENTR-CAN-CNT          PIC S9(5)    COMP-3 VALUE +0.EL512
00532      05  WS-BT-ENTR-LF-PREMIUM       PIC S9(7)V99 COMP-3 VALUE +0.EL512
00533      05  WS-BT-ENTR-LF-REFUND        PIC S9(7)V99 COMP-3 VALUE +0.EL512
00534      05  WS-BT-ENTR-AH-PREMIUM       PIC S9(7)V99 COMP-3 VALUE +0.EL512
00535      05  WS-BT-ENTR-AH-REFUND        PIC S9(7)V99 COMP-3 VALUE +0.EL512
00536                                                                   EL512
00537    02  WS-TOTAL-3.                                                EL512
00538      05  FILLER                      PIC X(18) VALUE              EL512
00539          'DIFFERENCE'.                                            EL512
00540      05  WS-BT-DIFF-ISS-CNT          PIC S9(5)    COMP-3 VALUE +0.EL512
00541      05  WS-BT-DIFF-CAN-CNT          PIC S9(5)    COMP-3 VALUE +0.EL512
00542      05  WS-BT-DIFF-LF-PREMIUM       PIC S9(7)V99 COMP-3 VALUE +0.EL512
00543      05  WS-BT-DIFF-LF-REFUND        PIC S9(7)V99 COMP-3 VALUE +0.EL512
00544      05  WS-BT-DIFF-AH-PREMIUM       PIC S9(7)V99 COMP-3 VALUE +0.EL512
00545      05  WS-BT-DIFF-AH-REFUND        PIC S9(7)V99 COMP-3 VALUE +0.EL512
00546                                                                   EL512
00547    02  WS-TOTAL-4.                                                EL512
00548      05  FILLER                      PIC X(18) VALUE              EL512
00549          'REMITTED'.                                              EL512
00550      05  WS-AT-CNTL-ISS-CNT          PIC S9(5)    COMP-3 VALUE +0.EL512
00551      05  WS-AT-CNTL-CAN-CNT          PIC S9(5)    COMP-3 VALUE +0.EL512
00552      05  WS-AT-CNTL-LF-PREMIUM       PIC S9(7)V99 COMP-3 VALUE +0.EL512
00553      05  WS-AT-CNTL-LF-REFUND        PIC S9(7)V99 COMP-3 VALUE +0.EL512
00554      05  WS-AT-CNTL-AH-PREMIUM       PIC S9(7)V99 COMP-3 VALUE +0.EL512
00555      05  WS-AT-CNTL-AH-REFUND        PIC S9(7)V99 COMP-3 VALUE +0.EL512
00556                                                                   EL512
00557    02  WS-TOTAL-5.                                                EL512
00558      05  FILLER                      PIC X(18) VALUE              EL512
00559          'ENTERED'.                                               EL512
00560      05  WS-AT-ENTR-ISS-CNT          PIC S9(5)    COMP-3 VALUE +0.EL512
00561      05  WS-AT-ENTR-CAN-CNT          PIC S9(5)    COMP-3 VALUE +0.EL512
00562      05  WS-AT-ENTR-LF-PREMIUM       PIC S9(7)V99 COMP-3 VALUE +0.EL512
00563      05  WS-AT-ENTR-LF-REFUND        PIC S9(7)V99 COMP-3 VALUE +0.EL512
00564      05  WS-AT-ENTR-AH-PREMIUM       PIC S9(7)V99 COMP-3 VALUE +0.EL512
00565      05  WS-AT-ENTR-AH-REFUND        PIC S9(7)V99 COMP-3 VALUE +0.EL512
00566                                                                   EL512
00567    02  WS-TOTAL-6.                                                EL512
00568      05  FILLER                      PIC X(18) VALUE              EL512
00569          'DIFFERENCE'.                                            EL512
00570      05  WS-AT-DIFF-ISS-CNT          PIC S9(5)    COMP-3 VALUE +0.EL512
00571      05  WS-AT-DIFF-CAN-CNT          PIC S9(5)    COMP-3 VALUE +0.EL512
00572      05  WS-AT-DIFF-LF-PREMIUM       PIC S9(7)V99 COMP-3 VALUE +0.EL512
00573      05  WS-AT-DIFF-LF-REFUND        PIC S9(7)V99 COMP-3 VALUE +0.EL512
00574      05  WS-AT-DIFF-AH-PREMIUM       PIC S9(7)V99 COMP-3 VALUE +0.EL512
00575      05  WS-AT-DIFF-AH-REFUND        PIC S9(7)V99 COMP-3 VALUE +0.EL512
00576                                                                   EL512
00577    02  WS-TOTAL-7.                                                EL512
00578      05  FILLER                      PIC X(18) VALUE              EL512
00579          'INVALID REMITTED'.                                      EL512
00580      05  WS-IN-CNTL-ISS-CNT          PIC S9(5)    COMP-3 VALUE +0.EL512
00581      05  WS-IN-CNTL-CAN-CNT          PIC S9(5)    COMP-3 VALUE +0.EL512
00582      05  WS-IN-CNTL-LF-PREMIUM       PIC S9(7)V99 COMP-3 VALUE +0.EL512
00583      05  WS-IN-CNTL-LF-REFUND        PIC S9(7)V99 COMP-3 VALUE +0.EL512
00584      05  WS-IN-CNTL-AH-PREMIUM       PIC S9(7)V99 COMP-3 VALUE +0.EL512
00585      05  WS-IN-CNTL-AH-REFUND        PIC S9(7)V99 COMP-3 VALUE +0.EL512
00586                                                                   EL512
00587    02  WS-TOTAL-8.                                                EL512
00588      05  FILLER                      PIC X(18) VALUE              EL512
00589          'INVALID ENTERED'.                                       EL512
00590      05  WS-IN-ENTR-ISS-CNT          PIC S9(5)    COMP-3 VALUE +0.EL512
00591      05  WS-IN-ENTR-CAN-CNT          PIC S9(5)    COMP-3 VALUE +0.EL512
00592      05  WS-IN-ENTR-LF-PREMIUM       PIC S9(7)V99 COMP-3 VALUE +0.EL512
00593      05  WS-IN-ENTR-LF-REFUND        PIC S9(7)V99 COMP-3 VALUE +0.EL512
00594      05  WS-IN-ENTR-AH-PREMIUM       PIC S9(7)V99 COMP-3 VALUE +0.EL512
00595      05  WS-IN-ENTR-AH-REFUND        PIC S9(7)V99 COMP-3 VALUE +0.EL512
00596                                                                   EL512
00597    02  WS-TOTAL-9.                                                EL512
00598      05  FILLER                      PIC X(18) VALUE              EL512
00599          'INVALID DIFFERENCE'.                                    EL512
00600      05  WS-IN-DIFF-ISS-CNT          PIC S9(5)    COMP-3 VALUE +0.EL512
00601      05  WS-IN-DIFF-CAN-CNT          PIC S9(5)    COMP-3 VALUE +0.EL512
00602      05  WS-IN-DIFF-LF-PREMIUM       PIC S9(7)V99 COMP-3 VALUE +0.EL512
00603      05  WS-IN-DIFF-LF-REFUND        PIC S9(7)V99 COMP-3 VALUE +0.EL512
00604      05  WS-IN-DIFF-AH-PREMIUM       PIC S9(7)V99 COMP-3 VALUE +0.EL512
00605      05  WS-IN-DIFF-AH-REFUND        PIC S9(7)V99 COMP-3 VALUE +0.EL512
00606                                                                   EL512
00607    02  WS-TOTAL-10.                                               EL512
00608      05  FILLER                      PIC X(18) VALUE              EL512
00609          'VALID REMITTED'.                                        EL512
00610      05  WS-FT-CNTL-ISS-CNT          PIC S9(5)    COMP-3 VALUE +0.EL512
00611      05  WS-FT-CNTL-CAN-CNT          PIC S9(5)    COMP-3 VALUE +0.EL512
00612      05  WS-FT-CNTL-LF-PREMIUM       PIC S9(7)V99 COMP-3 VALUE +0.EL512
00613      05  WS-FT-CNTL-LF-REFUND        PIC S9(7)V99 COMP-3 VALUE +0.EL512
00614      05  WS-FT-CNTL-AH-PREMIUM       PIC S9(7)V99 COMP-3 VALUE +0.EL512
00615      05  WS-FT-CNTL-AH-REFUND        PIC S9(7)V99 COMP-3 VALUE +0.EL512
00616                                                                   EL512
00617    02  WS-TOTAL-11.                                               EL512
00618      05  FILLER                      PIC X(18) VALUE              EL512
00619          'VALID ENTERED'.                                         EL512
00620      05  WS-FT-ENTR-ISS-CNT          PIC S9(5)    COMP-3 VALUE +0.EL512
00621      05  WS-FT-ENTR-CAN-CNT          PIC S9(5)    COMP-3 VALUE +0.EL512
00622      05  WS-FT-ENTR-LF-PREMIUM       PIC S9(7)V99 COMP-3 VALUE +0.EL512
00623      05  WS-FT-ENTR-LF-REFUND        PIC S9(7)V99 COMP-3 VALUE +0.EL512
00624      05  WS-FT-ENTR-AH-PREMIUM       PIC S9(7)V99 COMP-3 VALUE +0.EL512
00625      05  WS-FT-ENTR-AH-REFUND        PIC S9(7)V99 COMP-3 VALUE +0.EL512
00626                                                                   EL512
00627    02  WS-TOTAL-12.                                               EL512
00628      05  FILLER                      PIC X(18) VALUE              EL512
00629          'VALID DIFFERENCE'.                                      EL512
00630      05  WS-FT-DIFF-ISS-CNT          PIC S9(5)    COMP-3 VALUE +0.EL512
00631      05  WS-FT-DIFF-CAN-CNT          PIC S9(5)    COMP-3 VALUE +0.EL512
00632      05  WS-FT-DIFF-LF-PREMIUM       PIC S9(7)V99 COMP-3 VALUE +0.EL512
00633      05  WS-FT-DIFF-LF-REFUND        PIC S9(7)V99 COMP-3 VALUE +0.EL512
00634      05  WS-FT-DIFF-AH-PREMIUM       PIC S9(7)V99 COMP-3 VALUE +0.EL512
00635      05  WS-FT-DIFF-AH-REFUND        PIC S9(7)V99 COMP-3 VALUE +0.EL512
00636                                                                   EL512
00637  01  FILLER                          REDEFINES                    EL512
00638      WS-TOTAL-LINES-AREA.                                         EL512
00639      05  FILLER                      OCCURS 12 TIMES              EL512
00640          INDEXED BY TOT-INDX  TOT-INDX1  TOT-INDX2.               EL512
00641          10  WS-TOTAL-DESC           PIC X(18).                   EL512
00642          10  WS-TOTAL-ISS-CNT        PIC S9(5)     COMP-3.        EL512
00643          10  WS-TOTAL-CAN-CNT        PIC S9(5)     COMP-3.        EL512
00644          10  WS-TOTAL-LF-PREMIUM     PIC S9(7)V99  COMP-3.        EL512
00645          10  WS-TOTAL-LF-REFUND      PIC S9(7)V99  COMP-3.        EL512
00646          10  WS-TOTAL-AH-PREMIUM     PIC S9(7)V99  COMP-3.        EL512
00647          10  WS-TOTAL-AH-REFUND      PIC S9(7)V99  COMP-3.        EL512
00648                                                                   EL512
00649  01  TOT-INDX-MAX                    PIC S9(4)   VALUE +6         EL512
00650                                      COMP.                        EL512
00651  01  TOT-INDX1-MAX                   PIC S9(4)   VALUE +9         EL512
00652                                      COMP.                        EL512
00653  01  TOT-INDX2-MAX                   PIC S9(4)   VALUE +12        EL512
00654                                      COMP.                        EL512
00655                                                                   EL512
00656  01  WS-FINAL-TOTAL-AREA.                                         EL512
00657      05  WS-TOT-1.                                                EL512
00658          10  FILLER                  PIC X(33) VALUE              EL512
00659              'ISSUE PROFILES'.                                    EL512
00660          10  WS-FT-ISS-CNT           PIC S9(7) VALUE +0  COMP-3.  EL512
00661      05  WS-TOT-2.                                                EL512
00662          10  FILLER                  PIC X(33) VALUE              EL512
00663              'ISSUE-OTHERS '.                                     EL512
00664          10  WS-FT-LTYPE-ISS-CNT     PIC S9(7) VALUE +0  COMP-3.  EL512
00665      05  WS-TOT-3.                                                EL512
00666          10  FILLER                  PIC X(33) VALUE              EL512
00667              'INVALID ISSUE-OTHERS '.                             EL512
00668          10  WS-FT-INVL-LTYPE-ISS-CNT PIC S9(7) VALUE +0 COMP-3.  EL512
00669      05  WS-TOT-4.                                                EL512
00670          10  FILLER                  PIC X(33) VALUE              EL512
00671              'INVALID ACCOUNT ISSUES'.                            EL512
00672          10  WS-FT-INVL-ISS-CNT      PIC S9(7) VALUE +0  COMP-3.  EL512
00673      05  WS-TOT-5.                                                EL512
00674          10  FILLER                  PIC X(33) VALUE              EL512
00675              'INVALID CERTIFICATE ISSUES'.                        EL512
00676          10  WS-FT-INVL-CERT-ISS-CNT PIC S9(7) VALUE +0  COMP-3.  EL512
00677      05  WS-TOT-6.                                                EL512
00678          10  FILLER                  PIC X(33) VALUE              EL512
00679              'NET ISSUES'.                                        EL512
00680          10  WS-FT-NET-ISS-CNT       PIC S9(7) VALUE +0  COMP-3.  EL512
00681      05  WS-TOT-7.                                                EL512
00682          10  FILLER                  PIC X(33) VALUE              EL512
00683              'CANCELS ENTERED'.                                   EL512
00684          10  WS-FT-CAN-CNT           PIC S9(7) VALUE +0  COMP-3.  EL512
00685      05  WS-TOT-8.                                                EL512
00686          10  FILLER                  PIC X(33) VALUE              EL512
00687              'INVALID ACCOUNT CANCELS'.                           EL512
00688          10  WS-FT-INVL-CAN-CNT      PIC S9(7) VALUE +0  COMP-3.  EL512
00689      05  WS-TOT-9.                                                EL512
00690          10  FILLER                  PIC X(33) VALUE              EL512
00691              'INVALID CERTIFICATE CANCELS'.                       EL512
00692          10  WS-FT-INVL-CERT-CAN-CNT PIC S9(7) VALUE +0  COMP-3.  EL512
00693      05  WS-TOT-10.                                               EL512
00694          10  FILLER                  PIC X(33) VALUE              EL512
00695              'NET CANCELS'.                                       EL512
00696          10  WS-FT-NET-CAN-CNT       PIC S9(7) VALUE +0  COMP-3.  EL512
00697      05  WS-TOT-11.                                               EL512
00698          10  FILLER                  PIC X(33) VALUE              EL512
00699              'TOTAL INVALID TRANSACTIONS'.                        EL512
00700          10  WS-FT-INVL-TRAN-CNT     PIC S9(7) VALUE +0  COMP-3.  EL512
00701      05  WS-TOT-12.                                               EL512
00702          10  FILLER                  PIC X(33) VALUE              EL512
00703              'TOTAL ISSUES & CANCELS '.                           EL512
00704          10  WS-FT-ISS-CAN-CNT       PIC S9(7) VALUE +0  COMP-3.  EL512
00705      05  WS-TOT-13.                                               EL512
00706          10  FILLER                  PIC X(33) VALUE              EL512
00707              'TOTAL NO. BATCH HEADERS   '.                        EL512
00708          10  WS-FT-REMIT-CNT         PIC S9(7) VALUE +0  COMP-3.  EL512
00709      05  WS-TOT-14.                                               EL512
00710          10  FILLER                  PIC X(33) VALUE              EL512
00711              'TOTAL BULK LOAD RECORDS'.                           EL512
00712          10  WS-FT-TOTAL-CNT         PIC S9(7) VALUE +0  COMP-3.  EL512
00713                                                                   EL512
00714  01  FILLER                          REDEFINES                    EL512
00715      WS-FINAL-TOTAL-AREA.                                         EL512
00716      05  FILLER                      OCCURS 14 TIMES              EL512
00717          INDEXED BY FINAL-INDX.                                   EL512
00718          10  WS-FINAL-DESC            PIC X(33).                  EL512
00719          10  WS-FINAL-COUNT           PIC S9(7)     COMP-3.       EL512
00720                                                                   EL512
00721  01  FINAL-INDX-MAX                   PIC S9(4)   VALUE +14       EL512
00722                                       COMP.                       EL512
00723      EJECT                                                        EL512
00724  01  JHL-ACCT-CONV-TABLE.                                         EL512
00725      12  FILLER                       PIC X(38)   VALUE           EL512
00726              '10000093100002631201026397NY00000-000A'.            EL512
00727      12  FILLER                       PIC X(38)   VALUE           EL512
00728              '10000093100002631211026397NY00000-000B'.            EL512
00729      12  FILLER                       PIC X(38)   VALUE           EL512
00730              '10000093100002631221026397NY00000-000Z'.            EL512
00731      12  FILLER                       PIC X(38)   VALUE           EL512
00732              '10000203100000262511026383NY00000-000Z'.            EL512
00733      12  FILLER                       PIC X(38)   VALUE           EL512
00734              '10000103100002532811X26142NY00050-0001'.            EL512
00735      12  FILLER                       PIC X(38)   VALUE           EL512
00736              '10000103100002532821X26142NY00050-0002'.            EL512
00737      12  FILLER                       PIC X(38)   VALUE           EL512
00738              '10000103100002532831X26142NY00050-0003'.            EL512
00739      12  FILLER                       PIC X(38)   VALUE           EL512
00740              '10000103100002532841X26142NY00050-0006'.            EL512
00741      12  FILLER                       PIC X(38)   VALUE           EL512
00742              '10000103100002532851X26142NY00050-000A'.            EL512
00743      12  FILLER                       PIC X(38)   VALUE           EL512
00744              '10000043100000249201026142NY00024-0000'.            EL512
00745      12  FILLER                       PIC X(38)   VALUE           EL512
00746              '10000043100000250421026142NY00025-0000'.            EL512
00747      12  FILLER                       PIC X(38)   VALUE           EL512
00748              '10000049900000256851026142DE00027-0000'.            EL512
00749      12  FILLER                       PIC X(38)   VALUE           EL512
00750              '10000043100000261431026142NY00000-000A'.            EL512
00751      12  FILLER                       PIC X(38)   VALUE           EL512
00752              '10000043100000264141026142NY00026-0000'.            EL512
00753      12  FILLER                       PIC X(38)   VALUE           EL512
00754              '10000049900000267581026142DE00028-0000'.            EL512
00755      12  FILLER                       PIC X(38)   VALUE           EL512
00756              '10000043100000271151026142NY00021-0000'.            EL512
00757      12  FILLER                       PIC X(38)   VALUE           EL512
00758              '10000043100002527411026142NY00020-0000'.            EL512
00759      12  FILLER                       PIC X(38)   VALUE           EL512
00760              '10000043100002527421026142NY00020-0001'.            EL512
00761      12  FILLER                       PIC X(38)   VALUE           EL512
00762              '10000043100002527431026142NY00020-0002'.            EL512
00763      12  FILLER                       PIC X(38)   VALUE           EL512
00764              '10000043100002527441026142NY00020-0003'.            EL512
00765      12  FILLER                       PIC X(38)   VALUE           EL512
00766              '10000232900002170311026384NJ00000-000Z'.            EL512
00767      12  FILLER                       PIC X(38)   VALUE           EL512
00768              '10000033700000280121026403PA00000-000Z'.            EL512
00769      12  FILLER                       PIC X(38)   VALUE           EL512
00770              '10000033700000280131026403PA00001-0000'.            EL512
00771      12  FILLER                       PIC X(38)   VALUE           EL512
00772              '10000033700000280211026403PA00002-0000'.            EL512
00773      12  FILLER                       PIC X(38)   VALUE           EL512
00774              '10000304800000268121026382WI00000-000Z'.            EL512
00775      12  FILLER                       PIC X(38)   VALUE           EL512
00776              '10000033700000280191026403PA00006-0000'.            EL512
00777      12  FILLER                       PIC X(38)   VALUE           EL512
00778              '10000033700000280231026403PA00008-0000'.            EL512
00779      12  FILLER                       PIC X(38)   VALUE           EL512
00780              '10000033700000280161026403PA00010-0000'.            EL512
00781      12  FILLER                       PIC X(38)   VALUE           EL512
00782              '10000033700000280221026403PA00010-000A'.            EL512
00783      12  FILLER                       PIC X(38)   VALUE           EL512
00784              '10000012900000260051026387NJ00000-000Z'.            EL512
00785      12  FILLER                       PIC X(38)   VALUE           EL512
00786              '10000172800000265981026393NH00000-000Z'.            EL512
00787      12  FILLER                       PIC X(38)   VALUE           EL512
00788              '10000313100000256181026392NY00000-0001'.            EL512
00789      12  FILLER                       PIC X(38)   VALUE           EL512
00790              '10000123400000219941026407OH00000-000Z'.            EL512
00791      12  FILLER                       PIC X(38)   VALUE           EL512
00792              '10000023700000261531026402PA00000-000Z'.            EL512
00793      12  FILLER                       PIC X(38)   VALUE           EL512
00794              '100000237000026153A1026402PA00000-0001'.            EL512
00795      12  FILLER                       PIC X(38)   VALUE           EL512
00796              '10000023700000261541026402PA00001-0000'.            EL512
00797      12  FILLER                       PIC X(38)   VALUE           EL512
00798              '10000023700000271241026402PA00000-000A'.            EL512
00799      12  FILLER                       PIC X(38)   VALUE           EL512
00800              '10000023700000271251026402PA00002-0000'.            EL512
00801      12  FILLER                       PIC X(38)   VALUE           EL512
00802              '100000237000027124A1026402PA00002-0001'.            EL512
00803      12  FILLER                       PIC X(38)   VALUE           EL512
00804              '10000222900000190791026391NJ00000-000Z'.            EL512
00805      12  FILLER                       PIC X(38)   VALUE           EL512
00806              '10000063100000255141026399NY00000-000Z'.            EL512
00807      12  FILLER                       PIC X(38)   VALUE           EL512
00808              '10000063100000255161026399NY00002-0000'.            EL512
00809      12  FILLER                       PIC X(38)   VALUE           EL512
00810              '10000063100000255181026399NY00001-0000'.            EL512
00811      12  FILLER                       PIC X(38)   VALUE           EL512
00812              '10000133800000268161026396RI00001-0000'.            EL512
00813      12  FILLER                       PIC X(38)   VALUE           EL512
00814              '10000163100000258841026394NY00000-000Z'.            EL512
00815      12  FILLER                       PIC X(38)   VALUE           EL512
00816              '10000183100000263461026385NY00000-000Z'.            EL512
00817      12  FILLER                       PIC X(38)   VALUE           EL512
00818              HIGH-VALUES.                                         EL512
00819                                                                   EL512
00820  01  JHL-ACCT-CONV-TAB  REDEFINES  JHL-ACCT-CONV-TABLE.           EL512
00821      12  JHL-ACT-ENTRIES  OCCURS  47  TIMES.                      EL512
00822          16  JHL-ACT-CNTRL1.                                      EL512
00823              20  JHL-ACT-CARR1        PIC X(1).                   EL512
00824              20  JHL-ACT-GROUP1       PIC X(6).                   EL512
00825              20  JHL-ACT-ST1          PIC X(2).                   EL512
00826              20  JHL-ACT-ACCT1        PIC X(10).                  EL512
00827          16  JHL-ACT-CNTRL2.                                      EL512
00828              20  JHL-ACT-CARR2        PIC X(1).                   EL512
00829              20  JHL-ACT-GROUP2       PIC X(6).                   EL512
00830              20  JHL-ACT-ST2          PIC X(2).                   EL512
00831              20  JHL-ACT-ACCT2        PIC X(10).                  EL512
00832                                                                   EL512
00833  01  JHL-TEST-CONTROL.                                            EL512
00834      12  JHL-TEST-CARR                PIC X(1).                   EL512
00835      12  JHL-TEST-GROUP               PIC X(6).                   EL512
00836      12  JHL-TEST-ST                  PIC X(2).                   EL512
00837      12  JHL-TEST-ACCT                PIC X(10).                  EL512
00838      EJECT                                                        EL512
00839                                                                   EL512
00840  PROCEDURE DIVISION.                                              EL512
00841                                                                   EL512
00842  0000-LOAD-DATE-CARD.        COPY ELCDTERX SUPPRESS.              EL512
00843                                                                   EL512
00844  0000-MAIN-LOGIC SECTION.                                         EL512
CIDMOD                                                                  EL512
CIDMOD     MOVE +1                     TO TAPE-BATCHES.                 EL512
CIDMOD                                                                  EL512
00846      IF TAPE-BATCHES NOT NUMERIC                                  EL512
00847          MOVE ZERO           TO TAPE-BATCHES.                     EL512
00848                                                                   EL512
110712*    DISPLAY 'DATE CARD = '  DATE-CARD.                           EL512
00850                                                                   EL512
00851      IF TAPE-BATCHES NOT = ZERO                                   EL512
00852           DISPLAY '*********************************'             EL512
00853           DISPLAY '*                               *'             EL512
00854           DISPLAY '*   TAPE INPUT OPTION IS ON     *'             EL512
00855           DISPLAY '*                               *'             EL512
00856           DISPLAY '*********************************'             EL512
00857        ELSE                                                       EL512
00858           DISPLAY '*********************************'             EL512
00859           DISPLAY '*                               *'             EL512
00860           DISPLAY '*   TAPE INPUT OPTION IS OFF    *'             EL512
00861           DISPLAY '*                               *'             EL512
00862           DISPLAY '*********************************'.            EL512
00863                                                                   EL512
00864      PERFORM OPEN-FILES.                                          EL512
00865                                                                   EL512
00866      PERFORM GET-DATE.                                            EL512
00867                                                                   EL512
00868      SORT SORT-FILE                                               EL512
00869                                                                   EL512
00870          ON ASCENDING KEY SR-CONTROL                              EL512
00871              INPUT PROCEDURE  IS 1000-PROCESS-INPUT               EL512
00872              OUTPUT PROCEDURE IS 2000-PROCESS-PENDING-OUT.        EL512
00873                                                                   EL512
00874      PERFORM CLOSE-FILES.                                         EL512
00875                                                                   EL512
00876      GOBACK.                                                      EL512
00877                                                                   EL512
00878      EJECT                                                        EL512
00879  1000-PROCESS-INPUT SECTION.                                      EL512
00880                                                                   EL512
00879  1000-MESSAGE-PARA.                                               EL512
00880                                                                   EL512
00881  1000-READ-CARDS-IN.                                              EL512
00882      READ CARDS-IN INTO PENDING-BUSINESS-IN                       EL512
00883          AT END                                                   EL512
00884              GO TO 1100-CHECK-FOR-TAPE.                           EL512
00885                                                                   EL512
00886      IF NULL-FILE                                                 EL512
00887          GO TO 1000-READ-CARDS-IN.                                EL512
00888                                                                   EL512
00889      GO TO 1300-PROCESS-FILE.                                     EL512
00890                                                                   EL512
00891  1100-CHECK-FOR-TAPE.                                             EL512
00892      IF TAPE-BATCHES = ZERO                                       EL512
00893          GO TO 1900-EXIT.                                         EL512
00894                                                                   EL512
00895      MOVE TAPE-BATCHES           TO WS-NO-OF-INPUTS.              EL512
00896      MOVE +1                     TO WS-PROCESS-SW.                EL512
00897                                                                   EL512
00898      MOVE '**********'           TO  WS-SAVE-ACCOUNT.             EL512
00899                                                                   EL512
00900  1200-READ-PENDING-FILE.                                          EL512
00901      READ  PENDING-IN INTO PENDING-BUSINESS-IN                    EL512
00902        AT END                                                     EL512
00903           GO TO 1900-CLOSE-PENDING-FILE.                          EL512
00904                                                                   EL512
00905      IF PBI-STATE = '$$'                                          EL512
00906          GO TO 1200-READ-PENDING-FILE.                            EL512
00907                                                                   EL512
00908  1300-PROCESS-FILE.                                               EL512
00909      IF WS-SAVE-ACCOUNT = '**********'                            EL512
00910          IF NOT PBI-REMITTANCE                                    EL512
00911              GO TO 1700-BYPASS-RELEASE.                           EL512
00912                                                                   EL512
00913      IF PBI-ISSUE-TRANS                                           EL512
00914          GO TO 1400-ISSUE-TRANS.                                  EL512
00915                                                                   EL512
00916      IF PBI-CANCEL-TRANS                                          EL512
00917          GO TO 1500-CANCEL-TRANS.                                 EL512
00918                                                                   EL512
00919      IF PBI-REMITTANCE                                            EL512
00920          IF DTE-CLIENT = 'JHL'                                    EL512
00921              PERFORM 3600-CHANGE-ACCOUNT-NO  THRU  3699-EXIT      EL512
00922              GO TO 1350-REMITTANCE-TRANS                          EL512
00923          ELSE                                                     EL512
00924          IF DTE-CLIENT = 'NCB'                                    EL512
00925              PERFORM 3700-CHANGE-CARRIER     THRU  3799-EXIT      EL512
00926              GO TO 1350-REMITTANCE-TRANS                          EL512
00927          ELSE                                                     EL512
00928              GO TO 1350-REMITTANCE-TRANS.                         EL512
00929                                                                   EL512
00930       GO TO 1600-RELEASE-RECORD.                                  EL512
00931                                                                   EL512
00932  1350-REMITTANCE-TRANS.                                           EL512
00933      INSPECT PBI-B-LF-PRM-WRITTEN-X                               EL512
00934          REPLACING ALL ' '  BY  ZEROS.                            EL512
00935      INSPECT PBI-B-LF-PRM-CANCELLED-X                             EL512
00936          REPLACING ALL ' '  BY  ZEROS.                            EL512
00937      INSPECT PBI-B-AH-PRM-WRITTEN-X                               EL512
00938          REPLACING ALL ' '  BY  ZEROS.                            EL512
00939      INSPECT PBI-B-AH-PRM-CANCELLED-X                             EL512
00940          REPLACING ALL ' '  BY  ZEROS.                            EL512
00941      INSPECT PBI-B-CERT-ISS-COUNT-X                               EL512
00942          REPLACING ALL ' '  BY  ZEROS.                            EL512
00943      INSPECT PBI-B-CERT-CAN-COUNT-X                               EL512
00944          REPLACING ALL ' '  BY  ZEROS.                            EL512
00945      INSPECT PBI-CARRIER                                          EL512
00946          REPLACING ALL ' '  BY  ZEROS.                            EL512
00947                                                                   EL512
00948      MOVE PBI-CARRIER            TO WS-REM-CARRIER.               EL512
00949      INSPECT PBI-GROUPING                                         EL512
00950          REPLACING ALL ' '  BY  ZEROS.                            EL512
00951      MOVE PBI-GROUPING           TO WS-REM-GROUPING.              EL512
00952      INSPECT PBI-STATE                                            EL512
00953          REPLACING ALL ' '  BY  ZEROS.                            EL512
00954      MOVE PBI-STATE              TO WS-REM-STATE.                 EL512
00955      INSPECT PBI-ACCOUNT                                          EL512
00956          REPLACING ALL ' '  BY  ZEROS.                            EL512
00957      MOVE PBI-ACCOUNT            TO WS-REM-ACCOUNT.               EL512
00958      MOVE SPACES                 TO  SORT-RECORD                  EL512
00959                                      WS-SR-CONTROL                EL512
00960                                      WS-SAVE-CERT-NO.             EL512
00961                                                                   EL512
00962      PERFORM 6300-PROCESS-ACCOUNT.                                EL512
00963                                                                   EL512
00964      MOVE ZEROS                  TO  WS-SEQ-NO.                   EL512
00965      MOVE +0                     TO  WS-SR-ISSUE-STATUS.          EL512
00966                                                                   EL512
00967      IF PBI-B-BATCH-NO-X = SPACES OR ZEROS                        EL512
00968          PERFORM 6200-GET-BATCH-NO THRU 6200-EXIT                 EL512
00969          MOVE WS-BATCH-NO        TO  WS-SR-BATCH-NO               EL512
00970      ELSE                                                         EL512
00971          MOVE PBI-B-BATCH-NO-X   TO  WS-SR-BATCH-NO.              EL512
00972                                                                   EL512
00973      GO TO 1600-RELEASE-RECORD.                                   EL512
00974                                                                   EL512
00975  1400-ISSUE-TRANS.                                                EL512
00974                                                                   EL512
00976      INSPECT PBI-CERT-EFF-DT-X                                    EL512
00977          REPLACING ALL ' '  BY  ZEROS.                            EL512
00978                                                                   EL512
00979      IF DTE-CLIENT NOT = 'CRI'                                    EL512
00980          INSPECT PBI-CERT-PRIME                                   EL512
00981              REPLACING ALL ' '  BY  ZEROS.                        EL512
00982                                                                   EL512
00983      IF PBI-JOINT                                                 EL512
00984          GO TO 1410-ISSUE-FORM2-TRANS.                            EL512
00985      IF PBI-LIFE                                                  EL512
00986          GO TO 1420-ISSUE-FORM3-TRANS.                            EL512
00987      IF PBI-AH                                                    EL512
00988          GO TO 1430-ISSUE-FORM4-TRANS.                            EL512
00989      IF PBI-LOAN-INFO                                             EL512
00990          GO TO 1440-ISSUE-FORM5-TRANS.                            EL512
00991      IF PBI-ADDR-1                                                EL512
00992          GO TO 1450-ISSUE-FORM6-TRANS.                            EL512
00993      IF PBI-ADDR-2                                                EL512
00994          GO TO 1460-ISSUE-FORM7-TRANS.                            EL512

           IF PBI-CRED-BENE1
              GO TO 1480-ISSUE-FORM8-TRANS
           END-IF
00995                                                                   EL512
00996      IF PBI-CERT-NO = WS-SAVE-CERT-NO                             EL512
00997          DISPLAY '*************************************'          EL512
00998          DISPLAY WS-SAVE-CERT-NO 'ISSUE *** POSSIBLE DUPLICATE'   EL512
00999          DISPLAY '*************************************'          EL512
01000      ELSE                                                         EL512
01001          MOVE PBI-CERT-NO        TO WS-SAVE-CERT-NO.              EL512
01002                                                                   EL512
01003      INSPECT PBI-I-BIRTHDAY-X                                     EL512
01004          REPLACING ALL ' '  BY  ZEROS.                            EL512
01005      INSPECT PBI-I-INSURED-AGE-X                                  EL512
01006          REPLACING ALL ' '  BY  ZEROS.                            EL512
01007                                                                   EL512
01008      MOVE +1                     TO WS-SR-ISSUE-STATUS.           EL512
01009                                                                   EL512
01010      GO TO 1600-RELEASE-RECORD.                                   EL512
01011                                                                   EL512
01012  1410-ISSUE-FORM2-TRANS.                                          EL512
01013      IF PBI-I-ISSUE-REC-SEQ-2 = SPACES                            EL512
01014          GO TO 1700-BYPASS-RELEASE.                               EL512
01015                                                                   EL512
040414     INSPECT PBI-I-JNT-BIRTHDAY-X                                 EL512
040414         REPLACING ALL ' '  BY  ZEROS.                            EL512
040414
01016      INSPECT PBI-I-JOINT-AGE-X                                    EL512
01017          REPLACING ALL ' '  BY  ZEROS.                            EL512
01018                                                                   EL512
01019      IF PBI-CERT-NO = WS-SAVE-CERT-NO                             EL512
01020          SUBTRACT +1             FROM WS-SEQ-NO                   EL512
01021      ELSE                                                         EL512
01022          MOVE PBI-CERT-NO        TO WS-SAVE-CERT-NO.              EL512
01023                                                                   EL512
01024      MOVE +2                     TO WS-SR-ISSUE-STATUS.           EL512
01025                                                                   EL512
01026      GO TO 1600-RELEASE-RECORD.                                   EL512
01027                                                                   EL512
01028  1420-ISSUE-FORM3-TRANS.                                          EL512
01029      IF PBI-I-ISSUE-REC-SEQ-3 = SPACES                            EL512
01030          GO TO 1700-BYPASS-RELEASE.                               EL512
01031                                                                   EL512
01032      INSPECT PBI-I-LF-TERM-X                                      EL512
01033          REPLACING ALL ' '  BY  ZEROS                             EL512
01034      INSPECT PBI-I-LF-PREM-AMT-X                                  EL512
01035          REPLACING ALL ' '  BY  ZEROS                             EL512
01036      INSPECT PBI-I-LF-BENEFIT-AMT-X                               EL512
01037          REPLACING ALL ' '  BY  ZEROS                             EL512
01038      INSPECT PBI-I-LF-ALT-PREM-AMT-X                              EL512
01039          REPLACING ALL ' '  BY  ZEROS                             EL512
01040      INSPECT PBI-I-LF-ALT-BENEFIT-AMT-X                           EL512
01041          REPLACING ALL ' '  BY  ZEROS                             EL512
01042      INSPECT PBI-I-LF-CRIT-PERIOD-X                               EL512
01043          REPLACING ALL ' '  BY  ZEROS                             EL512
01044      INSPECT PBI-I-LF-EXPIRE-DT-X                                 EL512
01045          REPLACING ALL ' '  BY  ZEROS                             EL512
01046      INSPECT PBI-I-TERM-AS-DAYS-X                                 EL512
01047          REPLACING ALL ' '  BY  ZEROS                             EL512
01048                                                                   EL512
01049      MOVE PBI-I-LF-BENEFIT-TYPE  TO WS-BENEFIT-WORK.              EL512
01050      IF WS-FIRST-POS = SPACE                                      EL512
01051          MOVE ZERO               TO WS-FIRST-POS.                 EL512
01052                                                                   EL512
01053      IF WS-SECOND-POS = SPACE                                     EL512
01054          MOVE WS-FIRST-POS       TO WS-SECOND-POS                 EL512
01055          MOVE ZERO               TO WS-FIRST-POS.                 EL512
01056                                                                   EL512
01057      MOVE WS-BENEFIT-WORK        TO PBI-I-LF-BENEFIT-TYPE.        EL512
01058                                                                   EL512
01059      IF PBI-CERT-NO = WS-SAVE-CERT-NO                             EL512
01060          SUBTRACT +1             FROM WS-SEQ-NO                   EL512
01061      ELSE                                                         EL512
01062          MOVE PBI-CERT-NO        TO WS-SAVE-CERT-NO.              EL512
01063                                                                   EL512
01064      MOVE +3                     TO WS-SR-ISSUE-STATUS.           EL512
01065                                                                   EL512
01066      GO TO 1600-RELEASE-RECORD.                                   EL512
01067                                                                   EL512
01068  1430-ISSUE-FORM4-TRANS.                                          EL512
01069      IF PBI-I-ISSUE-REC-SEQ-4 = SPACES                            EL512
01070          GO TO 1700-BYPASS-RELEASE.                               EL512
01071                                                                   EL512
01072      IF PBI-I-AH-BENEFIT-POS1 = LOW-VALUES                        EL512
01073          MOVE SPACE               TO PBI-I-AH-BENEFIT-POS1.       EL512
01074      IF PBI-I-AH-BENEFIT-NO = LOW-VALUES                          EL512
01075          MOVE SPACES              TO PBI-I-AH-BENEFIT-NO.         EL512
01076                                                                   EL512
01077      INSPECT PBI-I-AH-TERM-X                                      EL512
01078          REPLACING ALL ' '  BY  ZEROS                             EL512
01079      INSPECT PBI-I-AH-PREM-AMT-X                                  EL512
01080          REPLACING ALL ' '  BY  ZEROS                             EL512
01081      INSPECT PBI-I-AH-BENEFIT-AMT-X                               EL512
01082          REPLACING ALL ' '  BY  ZEROS                             EL512
01083      INSPECT PBI-I-AH-CRIT-PERIOD-X                               EL512
01084          REPLACING ALL ' '  BY  ZEROS                             EL512
01085      INSPECT PBI-I-AH-EXPIRE-DT-X                                 EL512
01086          REPLACING ALL ' '  BY  ZEROS                             EL512
01087      INSPECT PBI-I-AH-PAYMENT-X                                   EL512
01088          REPLACING ALL ' '  BY  ZEROS.                            EL512
01089                                                                   EL512
01090      IF PBI-CERT-NO = WS-SAVE-CERT-NO                             EL512
01091          SUBTRACT +1  FROM WS-SEQ-NO                              EL512
01092      ELSE                                                         EL512
01093          MOVE PBI-CERT-NO        TO WS-SAVE-CERT-NO.              EL512
01094                                                                   EL512
01095      MOVE +4                     TO WS-SR-ISSUE-STATUS.           EL512
01096                                                                   EL512
01097      GO TO 1600-RELEASE-RECORD.                                   EL512
01098                                                                   EL512
01099  1440-ISSUE-FORM5-TRANS.                                          EL512
01100      IF PBI-I-ISSUE-REC-SEQ-5 = SPACES                            EL512
01101          GO TO 1700-BYPASS-RELEASE.                               EL512
01102                                                                   EL512
01103      INSPECT PBI-I-LOAN-TERM-X                                    EL512
01104          REPLACING ALL ' '  BY  ZEROS.                            EL512
01105      INSPECT PBI-I-1ST-PMT-DT-X                                   EL512
01106          REPLACING ALL ' '  BY  ZEROS.                            EL512
01107      INSPECT PBI-I-EXT-DAYS-X                                     EL512
01108          REPLACING ALL ' '  BY  ZEROS.                            EL512
01109      INSPECT PBI-I-LOAN-APR-X                                     EL512
01110          REPLACING ALL ' '  BY  ZEROS.                            EL512
01111      INSPECT PBI-I-LIVES-X                                        EL512
01112          REPLACING ALL ' '  BY  ZEROS.                            EL512
01113      INSPECT PBI-I-PAY-FREQUENCY-X                                EL512
01114          REPLACING ALL ' '  BY  ZEROS.                            EL512
01115                                                                   EL512
01116      IF PBI-I-REIN-CODE = LOW-VALUES                              EL512
01117          MOVE SPACE              TO PBI-I-REIN-CODE.              EL512
01118      IF PBI-I-SIG-SW = LOW-VALUES                                 EL512
01119          MOVE SPACE              TO PBI-I-SIG-SW.                 EL512
01120      IF PBI-I-RATE-CLASS = LOW-VALUES                             EL512
01121          MOVE SPACES             TO PBI-I-RATE-CLASS.             EL512
01122                                                                   EL512
01123      IF PBI-CERT-NO = WS-SAVE-CERT-NO                             EL512
01124          SUBTRACT +1 FROM WS-SEQ-NO                               EL512
01125      ELSE                                                         EL512
01126          MOVE PBI-CERT-NO        TO WS-SAVE-CERT-NO.              EL512
01127                                                                   EL512
01128      MOVE +5                     TO WS-SR-ISSUE-STATUS.           EL512
01129                                                                   EL512
01130      GO TO 1600-RELEASE-RECORD.                                   EL512
01131                                                                   EL512
01132  1450-ISSUE-FORM6-TRANS.                                          EL512
01133      IF PBI-I-ISSUE-REC-SEQ-6 = SPACES                            EL512
01134          GO TO 1700-BYPASS-RELEASE.                               EL512
01135                                                                   EL512
01136      IF PBI-CERT-NO = WS-SAVE-CERT-NO                             EL512
01137          SUBTRACT +1 FROM WS-SEQ-NO                               EL512
01138      ELSE                                                         EL512
01139          MOVE PBI-CERT-NO        TO WS-SAVE-CERT-NO.              EL512
01140                                                                   EL512
01141      MOVE +6                     TO WS-SR-ISSUE-STATUS.           EL512
01142                                                                   EL512
01143      GO TO 1600-RELEASE-RECORD.                                   EL512
01144                                                                   EL512
01145  1460-ISSUE-FORM7-TRANS.                                          EL512
01146      IF PBI-I-ISSUE-REC-SEQ-7 = SPACES                            EL512
01147          GO TO 1700-BYPASS-RELEASE.                               EL512
01148                                                                   EL512
01149 ** DMD CUSTOM CODE     *****START                                 EL512
01150      IF DTE-CLIENT = 'DMD'                                        EL512
01151          PERFORM 1470-ISSUE-CSO-TRANS                             EL512
01152          MOVE +7                 TO WS-SR-ISSUE-STATUS            EL512
01153          GO TO 1600-RELEASE-RECORD.                               EL512
01154 ** DMD CUSTOM CODE     *****END                                   EL512
01155                                                                   EL512
01156      INSPECT PBI-I-INSURED-PHONE-NO                               EL512
01157          REPLACING ALL ' '  BY  ZEROS.                            EL512
01158      IF PBI-I-INSURED-PHONE-NO NOT NUMERIC                        EL512
01159          MOVE ZERO               TO PBI-I-INSURED-PHONE-NO.       EL512
01160                                                                   EL512
01161      IF PBI-CERT-NO = WS-SAVE-CERT-NO                             EL512
01162          SUBTRACT +1 FROM WS-SEQ-NO                               EL512
01163      ELSE                                                         EL512
01164          MOVE PBI-CERT-NO        TO WS-SAVE-CERT-NO.              EL512
01165                                                                   EL512
01166      MOVE +7                     TO WS-SR-ISSUE-STATUS.           EL512
01167                                                                   EL512
01168      GO TO 1600-RELEASE-RECORD.                                   EL512
01169                                                                   EL512
01170 ** DMD CUSTOM CODE     *****START                                 EL512
01171  1470-ISSUE-CSO-TRANS.                                            EL512
01172                                                                   EL512
01173      INSPECT PBI-I-DMD-CURRENT-PREM-RATE                          EL512
01174          REPLACING ALL ' '  BY  ZEROS.                            EL512
01175                                                                   EL512
01176      IF PBI-I-DMD-CURRENT-PREM-RATE NOT NUMERIC                   EL512
01177          MOVE ZERO               TO PBI-I-DMD-CURRENT-PREM-RATE.  EL512
01178                                                                   EL512
01179      INSPECT PBI-I-DMD-PRIMA-FACIA-PRM-RATE                       EL512
01180          REPLACING ALL ' '  BY  ZEROS.                            EL512
01181                                                                   EL512
01182      IF PBI-I-DMD-PRIMA-FACIA-PRM-RATE NOT NUMERIC                EL512
01183          MOVE ZERO         TO PBI-I-DMD-PRIMA-FACIA-PRM-RATE.     EL512
01184                                                                   EL512
01185      INSPECT PBI-I-DMD-LIVES                                      EL512
01186          REPLACING ALL ' '  BY  ZEROS.                            EL512
01187                                                                   EL512
01188      IF PBI-I-DMD-LIVES NOT NUMERIC                               EL512
01189          MOVE ZERO               TO PBI-I-DMD-LIVES.              EL512
01190                                                                   EL512
01191      INSPECT PBI-I-DMD-BILLED                                     EL512
01192          REPLACING ALL ' '  BY  ZEROS.                            EL512
01193                                                                   EL512
01194      IF PBI-I-DMD-BILLED NOT NUMERIC                              EL512
01195          MOVE ZERO               TO PBI-I-DMD-BILLED.             EL512
01196                                                                   EL512
01197      IF PBI-CERT-NO = WS-SAVE-CERT-NO                             EL512
01198          SUBTRACT +1 FROM WS-SEQ-NO                               EL512
01199      ELSE                                                         EL512
01200          MOVE PBI-CERT-NO        TO WS-SAVE-CERT-NO.              EL512
01201 ** DMD CUSTOM CODE     *****END                                   EL512
01202                                                                   EL512
       1480-ISSUE-FORM8-TRANS.                              

           IF PBI-I-ISSUE-REC-SEQ-8 = SPACES
              GO TO 1700-BYPASS-RELEASE
           END-IF

           IF PBI-CERT-NO = WS-SAVE-CERT-NO                 
               SUBTRACT +1             FROM WS-SEQ-NO       
           ELSE                                             
               MOVE PBI-CERT-NO        TO WS-SAVE-CERT-NO
           END-IF

           MOVE +8                     TO WS-SR-ISSUE-STATUS

           GO TO 1600-RELEASE-RECORD.                       
01204                                                                   EL512
01205  1500-CANCEL-TRANS.                                               EL512
01206      INSPECT PBI-CERT-EFF-DT-X                                    EL512
01207          REPLACING ALL ' '  BY  ZEROS.                            EL512
01208                                                                   EL512
01209      IF DTE-CLIENT NOT = 'CRI'                                    EL512
01210          INSPECT PBI-CERT-PRIME                                   EL512
01211              REPLACING ALL ' '  BY  ZEROS.                        EL512
01212                                                                   EL512
01213      IF PBI-C-SEQUENCE = '2'                                      EL512
01214         GO TO 1510-EDIT-CANCEL-BENE.                              EL512
01215                                                                   EL512
01216      IF PBI-CERT-NO = WS-SAVE-CERT-NO                             EL512
01217          DISPLAY '*************************************'          EL512
01218          DISPLAY WS-SAVE-CERT-NO 'CANCEL ** POSSIBLE DUPLICATE'   EL512
01219          DISPLAY '*************************************'          EL512
01220        ELSE                                                       EL512
01221          MOVE PBI-CERT-NO         TO WS-SAVE-CERT-NO.             EL512
01222                                                                   EL512
01223      INSPECT PBI-C-LF-CANCEL-DATE-X                               EL512
01224          REPLACING ALL ' '  BY  ZEROS.                            EL512
01225      INSPECT PBI-C-LF-PREM-REFUND-X                               EL512
01226          REPLACING ALL ' '  BY  ZEROS.                            EL512
01227      INSPECT PBI-C-AH-CANCEL-DATE-X                               EL512
01228          REPLACING ALL ' '  BY  ZEROS.                            EL512
01229      INSPECT PBI-C-AH-PREM-REFUND-X                               EL512
01230          REPLACING ALL ' '  BY  ZEROS.                            EL512
01231      INSPECT PBI-C-LIVES-X                                        EL512
01232          REPLACING ALL ' '  BY  ZEROS.                            EL512
01233                                                                   EL512
01234      MOVE +0                     TO  WS-SR-ISSUE-STATUS.          EL512
01235                                                                   EL512
01236      GO TO 1600-RELEASE-RECORD.                                   EL512
01237                                                                   EL512
01238  1510-EDIT-CANCEL-BENE.                                           EL512
01239                                                                   EL512
01240      IF PBI-C-CANCEL-REC-SEQ-2 = SPACES                           EL512
01241         GO TO 1700-BYPASS-RELEASE.                                EL512
01242                                                                   EL512
01243      IF PBI-CERT-NO = WS-SAVE-CERT-NO                             EL512
01244         SUBTRACT +1 FROM WS-SEQ-NO                                EL512
01245      ELSE                                                         EL512
01246         MOVE PBI-CERT-NO         TO WS-SAVE-CERT-NO.              EL512
01247                                                                   EL512
01248      MOVE +1                     TO  WS-SR-ISSUE-STATUS.          EL512
01249                                                                   EL512
01250  1600-RELEASE-RECORD.                                             EL512
01251                                                                   EL512
01252      MOVE WS-SR-CONTROL          TO  SR-CONTROL.                  EL512
01253      MOVE WS-SEQ-NO              TO  SR-SEQ-NO.                   EL512
01254      MOVE PENDING-BUSINESS-IN    TO  SR-REST-OF-RECORD.           EL512
01255                                                                   EL512
01256      RELEASE SORT-RECORD.                                         EL512
01257                                                                   EL512
01258      ADD +1 TO WS-TOT-RECORDS-RELEASED                            EL512
01259                WS-SEQ-NO.                                         EL512
01260                                                                   EL512
01261  1700-BYPASS-RELEASE.                                             EL512
01262      IF PROCESSING-CARDS                                          EL512
01263          GO TO 1000-PROCESS-INPUT                                 EL512
01264      ELSE                                                         EL512
01265          GO TO 1200-READ-PENDING-FILE.                            EL512
01266                                                                   EL512
01267  1900-CLOSE-PENDING-FILE.                                         EL512
01268      CLOSE PENDING-IN.                                            EL512
01269                                                                   EL512
01270      SUBTRACT +1 FROM WS-NO-OF-INPUTS.                            EL512
01271                                                                   EL512
01272      MOVE '**********'           TO  WS-SAVE-ACCOUNT              EL512
01273                                      WS-SAVE-CERT-NO.             EL512
01274                                                                   EL512
01275      IF MORE-INPUT                                                EL512
01276         OPEN INPUT PENDING-IN                                     EL512
01277         IF SYS010-FILE-STATUS NOT = ZEROS                         EL512
pemuni           display ' more input sys010 ' sys010-file-status
01278            DISPLAY 'EL512  SYS010 EMPTY'                          EL512
01279            MOVE '-  ***** EL512 SYS010 EMPTY *****' TO PRT        EL512
01280            PERFORM WRITE-A-LINE                                   EL512
01281            MOVE '-  ***** EL512 SYS010 EMPTY *****' TO PRT        EL512
01282            PERFORM WRITE-A-LINE                                   EL512
01283            GOBACK                                                 EL512
01284         ELSE                                                      EL512
01285            GO TO 1200-READ-PENDING-FILE.                          EL512
01286                                                                   EL512
01287  1900-EXIT.                                                       EL512
01288      EXIT.                                                        EL512
01289                                                                   EL512
01290  2000-PROCESS-PENDING-OUT SECTION.                                EL512
01291                                                                   EL512
01292      OPEN OUTPUT PENDING-OUT.                                     EL512
01293      MOVE +1                     TO WS-PENDING-STATUS-SW.         EL512
01294                                                                   EL512
01295      IF WS-TOT-RECORDS-RELEASED = ZERO                            EL512
01296          DISPLAY 'EL512  NO VALID BATCHES ON FILE'                EL512
01297          MOVE '-  ***** NO VALID BATCHES ON FILE *****' TO PRT    EL512
01298          PERFORM WRITE-A-LINE                                     EL512
01299          MOVE '-  ***** NO VALID BATCHES ON FILE *****' TO PRT    EL512
01300          PERFORM WRITE-A-LINE                                     EL512
01301          MOVE '-  ***** NO VALID BATCHES ON FILE *****' TO PRT    EL512
01302          PERFORM WRITE-A-LINE                                     EL512
01303          MOVE '-  ***** NO VALID BATCHES ON FILE *****' TO PRT    EL512
01304          PERFORM WRITE-A-LINE                                     EL512
01305          MOVE '-  ***** NO VALID BATCHES ON FILE *****' TO PRT    EL512
01306          PERFORM WRITE-A-LINE                                     EL512
01307          MOVE '-  ***** NO VALID BATCHES ON FILE *****' TO PRT    EL512
01308          PERFORM WRITE-A-LINE                                     EL512
01309          MOVE '-  ***** NO VALID BATCHES ON FILE *****' TO PRT    EL512
01310          PERFORM WRITE-A-LINE                                     EL512
01311          MOVE '-  ***** NO VALID BATCHES ON FILE *****' TO PRT    EL512
01312          PERFORM WRITE-A-LINE                                     EL512
01313          MOVE '-  ***** NO VALID BATCHES ON FILE *****' TO PRT    EL512
01314          PERFORM WRITE-A-LINE                                     EL512
01315          MOVE '-  ***** NO VALID BATCHES ON FILE *****' TO PRT    EL512
01316          PERFORM WRITE-A-LINE                                     EL512
01317          MOVE '-  ***** NO VALID BATCHES ON FILE *****' TO PRT    EL512
01318          PERFORM WRITE-A-LINE                                     EL512
01319          GO TO 2900-EXIT.                                         EL512
01320                                                                   EL512
01321      MOVE SPACE                  TO WS-PREVIOUS-ISSUE-TYPE.       EL512
01322                                                                   EL512
01323  2100-RETURN-SORTED-PENDING.                                      EL512
01324                                                                   EL512
01325      RETURN SORT-FILE                                             EL512
01326          AT END                                                   EL512
01327              MOVE +99            TO WS-FIRST-BATCH-SW             EL512
01328                                     WS-FIRST-ACCOUNT-SW           EL512
01329              GO TO 2900-PRINT-FINAL-TOTALS.                       EL512
01330                                                                   EL512
01331      MOVE SR-REST-OF-RECORD      TO PENDING-BUSINESS-IN.          EL512
01332                                                                   EL512
01333      IF WS-PREVIOUS-CANCEL-TYPE = '1'                             EL512
01334         IF NOT PBI-CANCEL                                         EL512
01335            PERFORM 3000-WRITE-PENDING-BUSINESS THRU 3000-EXIT     EL512
01336            IF NO-ERRORS-FOUND                                     EL512
01337               MOVE WS-BATCH-NO    TO P-BATCH-NO                   EL512
01338               MOVE WS-DETAIL1     TO PRT                          EL512
01339               PERFORM WRITE-A-LINE.                               EL512
01340                                                                   EL512
01341      IF PREVIOUS-ISSUE-FORM1                                      EL512
01342         IF PBI-SEQUENCE NOT = '2' AND '3' AND '4' AND '5'         EL512
01343                                   AND '6' AND '7' AND '8'
01344            PERFORM 3000-WRITE-PENDING-BUSINESS THRU 3000-EXIT     EL512
01345            IF NO-ERRORS-FOUND                                     EL512
01346                MOVE WS-BATCH-NO    TO P-BATCH-NO                  EL512
01347                MOVE WS-DETAIL1     TO PRT                         EL512
01348                PERFORM WRITE-A-LINE.                              EL512
01349                                                                   EL512
01350      IF PREVIOUS-ISSUE-FORM1                                      EL512
01351          IF (PBI-CERT-NO NOT = WS-SAVE-CERT-NO)                   EL512
01352             OR (PBI-CANCEL)                                       EL512
01353              PERFORM 3000-WRITE-PENDING-BUSINESS THRU 3000-EXIT   EL512
01354              IF NO-ERRORS-FOUND                                   EL512
01355                  MOVE WS-BATCH-NO    TO P-BATCH-NO                EL512
01356                  MOVE WS-DETAIL1     TO PRT                       EL512
01357                  PERFORM WRITE-A-LINE.                            EL512
01358                                                                   EL512
01359      MOVE +0                     TO  WS-ERROR-CNT.                EL512
01360                                                                   EL512
01361      IF PBI-REMITTANCE-TRANS                                      EL512
01362          IF SR-SEQ-NO = ZEROS                                     EL512
01363              PERFORM 4000-EDIT-REMITTANCE-TRANS THRU 4000-EXIT    EL512
01364              GO TO 2100-RETURN-SORTED-PENDING                     EL512
01365          ELSE                                                     EL512
01366              DISPLAY '*** EL512 BATCH RECORD OUT OF SEQUENCE'     EL512
01367              DISPLAY '*** EL512 BATCH RECORD OUT OF SEQUENCE'     EL512
01368              DISPLAY '*** EL512 BATCH RECORD OUT OF SEQUENCE'     EL512
01369              DISPLAY '*** EL512 BATCH RECORD OUT OF SEQUENCE'     EL512
01370              DISPLAY '*** EL512 BATCH RECORD OUT OF SEQUENCE'     EL512
01371              MOVE ZEROS          TO WS-ABEND-FILE-STATUS          EL512
01372              GO TO ABEND-PGM.                                     EL512
01373                                                                   EL512
01374      IF ((PBI-ISSUE) AND                                          EL512
01375          (PBI-SEQUENCE = '1' OR '2' OR '3' OR '4' OR              EL512
01376                          '5' OR '6' OR '7' OR '8'))
01377         OR                                                        EL512
01378         ((PBI-CANCEL) AND                                         EL512
01379          (PBI-SEQUENCE = '1' OR '2'))                             EL512
01380             NEXT SENTENCE                                         EL512
01381       ELSE                                                        EL512
01382          ADD +1                  TO WS-FT-INVL-TRAN-CNT           EL512
01383          MOVE SPACES             TO WS-DETAIL1                    EL512
01384          MOVE SR-BATCH-NO        TO P-BATCH-NO                    EL512
01385          MOVE SR-SEQ-NO          TO P-SEQ-NO                      EL512
01386          MOVE PBI-I-TRANS-TYPE   TO WS-TRAN-TYPE                  EL512
01387          MOVE WS-TRAN-ERROR      TO P-TYPE                        EL512
01388          MOVE PBI-CERT-NO        TO P-CERT-NO                     EL512
01389          MOVE ER-1031            TO P-ERROR-DESC                  EL512
01390          PERFORM ERROR-ROUTINE                                    EL512
01391          GO TO 2100-RETURN-SORTED-PENDING.                        EL512
01392                                                                   EL512
01393      IF PBI-ISSUE AND PBI-PROFILE                                 EL512
01394          PERFORM 4200-EDIT-PROFILE-TRANS THRU 4200-EXIT           EL512
01395          GO TO 2100-RETURN-SORTED-PENDING                         EL512
01396        ELSE                                                       EL512
01397          IF PBI-ISSUE                                             EL512
01398              PERFORM 4300-EDIT-OTHER-ISSUE-TRANS THRU 4399-EXIT   EL512
01399              GO TO 2100-RETURN-SORTED-PENDING.                    EL512
01400                                                                   EL512
01401      IF PBI-CANCEL AND                                            EL512
01402         PBI-C-SEQUENCE = '1'                                      EL512
01403         IF WS-PREVIOUS-CANCEL-TYPE = '1'                          EL512
01404             PERFORM 3000-WRITE-PENDING-BUSINESS THRU 3000-EXIT    EL512
01405             MOVE WS-BATCH-NO    TO P-BATCH-NO                     EL512
01406             MOVE WS-DETAIL1     TO PRT                            EL512
01407             PERFORM WRITE-A-LINE                                  EL512
01408             PERFORM 4400-EDIT-CANCEL-TRANS THRU 4400-EXIT         EL512
01409             GO TO 2100-RETURN-SORTED-PENDING                      EL512
01410         ELSE                                                      EL512
01411             PERFORM 4400-EDIT-CANCEL-TRANS THRU 4400-EXIT         EL512
01412             GO TO 2100-RETURN-SORTED-PENDING                      EL512
01413      ELSE                                                         EL512
01414         IF PBI-CANCEL AND                                         EL512
01415            PBI-C-SEQUENCE = '2'                                   EL512
01416            PERFORM 4500-EDIT-OTHER-CANCEL THRU 4500-EXIT          EL512
01417            GO TO 2100-RETURN-SORTED-PENDING.                      EL512
01418                                                                   EL512
01419      IF NO-ERRORS-FOUND                                           EL512
01420          MOVE WS-BATCH-NO    TO P-BATCH-NO                        EL512
01421          MOVE WS-DETAIL1     TO PRT                               EL512
01422          PERFORM WRITE-A-LINE.                                    EL512
01423                                                                   EL512
01424      GO TO 2100-RETURN-SORTED-PENDING.                            EL512
01425                                                                   EL512
01426  2900-PRINT-FINAL-TOTALS.                                         EL512
01427      IF PREVIOUS-ISSUE-FORM1  OR                                  EL512
01428         WS-PREVIOUS-CANCEL-TYPE = '1'                             EL512
01429          PERFORM 3000-WRITE-PENDING-BUSINESS THRU 3000-EXIT       EL512
01430          IF NO-ERRORS-FOUND                                       EL512
01431              MOVE WS-BATCH-NO    TO P-BATCH-NO                    EL512
01432              MOVE WS-DETAIL1     TO PRT                           EL512
01433              PERFORM WRITE-A-LINE.                                EL512
01434                                                                   EL512
01435      PERFORM 6000-BATCH-TOTALS.                                   EL512
01436      PERFORM 6100-ACCOUNT-TOTALS.                                 EL512
01437      PERFORM 6400-FINAL-TOTALS.                                   EL512
01438                                                                   EL512
01439  2900-EXIT.                                                       EL512
01440      EXIT.                                                        EL512
01441      EJECT                                                        EL512
01442                                                                   EL512
01443  3000-WRITE-PENDING-BUSINESS SECTION.                             EL512
01444      IF VALID-BATCH  AND                                          EL512
01445         NO-SEVERE-ERRORS                                          EL512
01446          MOVE +1 TO WS-COMPLETE-BATCH-SW                          EL512
01447      ELSE                                                         EL512
01448          GO TO 3000-SKIP-WRITE.                                   EL512
01449                                                                   EL512
01450      IF PB-ISSUE                                                  EL512
01451          IF PB-I-MAIL-ADDRS-PRESENT                                  CL**3
01452              IF WS-M-INSURED-ADDRESS-1  > SPACES   OR                CL**3
01453                 WS-M-INSURED-ADDRESS-2  > SPACES   OR                CL**3
01454                 WS-M-INSURED-CITY-STATE > SPACES   OR
                      WS-M-CRED-BENE-NAME     > SPACES
01455                  MOVE PENDING-BUSINESS                            EL512
01456                                 TO WS-SAVE-PENDING-RECORD         EL512
01457                  PERFORM 3500-WRITE-PENDING-MAIL THRU 3500-EXIT   EL512
01458                  MOVE WS-SAVE-PENDING-RECORD                      EL512
01459                                 TO PENDING-BUSINESS.              EL512
01460                                                                   EL512
01461      WRITE PENDING-BUSINESS.                                      EL512
01462                                                                   EL512
01463  3000-SKIP-WRITE.                                                 EL512
01464                                                                   EL512
01465      MOVE SPACES                 TO  WS-PREVIOUS-ISSUE-TYPE       EL512
01466                                      WS-PREVIOUS-CANCEL-TYPE      EL512
01467                                      WS-SAVE-CERT-NO              EL512
01468                                      WS-MAILING-DATA.             EL512
01469                                                                   EL512
01470  3000-EXIT.                                                       EL512
01471      EXIT.                                                        EL512
01472                                                                      CL**3
01473      EJECT                                                        EL512
01474  3500-WRITE-PENDING-MAIL SECTION.                                 EL512
01475       MOVE PB-I-AGE              TO WS-M-INSURED-AGE.             EL512
01476       MOVE PB-I-INSURED-SEX      TO WS-M-INSURED-SEX.             EL512
01477                                                                   EL512
01478       IF WS-M-INSURED-SOC-SEC-NO = SPACES                         EL512
01479           MOVE PB-I-SOC-SEC-NO   TO WS-M-INSURED-SOC-SEC-NO.      EL512
01480       IF WS-M-INSURED-BIRTHDAY = LOW-VALUES  OR  SPACES           EL512
01481           MOVE PB-I-BIRTHDAY     TO WS-M-INSURED-BIRTHDAY.        EL512
01482                                                                   EL512
01483      MOVE '0'                    TO PB-RECORD-TYPE.               EL512
01484      MOVE SPACES                 TO PB-MAIL-RECORD.               EL512
01485                                                                   EL512
01486      MOVE WS-M-INSURED-LAST-NAME  TO PB-M-INSURED-LAST-NAME.      EL512
01487      MOVE WS-M-INSURED-FIRST-NAME TO PB-M-INSURED-FIRST-NAME.     EL512
01488      MOVE WS-M-INSURED-MID-INIT   TO PB-M-INSURED-MID-INIT.       EL512
01489                                                                   EL512
01490      MOVE WS-M-INSURED-AGE        TO PB-M-INSURED-AGE.            EL512
01491      MOVE WS-M-INSURED-BIRTHDAY   TO PB-M-INSURED-BIRTHDAY.       EL512
01492      MOVE WS-M-INSURED-SEX        TO PB-M-INSURED-SEX.            EL512
01493      MOVE WS-M-INSURED-SOC-SEC-NO TO PB-M-INSURED-SOC-SEC-NO.     EL512
01494                                                                   EL512
01495      MOVE WS-M-INSURED-ADDRESS-1  TO PB-M-INSURED-ADDRESS-1.      EL512
01496      MOVE WS-M-INSURED-ADDRESS-2  TO PB-M-INSURED-ADDRESS-2.      EL512
051810*    MOVE WS-M-INSURED-CITY-STATE TO PB-M-INSURED-CITY-STATE.     EL512
051810     MOVE WS-M-INSURED-CITY      TO PB-M-INSURED-CITY
051810     MOVE WS-M-INSURED-STATE     TO PB-M-INSURED-STATE
01498      MOVE WS-M-INSURED-ZIP-CODE   TO PB-M-INSURED-ZIP-CODE.       EL512
01499                                                                   EL512
01500      MOVE WS-M-INSURED-PHONE-NO   TO PB-M-INSURED-PHONE-NO
           MOVE WS-M-CRED-BENE-NAME     TO PB-M-CRED-BENE-NAME
           MOVE WS-M-CRED-BENE-ADDR1    TO PB-M-CRED-BENE-ADDR1
01501                                                                   EL512
01502      WRITE PENDING-BUSINESS.                                      EL512
01503                                                                   EL512
01504  3500-EXIT.                                                       EL512
01505      EXIT.                                                        EL512
01506                                                                   EL512
01507      EJECT                                                        EL512
01508  3600-CHANGE-ACCOUNT-NO.                                          EL512
01509      MOVE +0                     TO  SUB1.                        EL512
01510      MOVE PBI-CARRIER            TO  JHL-TEST-CARR.               EL512
01511      MOVE PBI-GROUPING           TO  JHL-TEST-GROUP.              EL512
01512      MOVE PBI-STATE              TO  JHL-TEST-ST.                 EL512
01513      MOVE PBI-ACCOUNT            TO  JHL-TEST-ACCT.               EL512
01514                                                                   EL512
01515  3610-ACCOUNT-LOOP.                                               EL512
01516      ADD +1                      TO  SUB1.                        EL512
01517                                                                   EL512
01518      IF JHL-ACT-CNTRL1 (SUB1) = HIGH-VALUES                       EL512
01519          GO TO 3699-EXIT.                                         EL512
01520                                                                   EL512
01521      IF JHL-TEST-CONTROL = JHL-ACT-CNTRL1 (SUB1)                  EL512
01522          MOVE JHL-ACT-CARR2  (SUB1)  TO  PBI-CARRIER              EL512
01523          MOVE JHL-ACT-GROUP2 (SUB1)  TO  PBI-GROUPING             EL512
01524          MOVE JHL-ACT-ST2    (SUB1)  TO  PBI-STATE                EL512
01525          MOVE JHL-ACT-ACCT2  (SUB1)  TO  PBI-ACCOUNT              EL512
01526          GO TO 3699-EXIT.                                         EL512
01527                                                                   EL512
01528      GO TO 3610-ACCOUNT-LOOP.                                     EL512
01529                                                                   EL512
01530  3699-EXIT.                                                       EL512
01531      EXIT.                                                        EL512
01532                                                                   EL512
01533      EJECT                                                        EL512
01534  3700-CHANGE-CARRIER.                                             EL512
01535      IF PBI-CARRIER EQUAL '1'                                     EL512
01536          NEXT SENTENCE                                            EL512
01537      ELSE                                                         EL512
01538          GO TO 3799-EXIT.                                         EL512
01539                                                                   EL512
01540      MOVE 'G'                    TO  PBI-CARRIER.                 EL512
01541      MOVE PBI-ACCOUNT            TO  WS-ACCOUNT-FILL.             EL512
01542      MOVE '0'                    TO  WS-FIRST-PLACE.              EL512
01543      MOVE WS-ACCOUNT-FILL        TO  PBI-ACCOUNT.                 EL512
01544                                                                   EL512
01545  3799-EXIT.                                                       EL512
01546      EXIT.                                                        EL512
01547                                                                   EL512
01548      EJECT                                                        EL512
01549  4000-EDIT-REMITTANCE-TRANS SECTION.                              EL512
01550      ADD +1                      TO  WS-FT-REMIT-CNT.             EL512
01551                                                                   EL512
01552      MOVE SPACES                 TO  WS-DETAIL1                   EL512
01553      MOVE SR-BATCH-NO            TO  P-BATCH-NO                   EL512
01554                                      WS-BATCH-NO.                 EL512
01555      MOVE SR-SEQ-NO              TO  P-SEQ-NO                     EL512
01556      MOVE 'REMIT'                TO  P-TYPE                       EL512
01557      MOVE SPACES                 TO  P-CERT-NO.                   EL512
01558                                                                   EL512
01559      IF PBI-B-LF-PRM-WRITTEN NOT NUMERIC                          EL512
01560          MOVE ZEROS              TO PBI-B-LF-PRM-WRITTEN          EL512
01561                                     P-LF-PREMIUM                  EL512
01562          MOVE ER-1000            TO P-ERROR-DESC                  EL512
01563          PERFORM ERROR-ROUTINE.                                   EL512
01564                                                                   EL512
01565      IF PBI-B-LF-PRM-CANCELLED NOT NUMERIC                        EL512
01566          MOVE ZEROS              TO PBI-B-LF-PRM-CANCELLED        EL512
01567                                     P-LF-REFUND                   EL512
01568          MOVE ER-1001            TO P-ERROR-DESC                  EL512
01569          PERFORM ERROR-ROUTINE.                                   EL512
01570                                                                   EL512
01571      IF PBI-B-AH-PRM-WRITTEN NOT NUMERIC                          EL512
01572          MOVE ZEROS              TO PBI-B-AH-PRM-WRITTEN          EL512
01573                                     P-AH-PREMIUM                  EL512
01574          MOVE ER-1002            TO P-ERROR-DESC                  EL512
01575          PERFORM ERROR-ROUTINE.                                   EL512
01576                                                                   EL512
01577      IF PBI-B-AH-PRM-CANCELLED NOT NUMERIC                        EL512
01578          MOVE ZEROS              TO PBI-B-AH-PRM-CANCELLED        EL512
01579                                     P-AH-REFUND                   EL512
01580          MOVE ER-1003            TO P-ERROR-DESC                  EL512
01581          PERFORM ERROR-ROUTINE.                                   EL512
01582                                                                   EL512
01583      IF PBI-B-CERT-ISS-COUNT NOT NUMERIC                          EL512
01584          MOVE ZEROS              TO PBI-B-CERT-ISS-COUNT          EL512
01585          MOVE ER-1004            TO P-ERROR-DESC                  EL512
01586          PERFORM ERROR-ROUTINE.                                   EL512
01587                                                                   EL512
01588      IF PBI-B-CERT-CAN-COUNT NOT NUMERIC                          EL512
01589          MOVE ZEROS              TO PBI-B-CERT-CAN-COUNT          EL512
01590          MOVE ER-1005            TO P-ERROR-DESC                  EL512
01591          PERFORM ERROR-ROUTINE.                                   EL512
01592                                                                   EL512
01593      IF DTE-CLIENT = 'NCB'                                        EL512
01594          IF PBI-B-BATCH-MO NOT NUMERIC OR                         EL512
01595             PBI-B-BATCH-DA NOT NUMERIC OR                         EL512
01596             PBI-B-BATCH-YR NOT NUMERIC                            EL512
01597              MOVE ZEROS          TO  PBI-B-BATCH-DT               EL512
01598              MOVE ER-1006        TO  P-ERROR-DESC                 EL512
01599              PERFORM ERROR-ROUTINE.                               EL512
01600                                                                   EL512
01601      IF CURRENT-ACCOUNT-INVALID                                   EL512
01602          MOVE HIGH-VALUES        TO  WS-INVALID-ACCOUNT-SW.       EL512
01603                                                                   EL512
01604      PERFORM 6000-BATCH-TOTALS   THRU 6000-EXIT.                  EL512
01605                                                                   EL512
01606      IF NO-SEVERE-ERRORS                                          EL512
01607          PERFORM 5000-BUILD-REMIT-RECORD THRU 5000-EXIT           EL512
01608          MOVE PENDING-BUSINESS   TO  WS-SAVE-BATCH-RECORD         EL512
01609          MOVE +0                 TO  WS-VALID-BATCH-SW            EL512
01610      ELSE                                                         EL512
01611          MOVE +1                 TO  WS-VALID-BATCH-SW.           EL512
01612                                                                   EL512
01613      MOVE +0                     TO  WS-COMPLETE-BATCH-SW.        EL512
01614                                                                   EL512
01615  4000-EXIT.                                                       EL512
01616      EXIT.                                                        EL512
01617                                                                   EL512
01618      EJECT                                                        EL512
01619  4200-EDIT-PROFILE-TRANS SECTION.                                 EL512
01620      MOVE SPACES                 TO  WS-DETAIL1.                  EL512
01621      MOVE SR-BATCH-NO            TO  P-BATCH-NO                   EL512
01622                                      WS-BATCH-NO.                 EL512
01623      MOVE SR-SEQ-NO              TO  P-SEQ-NO.                    EL512
01624      MOVE PBI-CERT-NO            TO  P-CERT-NO                    EL512
01625                                      WS-SAVE-CERT-NO.             EL512
01626      MOVE 'ISSUE '               TO  P-TYPE.                      EL512
01627                                                                   EL512
01628 ******************************************************************EL512
01629 *      INSURED PROFILE DATA - SEQ 1 RECORD                       *EL512
01630 ******************************************************************EL512
01631                                                                   EL512
01632      IF PBI-CERT-EFF-MO NOT NUMERIC OR                               CL**8
01633         PBI-CERT-EFF-DA NOT NUMERIC OR                               CL**9
01634         PBI-CERT-EFF-YR NOT NUMERIC                                  CL**9
01635          MOVE WS-SAVE-DATE       TO WS-SAVE-BIN-DATE              EL512
01636          ADD +1                  TO WS-FT-INVL-CERT-ISS-CNT       EL512
01637          MOVE +92                TO WS-ERROR-CNT                  EL512
01638          MOVE ER-1007            TO P-ERROR-DESC                  EL512
01639          PERFORM ERROR-ROUTINE                                    EL512
01640          MOVE ER-1036            TO P-ERROR-DESC                  EL512
01641          PERFORM ERROR-ROUTINE                                    EL512
01642      ELSE                                                         EL512
01643          MOVE PBI-CERT-EFF-YR    TO DC-MDY-YEAR                   EL512
01644          MOVE PBI-CERT-EFF-MO    TO DC-MDY-MONTH                  EL512
01645          MOVE PBI-CERT-EFF-DA    TO DC-MDY-DAY                    EL512
01646          MOVE '4'                TO DC-OPTION-CODE                EL512
01647          PERFORM 8500-DATE-CONVERSION                             EL512
01648          IF NO-CONVERSION-ERROR                                   EL512
01649              MOVE DC-BIN-DATE-1  TO WS-SAVE-BIN-DATE              EL512
01650          ELSE                                                     EL512
01651              MOVE WS-SAVE-DATE   TO WS-SAVE-BIN-DATE              EL512
01652              ADD +1              TO WS-FT-INVL-CERT-ISS-CNT       EL512
01653              MOVE +92            TO WS-ERROR-CNT                  EL512
01654              MOVE ER-1007        TO P-ERROR-DESC                  EL512
01655              PERFORM ERROR-ROUTINE                                EL512
01656              MOVE ER-1036        TO P-ERROR-DESC                  EL512
01657              PERFORM ERROR-ROUTINE.                               EL512
01658                                                                   EL512
01659      MOVE 'I'                    TO  WS-PREVIOUS-ISSUE-TYPE.      EL512
01660                                                                   EL512
01661      IF CURRENT-ACCOUNT-INVALID                                   EL512
01662          ADD +1                  TO  WS-FT-INVL-ISS-CNT           EL512
01663                                      WS-BT-ENTR-ISS-CNT           EL512
01664                                      WS-AT-ENTR-ISS-CNT           EL512
01665      ELSE                                                         EL512
01666          ADD +1                  TO  WS-BT-ENTR-ISS-CNT           EL512
01667                                      WS-AT-ENTR-ISS-CNT           EL512
01668                                      WS-FT-ISS-CNT.               EL512
01669                                                                   EL512
01670      PERFORM 5100-BUILD-ISSUE-RECORD THRU 5100-EXIT.              EL512
01671                                                                   EL512
01672      IF PBI-I-ENTRY-CD = 'R'                                      EL512
01673          MOVE 'R'                TO PB-BATCH-ENTRY.               EL512
01674      IF PBI-I-ENTRY-CD = 'E'                                      EL512
01675          MOVE 'E'                TO PB-BATCH-ENTRY.               EL512
01676      IF PBI-I-ENTRY-CD = 'P'                                      EL512
01677          MOVE 'P'                TO PB-BATCH-ENTRY.               EL512
01678      IF PBI-I-ENTRY-CD = 'V'                                      EL512
01679          MOVE 'V'                TO PB-BATCH-ENTRY.               EL512
01680      IF PBI-I-ENTRY-CD = 'U'                                      EL512
01681          MOVE 'U'                TO PB-BATCH-ENTRY.               EL512
01682      IF PBI-I-ENTRY-CD = 'D'                                      EL512
01683          MOVE 'D'                TO PB-BATCH-ENTRY.               EL512
01684                                                                   EL512
01685      IF PBI-I-FORCE-CD = 'A'                                      EL512
01686          MOVE 'A'                TO PB-FORCE-CODE.                EL512
01687      IF PBI-I-FORCE-CD = 'D'                                      EL512
01688          MOVE 'D'                TO PB-FORCE-CODE.                EL512
01689      IF PBI-I-FORCE-CD = 'H'                                      EL512
01690          MOVE 'H'                TO PB-RECORD-BILL.               EL512
01691                                                                   EL512
01692      MOVE PBI-I-INS-LAST-NAME    TO PB-I-INSURED-LAST-NAME.       EL512
01693      MOVE PBI-I-INS-1ST-NAME     TO PB-I-INSURED-FIRST-NAME.      EL512
01694      MOVE PBI-I-INS-MIDDLE-INIT  TO PB-I-INSURED-MIDDLE-INIT.     EL512
01695      MOVE PBI-I-INSURED-SEX      TO PB-I-INSURED-SEX.             EL512
01696      MOVE PBI-I-SOC-SEC-NO       TO PB-I-SOC-SEC-NO.              EL512
01697      MOVE PBI-I-MEMBER-NO        TO PB-I-MEMBER-NO.               EL512
01698                                                                   EL512
01699      IF DTE-CLIENT = 'FLI'                                        EL512
01700        IF PBI-I-FORCE-CD = 'R'                                    EL512
01701          MOVE '1'                TO PB-I-SPECIAL-REIN-CODE.       EL512
01702                                                                   EL512
01703      IF PBI-I-INSURED-AGE NOT NUMERIC                             EL512
01704          MOVE ZEROS              TO PB-I-AGE                      EL512
01705          MOVE ER-1013            TO P-ERROR-DESC                  EL512
01706          PERFORM ERROR-ROUTINE                                    EL512
01707      ELSE                                                         EL512
01708          MOVE PBI-I-INSURED-AGE  TO PB-I-AGE.                     EL512
01709                                                                   EL512
01710      MOVE PBI-I-BIRTHDAY     TO DC-GREG-DATE-1-MDY.               EL512
01711      MOVE '4'                TO DC-OPTION-CODE.                   EL512
01712      PERFORM 8500-DATE-CONVERSION.                                EL512
01713      IF NOT NO-CONVERSION-ERROR                                   EL512
01714         MOVE LOW-VALUES     TO DC-BIN-DATE-1                      EL512
01715      ELSE                                                         EL512
01716         MOVE DC-GREG-DATE-1-MDY  TO WS-SAVE-BIRTH-DATE(3:6)       EL512
01717         MOVE DC-ALPHA-CENTURY    TO WS-SAVE-BIRTH-CC              EL512
01718         IF (DC-BIN-DATE-1 GREATER THAN WS-SAVE-DATE               EL512
01719            AND WS-SAVE-BIRTH-CCYY LESS THAN WS-CURRENT-CCYY)      EL512
01720            MOVE DC-BIN-DATE-1    TO WS-WORK-BIN-DT                EL512
01721            SUBTRACT CENTURY-ADJ FROM WS-WORK-BIN-RED              EL512
01722            MOVE WS-WORK-BIN-DT   TO DC-BIN-DATE-1                    CL**7
01723            MOVE DC-BIN-DATE-1    TO PB-I-BIRTHDAY                 EL512
01724            DISPLAY 'PB-CERT-NO = ' PB-CERT-NO                     EL512
01725         ELSE                                                      EL512
01726            MOVE DC-BIN-DATE-1    TO PB-I-BIRTHDAY.                EL512
01727                                                                   EL512
01728      IF MAIL-PROCESSING                                           EL512
01729          MOVE '1'                  TO PB-I-MAIL-ADDRS-SW.         EL512
01730                                                                   EL512
01731      MOVE PBI-I-INS-LAST-NAME      TO WS-M-INSURED-LAST-NAME.     EL512
01732      MOVE PBI-I-INS-1ST-NAME       TO WS-M-INSURED-FIRST-NAME.    EL512
01733      MOVE PBI-I-INS-MIDDLE-INIT    TO WS-M-INSURED-MID-INIT.      EL512
01734                                                                   EL512
01735      MOVE 'ISSUE'                  TO  P-TYPE.                    EL512
01736                                                                   EL512
01737  4200-EXIT.                                                       EL512
01738       EXIT.                                                       EL512
01739                                                                   EL512
01740      EJECT                                                        EL512
01741  4300-EDIT-OTHER-ISSUE-TRANS SECTION.                             EL512
01742      ADD +1                      TO WS-FT-LTYPE-ISS-CNT.          EL512
01743                                                                   EL512
01744      MOVE SR-BATCH-NO            TO  P-BATCH-NO                   EL512
01745                                      WS-BATCH-NO.                 EL512
01746      MOVE SR-SEQ-NO              TO  P-SEQ-NO.                    EL512
01747      MOVE PBI-CERT-NO            TO  P-CERT-NO.                   EL512
01748      MOVE 'TRAN=2'               TO  P-TYPE.                      EL512
01749                                                                   EL512
01750      IF NOT SR-VALID-ISSUE-STATUS                                 EL512
01751          ADD +1                  TO  WS-FT-INVL-LTYPE-ISS-CNT     EL512
01752          MOVE +92                TO  WS-ERROR-CNT                 EL512
01753          MOVE ER-1032            TO  P-ERROR-DESC                 EL512
01754          MOVE SPACE              TO  WS-PREVIOUS-ISSUE-TYPE       EL512
01755          PERFORM ERROR-ROUTINE                                    EL512
01756          GO TO 4399-EXIT.                                         EL512
01757                                                                   EL512
01758      IF NOT PREVIOUS-ISSUE-FORM1                                  EL512
01759          ADD +1                  TO  WS-FT-INVL-LTYPE-ISS-CNT     EL512
01760          MOVE +93                TO  WS-ERROR-CNT                 EL512
01761          MOVE ER-1033            TO  P-ERROR-DESC                 EL512
01762          MOVE SPACE              TO  WS-PREVIOUS-ISSUE-TYPE       EL512
01763          PERFORM ERROR-ROUTINE                                    EL512
01764          GO TO 4399-EXIT.                                         EL512
01765                                                                   EL512
01766      IF PBI-LIFE                                                  EL512
01767          MOVE 'TRAN=3'               TO  P-TYPE                   EL512
01768          GO TO 4310-EDIT-FORM3-ISSUE-TRANS.                       EL512
01769                                                                   EL512
01770      IF PBI-AH                                                    EL512
01771          MOVE 'TRAN=4'               TO  P-TYPE                   EL512
01772          GO TO 4320-EDIT-FORM4-ISSUE-TRANS.                       EL512
01773                                                                   EL512
01774      IF PBI-LOAN-INFO                                             EL512
01775          MOVE 'TRAN=5'               TO  P-TYPE                   EL512
01776          GO TO 4330-EDIT-FORM5-ISSUE-TRANS.                       EL512
01777                                                                   EL512
01778      IF PBI-ADDR-1                                                EL512
01779          MOVE 'TRAN=6'               TO  P-TYPE                   EL512
01780          GO TO 4340-EDIT-FORM6-ISSUE-TRANS.                       EL512
01781                                                                   EL512
01782      IF PBI-ADDR-2                                                EL512
01783          MOVE 'TRAN=7'               TO  P-TYPE                   EL512
01784          GO TO 4350-EDIT-FORM7-ISSUE-TRANS.                       EL512
01785                                                                   EL512
01782      IF PBI-CRED-BENE1
01783         MOVE 'TRAN=8'            TO P-TYPE
01784         GO TO 4360-EDIT-FORM8-ISSUE-TRANS
           END-IF
01785                                                                   EL512
01786 ******************************************************************EL512
01787 *      JOINT PROFILE DATA - SEQ 2 RECORD                         *EL512
01788 ******************************************************************EL512
01789                                                                   EL512
01790      MOVE PBI-I-JNT-LAST-NAME    TO PB-I-JOINT-LAST-NAME.         EL512
01791      MOVE PBI-I-JNT-1ST-NAME     TO PB-I-JOINT-FIRST-NAME.        EL512
01792      MOVE PBI-I-JNT-MIDDLE-INIT  TO PB-I-JOINT-MIDDLE-INIT.       EL512
01793                                                                   EL512
01794      IF PBI-I-JOINT-AGE NOT NUMERIC                               EL512
01795          MOVE ZEROS              TO PB-I-AGE                      EL512
01796          MOVE ER-1019            TO P-ERROR-DESC                  EL512
01797          PERFORM ERROR-ROUTINE                                    EL512
01798      ELSE                                                         EL512
01799          MOVE PBI-I-JOINT-AGE    TO PB-I-JOINT-AGE.               EL512

040414     MOVE PBI-I-JNT-BIRTHDAY     TO DC-GREG-DATE-1-MDY
040414     MOVE '4'                    TO DC-OPTION-CODE
040414     PERFORM 8500-DATE-CONVERSION
040414     IF NOT NO-CONVERSION-ERROR
040414        MOVE LOW-VALUES          TO DC-BIN-DATE-1
040414     ELSE
040414        MOVE DC-GREG-DATE-1-MDY  TO WS-SAVE-BIRTH-DATE(3:6)       EL512
040414        MOVE DC-ALPHA-CENTURY    TO WS-SAVE-BIRTH-CC              EL512
040414        IF (DC-BIN-DATE-1 > WS-SAVE-DATE
040414           AND WS-SAVE-BIRTH-CCYY < WS-CURRENT-CCYY)
040414           MOVE DC-BIN-DATE-1    TO WS-WORK-BIN-DT                EL512
040414           SUBTRACT CENTURY-ADJ FROM WS-WORK-BIN-RED              EL512
040414           MOVE WS-WORK-BIN-DT   TO DC-BIN-DATE-1                    CL**7
040414           MOVE DC-BIN-DATE-1    TO PB-I-joint-BIRTHDAY
040414           DISPLAY 'PB-CERT-NO = ' PB-CERT-NO                     EL512
040414        ELSE                                                      EL512
040414           MOVE DC-BIN-DATE-1    TO PB-I-joint-BIRTHDAY
040414        end-if
040414     end-if
01800                                                                   EL512
01801      MOVE PBI-I-POLICY-FORM-NO   TO PB-I-POLICY-FORM-NO.          EL512
01802                                                                   EL512
01803      GO TO 4390-EDIT-FORMS-CONTINUED.                             EL512
01804                                                                   EL512
01805  4310-EDIT-FORM3-ISSUE-TRANS.                                     EL512
01806 ******************************************************************EL512
01807 *      LIFE BENEFIT DATA  - SEQ 3 RECORD                         *EL512
01808 ******************************************************************EL512
01809                                                                   EL512
01810      IF PBI-I-LF-PREM-AMT NOT NUMERIC                             EL512
01811          MOVE ZEROS              TO PB-I-LF-PREMIUM-AMT           EL512
01812                                     P-LF-PREMIUM                  EL512
01813          MOVE ER-1009            TO P-ERROR-DESC                  EL512
01814          PERFORM ERROR-ROUTINE                                    EL512
01815      ELSE                                                         EL512
01816          IF PBI-I-LF-PREM-AMT-X = WS-ALL-NINES                    EL512
01817              MOVE '?'            TO PB-I-LF-CALC-FLAG             EL512
01818              MOVE ZEROS          TO P-LF-PREMIUM                  EL512
01819                                     PB-I-LF-PREMIUM-AMT           EL512
01820          ELSE                                                     EL512
01821              MOVE PBI-I-LF-PREM-AMT  TO P-LF-PREMIUM              EL512
01822                                         PB-I-LF-PREMIUM-AMT       EL512
01823              ADD  PBI-I-LF-PREM-AMT  TO WS-BT-ENTR-LF-PREMIUM     EL512
01824                                         WS-AT-ENTR-LF-PREMIUM.    EL512
01825                                                                   EL512
01826      IF PBI-I-LF-ALT-PREM-AMT NOT NUMERIC                         EL512
01827          MOVE ZEROS                  TO PB-I-LF-ALT-PREMIUM-AMT   EL512
01828          MOVE ER-1009                TO P-ERROR-DESC              EL512
01829          PERFORM ERROR-ROUTINE                                    EL512
01830      ELSE                                                         EL512
01831          MOVE PBI-I-LF-ALT-PREM-AMT  TO PB-I-LF-ALT-PREMIUM-AMT   EL512
01832          ADD  PBI-I-LF-ALT-PREM-AMT  TO WS-BT-ENTR-LF-PREMIUM     EL512
01833                                         WS-AT-ENTR-LF-PREMIUM     EL512
01834          ADD PBI-I-LF-PREM-AMT PBI-I-LF-ALT-PREM-AMT              EL512
01835                                       GIVING P-LF-PREMIUM.        EL512
01836                                                                   EL512
01837      IF PBI-I-LF-BENEFIT-AMT NOT NUMERIC                          EL512
01838          MOVE ZEROS              TO PB-I-LF-BENEFIT-AMT           EL512
01839          MOVE ER-1011            TO P-ERROR-DESC                  EL512
01840          PERFORM ERROR-ROUTINE                                    EL512
01841      ELSE                                                         EL512
01842          MOVE PBI-I-LF-BENEFIT-AMT                                EL512
01843                                  TO PB-I-LF-BENEFIT-AMT.          EL512
01844                                                                   EL512
01845      IF PBI-I-LF-ALT-BENEFIT-AMT NOT NUMERIC                      EL512
01846          MOVE ZEROS              TO PB-I-LF-ALT-BENEFIT-AMT       EL512
01847          MOVE ER-1011            TO P-ERROR-DESC                  EL512
01848          PERFORM ERROR-ROUTINE                                    EL512
01849      ELSE                                                         EL512
01850          MOVE PBI-I-LF-ALT-BENEFIT-AMT                            EL512
01851                                  TO PB-I-LF-ALT-BENEFIT-AMT.      EL512
01852                                                                   EL512
01853      IF PBI-I-LF-TERM NOT NUMERIC                                 EL512
01854          MOVE ZEROS              TO PB-I-LF-TERM                  EL512
01855          MOVE ER-1008            TO P-ERROR-DESC                  EL512
01856          PERFORM ERROR-ROUTINE                                    EL512
01857      ELSE                                                         EL512
01858          MOVE PBI-I-LF-TERM      TO PB-I-LF-TERM.                 EL512
01859                                                                   EL512
01860      IF PBI-I-LF-BENEFIT-TYPE = ZEROS OR SPACES                   EL512
01861          MOVE ZEROS                 TO PB-I-LF-INPUT-CD           EL512
01862      ELSE                                                         EL512
01863          MOVE PBI-I-LF-BENEFIT-TYPE TO PB-I-LF-INPUT-CD.          EL512
01864                                                                   EL512
01865      MOVE PBI-I-LF-EXPIRE-DT       TO DC-GREG-DATE-1-MDY.         EL512
01866      MOVE '4'                      TO DC-OPTION-CODE.             EL512
01867      PERFORM 8500-DATE-CONVERSION                                 EL512
01868      IF NO-CONVERSION-ERROR                                       EL512
01869          MOVE DC-BIN-DATE-1        TO PB-I-LF-EXPIRE-DT.          EL512
01870                                                                   EL512
01871      IF PBI-I-LF-CRIT-PERIOD NOT NUMERIC                          EL512
01872          MOVE ZERO                 TO PBI-I-LF-CRIT-PERIOD.       EL512
01873                                                                   EL512
01874      MOVE PBI-I-LF-CRIT-PERIOD     TO PB-I-LF-CRIT-PER.           EL512
01875                                                                   EL512
01876      IF PBI-I-TERM-AS-DAYS NOT NUMERIC                            EL512
01877          MOVE ZERO                 TO PBI-I-TERM-AS-DAYS.         EL512
01878                                                                   EL512
01879      MOVE PBI-I-TERM-AS-DAYS       TO PB-I-TERM-IN-DAYS.          EL512
01880                                                                   EL512
01881      GO TO 4390-EDIT-FORMS-CONTINUED.                             EL512
01882                                                                   EL512
01883  4320-EDIT-FORM4-ISSUE-TRANS.                                     EL512
01884 ******************************************************************EL512
01885 *       A/H BENEFIT DATA  - SEQ 4 RECORD                         *EL512
01886 ******************************************************************EL512
01887                                                                   EL512
01888      IF PBI-I-AH-PREM-AMT NOT NUMERIC                             EL512
01889          MOVE ZEROS              TO PB-I-AH-PREMIUM-AMT           EL512
01890                                     P-AH-PREMIUM                  EL512
01891          MOVE ER-1010            TO P-ERROR-DESC                  EL512
01892          PERFORM ERROR-ROUTINE                                    EL512
01893      ELSE                                                         EL512
01894          IF PBI-I-AH-PREM-AMT-X = WS-ALL-NINES                    EL512
01895              MOVE '?'            TO PB-I-AH-CALC-FLAG             EL512
01896              MOVE ZEROS          TO P-AH-PREMIUM                  EL512
01897                                     PB-I-AH-PREMIUM-AMT           EL512
01898          ELSE                                                     EL512
01899              MOVE PBI-I-AH-PREM-AMT  TO P-AH-PREMIUM              EL512
01900                                         PB-I-AH-PREMIUM-AMT       EL512
01901              ADD  PBI-I-AH-PREM-AMT  TO WS-BT-ENTR-AH-PREMIUM     EL512
01902                                         WS-AT-ENTR-AH-PREMIUM.    EL512
01903                                                                   EL512
01904      IF PBI-I-AH-BENEFIT-AMT NOT NUMERIC                          EL512
01905          MOVE ZEROS              TO PB-I-AH-BENEFIT-AMT           EL512
01906          MOVE ER-1012            TO P-ERROR-DESC                  EL512
01907          PERFORM ERROR-ROUTINE                                    EL512
01908      ELSE                                                         EL512
01909          MOVE PBI-I-AH-BENEFIT-AMT                                EL512
01910                                  TO PB-I-AH-BENEFIT-AMT.          EL512
01911                                                                   EL512
01912      IF PBI-I-AH-TERM NOT NUMERIC                                 EL512
01913          MOVE ZEROS              TO PB-I-AH-TERM                  EL512
01914          MOVE ER-1008            TO P-ERROR-DESC                  EL512
01915          PERFORM ERROR-ROUTINE                                    EL512
01916      ELSE                                                         EL512
01917          MOVE PBI-I-AH-TERM      TO PB-I-AH-TERM.                 EL512
01918                                                                   EL512
01919      IF PBI-I-AH-PAYMENT NOT NUMERIC                              EL512
01920          MOVE ZEROS              TO PB-I-PAYMENT-AMOUNT           EL512
01921          MOVE ER-1035            TO P-ERROR-DESC                  EL512
01922          PERFORM ERROR-ROUTINE                                    EL512
01923      ELSE                                                         EL512
01924          MOVE PBI-I-AH-PAYMENT   TO PB-I-PAYMENT-AMOUNT.          EL512
01925                                                                   EL512
01926      IF PBI-I-AH-BENEFIT-TYPE = ZEROS OR SPACES                   EL512
01927          MOVE ZEROS                  TO PB-I-AH-INPUT-CD          EL512
01928      ELSE                                                         EL512
01929          MOVE PBI-I-AH-BENEFIT-TYPE  TO PB-I-AH-INPUT-CD.         EL512
01930                                                                   EL512
01931      MOVE PBI-I-AH-EXPIRE-DT       TO DC-GREG-DATE-1-MDY.         EL512
01932      MOVE '4'                      TO DC-OPTION-CODE.             EL512
01933      PERFORM 8500-DATE-CONVERSION                                 EL512
01934      IF NO-CONVERSION-ERROR                                       EL512
01935          MOVE DC-BIN-DATE-1        TO PB-I-AH-EXPIRE-DT.          EL512
01936                                                                   EL512
01937      IF PBI-I-AH-CRIT-PERIOD NOT NUMERIC                          EL512
01938          MOVE ZERO                 TO PBI-I-AH-CRIT-PERIOD.       EL512
01939                                                                   EL512
01940      MOVE PBI-I-AH-CRIT-PERIOD     TO PB-I-AH-CRIT-PER.           EL512
032409
032409     IF PBI-I-VIN = LOW-VALUES
032409         MOVE SPACES               TO PBI-I-VIN
032409     END-IF.
032409     MOVE PBI-I-VIN                TO PB-I-VIN.
01941                                                                   EL512
01942      GO TO 4390-EDIT-FORMS-CONTINUED.                             EL512
01943                                                                   EL512
01944  4330-EDIT-FORM5-ISSUE-TRANS.                                     EL512
01945 ******************************************************************EL512
01946 *      LOAN DATA  - SEQ 5 RECORD                                 *EL512
01947 ******************************************************************EL512
01948                                                                   EL512
01949      MOVE PBI-I-LOAN-OFFICER     TO PB-I-LOAN-OFFICER.            EL512
01950                                                                   EL512
01951      IF PBI-I-LOAN-TERM NOT NUMERIC                               EL512
01952          MOVE ZERO                 TO PBI-I-LOAN-TERM.            EL512
01953                                                                   EL512
01954      MOVE PBI-I-LOAN-TERM          TO PB-I-LOAN-TERM.             EL512
01955                                                                   EL512
01956      IF (PBI-I-1ST-PMT-DT = ZERO) OR                              EL512
01957         (PBI-I-1ST-PMT-MO NOT NUMERIC OR                          EL512
01958          PBI-I-1ST-PMT-DA NOT NUMERIC OR                          EL512
01959          PBI-I-1ST-PMT-YR NOT NUMERIC)                            EL512
01960           NEXT SENTENCE                                           EL512
01961         ELSE                                                      EL512
01962           MOVE PBI-I-1ST-PMT-DT   TO DC-GREG-DATE-1-MDY           EL512
01963           MOVE '4'                TO DC-OPTION-CODE               EL512
01964           PERFORM 8500-DATE-CONVERSION                            EL512
01965           IF NO-CONVERSION-ERROR                                  EL512
01966               MOVE DC-BIN-DATE-1  TO PB-I-1ST-PMT-DT              EL512
01967               MOVE '4'            TO PB-I-DATA-ENTRY-SW.          EL512
01968                                                                   EL512
01969      IF PBI-I-EXT-DAYS NOT NUMERIC                                EL512
01970          MOVE ZERO                 TO PBI-I-EXT-DAYS.             EL512
01971                                                                   EL512
01972      MOVE PBI-I-EXT-DAYS           TO PB-I-EXTENTION-DAYS.        EL512
01973                                                                   EL512
01974      IF PB-1ST-PMT-DT-PROCESSING                                  EL512
01975         NEXT SENTENCE                                             EL512
01976      ELSE                                                         EL512
01977         IF PBI-I-EXT-DAYS > ZERO                                  EL512
01978             MOVE '2' TO PB-I-DATA-ENTRY-SW.                       EL512
01979                                                                   EL512
01980      MOVE PBI-I-INDV-GRP-CD      TO PB-I-INDV-GRP-CD.             EL512
01981      MOVE PBI-I-REIN-CODE        TO PB-I-SPECIAL-REIN-CODE.       EL512
01982      MOVE PBI-I-SIG-SW           TO PB-I-SIG-SW.                  EL512
01983      MOVE PBI-I-TERM-TYPE        TO PB-I-TERM-TYPE.               EL512
01984      MOVE PBI-I-RATE-CLASS       TO PB-I-RATE-CLASS-OVRD.         EL512
01985                                                                   EL512
01986      MOVE PBI-I-BENEFICIARY      TO PB-I-BENEFICIARY-NAME.        EL512
01987                                                                   EL512
01988      IF PBI-I-LOAN-APR NOT NUMERIC                                EL512
01989          MOVE ZEROS              TO PB-I-LOAN-APR                 EL512
01990          MOVE ER-1016            TO P-ERROR-DESC                  EL512
01991          PERFORM ERROR-ROUTINE                                    EL512
01992      ELSE                                                         EL512
01993          MOVE PBI-I-LOAN-APR     TO PB-I-LOAN-APR.                EL512
01994                                                                   EL512
01995      IF PBI-I-LIVES NOT NUMERIC                                   EL512
01996          MOVE ZERO                 TO PBI-I-LIVES.                EL512
01997                                                                   EL512
01998      IF (DTE-CLIENT = 'HAN' OR 'BNE' OR 'JHL') AND                EL512
01999         (PB-I-TERM-TYPE = 'B' OR 'W' OR 'S')                      EL512
02000          MOVE PBI-I-NO-OF-PAYMENTS TO PB-I-NO-OF-PAYMENTS         EL512
02001      ELSE                                                         EL512
02002      IF DTE-CLIENT = 'CRI'                                        EL512
02003          MOVE PBI-I-NO-OF-PAYMENTS TO PB-I-NO-OF-PAYMENTS         EL512
02004      ELSE                                                         EL512
02005          MOVE PBI-I-LIVES          TO PB-I-LIVES.                 EL512
02006                                                                   EL512
02007      IF PBI-I-PAY-FREQUENCY NOT NUMERIC                           EL512
02008          MOVE ZEROS              TO PB-I-PAY-FREQUENCY            EL512
02009          MOVE ER-1017            TO P-ERROR-DESC                  EL512
02010          PERFORM ERROR-ROUTINE                                    EL512
02011      ELSE                                                         EL512
02012          MOVE PBI-I-PAY-FREQUENCY TO PB-I-PAY-FREQUENCY.          EL512
02013                                                                   EL512
02014      MOVE PBI-I-SKIP-CODE        TO PB-I-SKIP-CODE.               EL512
02015                                                                   EL512
02016      GO TO 4390-EDIT-FORMS-CONTINUED.                             EL512
02017                                                                   EL512
02018  4340-EDIT-FORM6-ISSUE-TRANS.                                     EL512
02019 ******************************************************************EL512
02020 *    ADDRESS DATA - SEQ 6 RECORD                                 *EL512
02021 ******************************************************************EL512
02022                                                                   EL512
02023      MOVE PBI-I-INSURED-ADDRESS-1 TO WS-M-INSURED-ADDRESS-1.      EL512
02024      MOVE PBI-I-INSURED-ADDRESS-2 TO WS-M-INSURED-ADDRESS-2.      EL512
02025                                                                   EL512
02026      GO TO 4390-EDIT-FORMS-CONTINUED.                             EL512
02027                                                                   EL512
02028 ** DMD CUSTOM CODE     *****START                                 EL512
02029  4345-EDIT-CSO-FORM7-TRANS.                                       EL512
02030 ******************************************************************EL512
02031 *    CSO DATA  SEQ - 7 RECORD  (PRIMA/FACIA RATES,RES STATE IE   *EL512
02032 ******************************************************************EL512
02033                                                                   EL512
02034 *   CHECK FOR NUMERIC FIELDS                                      EL512
02035                                                                   EL512
02036      PERFORM 1470-ISSUE-CSO-TRANS.                                EL512
02037                                                                   EL512
02038 *DEFAULT TO LF COVERAGE.                                          EL512
02039                                                                   EL512
02040      MOVE PBI-I-DMD-CURRENT-PREM-RATE    TO PB-I-LF-RATE.         EL512
02041      MOVE PBI-I-DMD-PRIMA-FACIA-PRM-RATE TO PB-I-AH-RATE.         EL512
02042                                                                   EL512
02043 *FLIP RATES IF AH COVERAGE IS PRESENT                             EL512
02044                                                                   EL512
02045      IF PB-I-AH-PREMIUM-AMT = ZERO                                EL512
02046          NEXT SENTENCE                                            EL512
02047       ELSE                                                        EL512
02048          MOVE PBI-I-DMD-CURRENT-PREM-RATE    TO PB-I-AH-RATE      EL512
02049          MOVE PBI-I-DMD-PRIMA-FACIA-PRM-RATE TO PB-I-LF-RATE.     EL512
02050                                                                   EL512
02051      MOVE PBI-I-DMD-RATE-CODE     TO PB-I-RATE-CODE.              EL512
02052      MOVE PBI-I-DMD-RESIDENT-STATE TO PB-I-RESIDENT-STATE.        EL512
02053      MOVE PBI-I-DMD-LIVES         TO PB-I-LIVES.                  EL512
02054      MOVE PBI-I-DMD-BILLED        TO PB-I-NUM-BILLED.             EL512
02055 ** DMD CUSTOM CODE     *****END                                   EL512
02056                                                                   EL512
02057  4350-EDIT-FORM7-ISSUE-TRANS.                                     EL512
02058 ******************************************************************EL512
02059 *    ADDRESS DATA - SEQ 7 RECORD                                 *EL512
02060 ******************************************************************EL512
02061                                                                   EL512
02062 ** DMD CUSTOM CODE     *****START                                 EL512
02063      IF DTE-CLIENT = 'DMD'                                        EL512
02064          PERFORM 4345-EDIT-CSO-FORM7-TRANS                        EL512
02065          GO TO 4390-EDIT-FORMS-CONTINUED.                         EL512
02066 ** DMD CUSTOM CODE     *****END                                   EL512
02067                                                                   EL512
051810*    MOVE PBI-I-INSURED-CITY-STATE TO WS-M-INSURED-CITY-STATE.    EL512
051810     MOVE PBI-I-INSURED-CITY     TO WS-M-INSURED-CITY
051810     MOVE PBI-I-INSURED-STATE    TO WS-M-INSURED-STATE
02069      MOVE PBI-I-INSURED-ZIP-CODE   TO WS-M-INSURED-ZIP-CODE.      EL512
02070      MOVE PBI-I-INSURED-PHONE-NO   TO WS-M-INSURED-PHONE-NO.      EL512
02071                                                                   EL512
           GO TO 4390-EDIT-FORMS-CONTINUED.                             EL512

02018  4360-EDIT-FORM8-ISSUE-TRANS.                                     EL512
02019 ******************************************************************EL512
02020 *    CRED BENE DATA SEQ 8 RECORD                                 *EL512
02021 ******************************************************************EL512
02022                                                                   EL512
           MOVE PBI-I-CRED-BENE-NAME   TO WS-M-CRED-BENE-NAME
           MOVE PBI-I-CRED-BENE-ADDR1  TO WS-M-CRED-BENE-ADDR1

           .
02072  4390-EDIT-FORMS-CONTINUED.                                       EL512
02073      MOVE 'ISSUE'                TO  P-TYPE.                      EL512
02074      IF CURRENT-ACCOUNT-INVALID                                   EL512
02075          ADD +1                  TO  WS-FT-INVL-LTYPE-ISS-CNT.    EL512
02076                                                                   EL512
02077  4399-EXIT.                                                       EL512
02078      EXIT.                                                        EL512
02079      EJECT                                                        EL512
02080  4400-EDIT-CANCEL-TRANS SECTION.                                  EL512
02081                                                                   EL512
02082      MOVE SPACES                 TO WS-DETAIL1.                   EL512
02083      MOVE SR-BATCH-NO            TO  P-BATCH-NO                   EL512
02084                                      WS-BATCH-NO.                 EL512
02085      MOVE SR-SEQ-NO              TO P-SEQ-NO.                     EL512
02086      MOVE PBI-CERT-NO            TO P-CERT-NO.                    EL512
02087      MOVE 'CANCEL'               TO P-TYPE.                       EL512
02088                                                                   EL512
02089      IF PBI-CERT-EFF-MO NOT NUMERIC OR                            EL512
02090         PBI-CERT-EFF-DA NOT NUMERIC OR                            EL512
02091         PBI-CERT-EFF-YR NOT NUMERIC                               EL512
02092          MOVE WS-SAVE-DATE       TO WS-SAVE-BIN-DATE              EL512
02093          ADD +1                  TO WS-FT-INVL-CERT-CAN-CNT       EL512
02094          MOVE +91                TO WS-ERROR-CNT                  EL512
02095          MOVE ER-1021            TO P-ERROR-DESC                  EL512
02096          PERFORM ERROR-ROUTINE                                    EL512
02097          MOVE ER-1036            TO P-ERROR-DESC                  EL512
02098          PERFORM ERROR-ROUTINE                                    EL512
02099      ELSE                                                         EL512
02100          MOVE PBI-CERT-EFF-YR    TO DC-MDY-YEAR                   EL512
02101          MOVE PBI-CERT-EFF-MO    TO DC-MDY-MONTH                  EL512
02102          MOVE PBI-CERT-EFF-DA    TO DC-MDY-DAY                    EL512
02103          MOVE '4'                TO DC-OPTION-CODE                EL512
02104          PERFORM 8500-DATE-CONVERSION                             EL512
02105          IF NO-CONVERSION-ERROR                                   EL512
02106              MOVE DC-BIN-DATE-1  TO WS-SAVE-BIN-DATE              EL512
02107          ELSE                                                     EL512
02108              MOVE WS-121212-BIN-DATE                              EL512
02109                                  TO WS-SAVE-BIN-DATE              EL512
02110              ADD +1              TO WS-FT-INVL-CERT-CAN-CNT       EL512
02111              MOVE +91            TO WS-ERROR-CNT                  EL512
02112              MOVE ER-1021        TO P-ERROR-DESC                  EL512
02113              PERFORM ERROR-ROUTINE                                EL512
02114              MOVE ER-1036        TO P-ERROR-DESC                  EL512
02115              PERFORM ERROR-ROUTINE.                               EL512
02116                                                                   EL512
02117      MOVE '1'                    TO WS-PREVIOUS-CANCEL-TYPE.      EL512
02118                                                                   EL512
02119      IF CURRENT-ACCOUNT-INVALID                                   EL512
02120          ADD +1                  TO  WS-FT-INVL-CAN-CNT           EL512
02121                                      WS-BT-ENTR-CAN-CNT           EL512
02122                                      WS-AT-ENTR-CAN-CNT           EL512
02123      ELSE                                                         EL512
02124          ADD +1                  TO  WS-BT-ENTR-CAN-CNT           EL512
02125                                      WS-AT-ENTR-CAN-CNT           EL512
02126                                      WS-FT-CAN-CNT.               EL512
02127                                                                   EL512
02128      IF PBI-C-LF-PREM-REFUND NUMERIC                              EL512
02129         MOVE PBI-C-LF-PREM-REFUND TO P-LF-REFUND.                 EL512
02130                                                                   EL512
02131      IF PBI-C-AH-PREM-REFUND NUMERIC                              EL512
02132         MOVE PBI-C-AH-PREM-REFUND TO P-AH-REFUND.                 EL512
02133                                                                   EL512
02134      IF PBI-C-LF-CAN-MO NOT NUMERIC OR                            EL512
02135         PBI-C-LF-CAN-DA NOT NUMERIC OR                            EL512
02136         PBI-C-LF-CAN-YR NOT NUMERIC                               EL512
02137          MOVE 0                  TO PBI-C-LF-CANCEL-DATE             CL**3
02138          MOVE ER-1022            TO P-ERROR-DESC                  EL512
02139          PERFORM ERROR-ROUTINE.                                   EL512
02140                                                                   EL512
02141      IF PBI-C-AH-CAN-MO NOT NUMERIC OR                            EL512
02142         PBI-C-AH-CAN-DA NOT NUMERIC OR                            EL512
02143         PBI-C-AH-CAN-YR NOT NUMERIC                               EL512
02144          MOVE 0                  TO PBI-C-AH-CANCEL-DATE             CL**3
02145          MOVE ER-1022            TO P-ERROR-DESC                  EL512
02146          PERFORM ERROR-ROUTINE.                                   EL512
02147                                                                   EL512
02148      IF PBI-C-LIVES NOT NUMERIC                                   EL512
02149          MOVE ZERO               TO PBI-C-LIVES.                  EL512
02150                                                                   EL512
02151      PERFORM 5200-BUILD-CANCEL-RECORD THRU 5200-EXIT.             EL512
02152                                                                   EL512
02153      IF PBI-C-LF-PREM-REFUND NOT NUMERIC                          EL512
02154          MOVE ZEROS              TO PB-C-LF-CANCEL-AMT            EL512
02155                                     P-LF-REFUND                   EL512
02156          MOVE ER-1023            TO P-ERROR-DESC                  EL512
02157          PERFORM ERROR-ROUTINE                                    EL512
02158      ELSE                                                         EL512
02159          IF PBI-C-LF-PREM-REFUND-X = WS-ALL-NINES                 EL512
02160              MOVE '?'            TO PB-C-LF-CALC-REQ              EL512
02161              MOVE ZEROS          TO P-LF-REFUND                   EL512
02162                                     PB-C-LF-CANCEL-AMT            EL512
02163          ELSE                                                     EL512
02164              MOVE PBI-C-LF-PREM-REFUND                            EL512
02165                                  TO P-LF-REFUND                   EL512
02166                                     PB-C-LF-CANCEL-AMT            EL512
02167              ADD  PBI-C-LF-PREM-REFUND                            EL512
02168                                  TO WS-BT-ENTR-LF-REFUND          EL512
02169                                     WS-AT-ENTR-LF-REFUND.         EL512
02170                                                                   EL512
02171      IF PBI-C-AH-PREM-REFUND NOT NUMERIC                          EL512
02172          MOVE ZEROS              TO PB-C-AH-CANCEL-AMT            EL512
02173                                     P-AH-REFUND                   EL512
02174          MOVE ER-1024            TO P-ERROR-DESC                  EL512
02175          PERFORM ERROR-ROUTINE                                    EL512
02176      ELSE                                                         EL512
02177          IF PBI-C-AH-PREM-REFUND-X = WS-ALL-NINES                 EL512
02178              MOVE '?'            TO PB-C-AH-CALC-REQ              EL512
02179              MOVE ZEROS          TO P-AH-REFUND                   EL512
02180                                     PB-C-AH-CANCEL-AMT            EL512
02181          ELSE                                                     EL512
02182              MOVE PBI-C-AH-PREM-REFUND                            EL512
02183                                  TO P-AH-REFUND                   EL512
02184                                     PB-C-AH-CANCEL-AMT            EL512
02185              ADD  PBI-C-AH-PREM-REFUND                            EL512
02186                                  TO WS-BT-ENTR-AH-REFUND          EL512
02187                                     WS-AT-ENTR-AH-REFUND.         EL512
02188                                                                   EL512
02189      MOVE PBI-C-INSURED-NAME     TO PB-C-LAST-NAME.               EL512
02190                                                                   EL512
02191      MOVE PBI-C-LIVES            TO PB-C-LIVES.                   EL512
02192                                                                   EL512
02193      MOVE PBI-C-POLICY-FORM-NO   TO PB-C-POLICY-FORM-NO.          EL512
02194                                                                   EL512
02195      IF PBI-C-FORCE-CD = 'H'                                      EL512
02196          MOVE 'H'                TO PB-RECORD-BILL.               EL512
02197                                                                   EL512
02198      IF PBI-C-FORCE-CD = '8' OR 'D'                               EL512
02199          MOVE PBI-C-FORCE-CD     TO PB-FORCE-CODE.                EL512
02200                                                                   EL512
02201  4400-EXIT.                                                       EL512
02202      EXIT.                                                        EL512
02203                                                                   EL512
02204      EJECT                                                        EL512
02205  4500-EDIT-OTHER-CANCEL.                                          EL512
02206      MOVE ' '                    TO WS-PREVIOUS-CANCEL-TYPE.      EL512
02207      ADD +1                      TO WS-FT-CAN-CNT.                EL512
02208      MOVE SR-BATCH-NO            TO P-BATCH-NO                    EL512
02209                                     WS-BATCH-NO.                  EL512
02210      MOVE SR-SEQ-NO              TO P-SEQ-NO.                     EL512
02211      MOVE PBI-CERT-NO            TO P-CERT-NO.                    EL512
02212      MOVE 'CANCEL'               TO P-TYPE.                       EL512
02213      MOVE PBI-C-BENEFICIARY-NAME TO PB-CI-BENEFICIARY-NAME.       EL512
032306     MOVE PBI-C-BOW-LOAN-NUMBER  TO PB-CI-BOW-LOAN-NUMBER
02214                                                                   EL512
02215      PERFORM 3000-WRITE-PENDING-BUSINESS THRU 3000-EXIT.          EL512
02216                                                                   EL512
02217      IF NO-ERRORS-FOUND                                           EL512
02218          MOVE WS-BATCH-NO    TO P-BATCH-NO                        EL512
02219          MOVE WS-DETAIL1     TO PRT                               EL512
02220          PERFORM WRITE-A-LINE.                                    EL512
02221                                                                   EL512
02222  4500-EXIT.                                                       EL512
02223      EXIT.                                                        EL512
02224                                                                   EL512
02225      EJECT                                                        EL512
02226  5000-BUILD-REMIT-RECORD.                                         EL512
02227      MOVE SPACES                 TO PENDING-BUSINESS.             EL512
02228      MOVE 'PB'                   TO PB-RECORD-ID.                 EL512
02229      MOVE LIFE-OVERRIDE-L1       TO PB-LIFE-OVERRIDE-L1.          EL512
02230      MOVE AH-OVERRIDE-L1         TO PB-AH-OVERRIDE-L1.            EL512
02231      MOVE CF-COMPANY-CD          TO PB-COMPANY-CD                 EL512
02232                                     PB-COMPANY-CD-A1              EL512
02233                                     PB-ORIGINAL-COMPANY-CD.       EL512
02234      MOVE SR-BATCH-NO            TO PB-ENTRY-BATCH                EL512
02235                                     PB-ORIGINAL-ENTRY-BATCH       EL512
02236                                     PB-CERT-NO.                   EL512
02237      IF DTE-CLIENT = 'CRI'                                        EL512
02238          MOVE SR-BATCH-NO        TO PB-REFERENCE.                 EL512
02239                                                                   EL512
02240      MOVE 9999                   TO PB-BATCH-SEQ-NO               EL512
02241                                     PB-ORIGINAL-SEQ-NO.           EL512
02242      MOVE HIGH-VALUES            TO PB-CERT-EFF-DT.               EL512
02243      MOVE ZEROS                  TO PB-BATCH-CHG-SEQ-NO           EL512
02244                                     PB-ALT-CHG-SEQ-NO             EL512
02245                                     PB-ORIGINAL-CHG-SEQ-NO.       EL512
02246      MOVE WS-SAVE-DATE           TO PB-LAST-MAINT-DT              EL512
02247                                     PB-INPUT-DT.                  EL512
02248      MOVE WS-SAVE-TIME           TO PB-LAST-MAINT-HHMMSS.         EL512
02249      MOVE WS-PROCESSOR-ID        TO PB-LAST-MAINT-BY              EL512
02250                                     PB-INPUT-BY.                  EL512
02251      MOVE CF-COMPANY-ID          TO PB-COMPANY-ID.                EL512
02252      MOVE '9'                    TO PB-RECORD-TYPE.               EL512
02253                                                                   EL512
02254      MOVE SR-CARRIER             TO PB-SV-CARRIER.                EL512
02255      MOVE SR-GROUPING            TO PB-SV-GROUPING.               EL512
02256      MOVE SR-STATE               TO PB-SV-STATE.                  EL512
02257                                                                   EL512
02258      MOVE WS-SAVE-ACCOUNT        TO PB-ACCOUNT.                   EL512
02259                                                                   EL512
02260      IF CF-ST-ACCNT-CNTL                                          EL512
02261          MOVE WS-SAVE-STATE      TO PB-STATE.                     EL512
02262                                                                   EL512
02263      IF CF-CARR-ACCNT-CNTL                                        EL512
02264          MOVE WS-SAVE-CARRIER    TO PB-CARRIER.                   EL512
02265                                                                   EL512
02266      IF CF-CARR-ST-ACCNT-CNTL                                     EL512
02267          MOVE WS-SAVE-STATE      TO PB-STATE                      EL512
02268          MOVE WS-SAVE-CARRIER    TO PB-CARRIER.                   EL512
02269                                                                   EL512
02270      IF CF-CARR-GROUP-ST-ACCNT-CNTL                               EL512
02271          MOVE WS-SAVE-GROUPING   TO PB-GROUPING                   EL512
02272          MOVE WS-SAVE-STATE      TO PB-STATE                      EL512
02273          MOVE WS-SAVE-CARRIER    TO PB-CARRIER.                   EL512
02274                                                                   EL512
02275      MOVE ZEROS                  TO PB-B-LF-ISS-PRM-COMPUTED      EL512
02276                                     PB-B-LF-CAN-PRM-COMPUTED      EL512
02277                                     PB-B-AH-ISS-PRM-COMPUTED      EL512
02278                                     PB-B-AH-CAN-PRM-COMPUTED      EL512
02279                                     PB-CHG-COUNT                  EL512
02280                                     PB-CALC-TOLERANCE             EL512
02281                                     PB-B-LF-ISS-PRM-REMITTED      EL512
02282                                     PB-B-LF-ISS-PRM-ENTERED       EL512
02283                                     PB-B-AH-ISS-PRM-REMITTED      EL512
02284                                     PB-B-AH-ISS-PRM-ENTERED       EL512
02285                                     PB-B-ISSUE-CNT-REMITTED       EL512
02286                                     PB-B-ISSUE-CNT-ENTERED        EL512
02287                                     PB-B-CANCEL-CNT-REMITTED      EL512
02288                                     PB-B-CANCEL-CNT-ENTERED       EL512
02289                                     PB-B-LF-CAN-PRM-REMITTED      EL512
02290                                     PB-B-LF-CAN-PRM-ENTERED       EL512
02291                                     PB-B-AH-CAN-PRM-REMITTED      EL512
02292                                     PB-LF-BILLED-AMTS             EL512
02293                                     PB-AH-BILLED-AMTS             EL512
02294                                     PB-B-HIGHEST-SEQ-NO           EL512
02295                                     PB-B-AH-CAN-PRM-ENTERED.      EL512
02296                                                                   EL512
02297      MOVE LOW-VALUES             TO PB-CREDIT-ACCEPT-DT           EL512
02298                                     PB-CREDIT-SELECT-DT           EL512
02299                                     PB-CONFIRMATION-REPT-DT       EL512
02300                                     PB-BILLED-DT                  EL512
02301                                     PB-ACCT-EFF-DT                EL512
02302                                     PB-ACCT-EXP-DT                EL512
02303                                     PB-COMMON-ERRORS.             EL512
02304                                                                   EL512
02305      IF PB-COMPANY-ID = 'DMD'                                     EL512
02306          MOVE WS-SAVE-BIN-DATE  TO PB-CREDIT-SELECT-DT            EL512
02307        ELSE                                                       EL512
02308          MOVE WS-MONTH-END-DATE TO PB-CREDIT-SELECT-DT.           EL512
02309                                                                   EL512
02310      MOVE PB-COMPANY-CD          TO PB-CSR-COMPANY-CD.            EL512
02311      MOVE PB-ENTRY-BATCH         TO PB-CSR-ENTRY-BATCH.           EL512
02312      MOVE AM-CSR-CODE            TO PB-CSR-ID.                    EL512
02313      MOVE PB-BATCH-SEQ-NO        TO PB-CSR-BATCH-SEQ-NO.          EL512
02314      MOVE +0                     TO PB-CSR-BATCH-CHG-SEQ-NO.      EL512
02315                                                                   EL512
02316  5000-EXIT.                                                       EL512
02317      EXIT.                                                        EL512
02318      EJECT                                                        EL512
02319                                                                   EL512
02320  5100-BUILD-ISSUE-RECORD.                                         EL512
02321      MOVE SPACES                 TO PENDING-BUSINESS.             EL512
02322      MOVE 'PB'                   TO PB-RECORD-ID.                 EL512
02323      MOVE CF-COMPANY-CD          TO PB-COMPANY-CD                 EL512
02324                                     PB-COMPANY-CD-A1              EL512
02325                                     PB-ORIGINAL-COMPANY-CD.       EL512
02326      MOVE SR-BATCH-NO            TO PB-ENTRY-BATCH                EL512
02327                                     PB-ORIGINAL-ENTRY-BATCH.      EL512
02328      MOVE SR-SEQ-NO              TO PB-BATCH-SEQ-NO               EL512
02329                                     WS-LAST-SEQ-NO                EL512
02330                                     PB-ORIGINAL-SEQ-NO.           EL512
02331      MOVE WS-SAVE-DATE           TO PB-LAST-MAINT-DT              EL512
02332                                     PB-INPUT-DT.                  EL512
02333      MOVE WS-SAVE-TIME           TO PB-LAST-MAINT-HHMMSS.         EL512
02334      MOVE WS-PROCESSOR-ID        TO PB-LAST-MAINT-BY              EL512
02335                                     PB-INPUT-BY.                  EL512
02336      MOVE '1'                    TO PB-RECORD-TYPE.               EL512
02337      MOVE PBI-CERT-PRIME         TO PB-CERT-PRIME.                EL512
02338      MOVE PBI-CERT-SFX           TO PB-CERT-SFX.                  EL512
02339      MOVE CF-COMPANY-ID          TO PB-COMPANY-ID.                EL512
02340      MOVE WS-SAVE-BIN-DATE       TO PB-CERT-EFF-DT.               EL512
02341      MOVE 'X'                    TO PB-FATAL-FLAG.                EL512
02342                                                                   EL512
02343      MOVE SR-CARRIER             TO PB-SV-CARRIER.                EL512
02344      MOVE SR-GROUPING            TO PB-SV-GROUPING.               EL512
02345      MOVE SR-STATE               TO PB-SV-STATE.                  EL512
02346                                                                   EL512
02347      MOVE WS-SAVE-ACCOUNT        TO PB-ACCOUNT.                   EL512
02348                                                                   EL512
02349      IF CF-ST-ACCNT-CNTL                                          EL512
02350          MOVE WS-SAVE-STATE      TO PB-STATE.                     EL512
02351                                                                   EL512
02352      IF CF-CARR-ACCNT-CNTL                                        EL512
02353          MOVE WS-SAVE-CARRIER    TO PB-CARRIER.                   EL512
02354                                                                   EL512
02355      IF CF-CARR-ST-ACCNT-CNTL                                     EL512
02356          MOVE WS-SAVE-STATE      TO PB-STATE                      EL512
02357          MOVE WS-SAVE-CARRIER    TO PB-CARRIER.                   EL512
02358                                                                   EL512
02359      IF CF-CARR-GROUP-ST-ACCNT-CNTL                               EL512
02360          MOVE WS-SAVE-GROUPING   TO PB-GROUPING                   EL512
02361          MOVE WS-SAVE-STATE      TO PB-STATE                      EL512
02362          MOVE WS-SAVE-CARRIER    TO PB-CARRIER.                   EL512
02363                                                                   EL512
02364      MOVE PB-COMPANY-CD          TO PB-CSR-COMPANY-CD.            EL512
02365      MOVE PB-ENTRY-BATCH         TO PB-CSR-ENTRY-BATCH.           EL512
02366      MOVE AM-CSR-CODE            TO PB-CSR-ID.                    EL512
02367      MOVE PB-BATCH-SEQ-NO        TO PB-CSR-BATCH-SEQ-NO.          EL512
02368      MOVE +0                     TO PB-CSR-BATCH-CHG-SEQ-NO.      EL512
02369                                                                   EL512
02370      MOVE ZEROS                  TO PB-BATCH-CHG-SEQ-NO           EL512
02371                                     PB-ALT-CHG-SEQ-NO             EL512
02372                                     PB-ORIGINAL-CHG-SEQ-NO        EL512
02373                                     PB-I-AGE                      EL512
02374                                     PB-I-JOINT-AGE                EL512
02375                                     PB-I-LF-TERM                  EL512
02376                                     PB-I-AH-TERM                  EL512
02377                                     PB-I-PAYMENT-AMOUNT           EL512
02378                                     PB-I-LOAN-TERM                EL512
02379                                     PB-I-PAY-FREQUENCY            EL512
02380                                     PB-I-NO-OF-PAYMENTS           EL512
02381                                     PB-I-LF-BENEFIT-CD            EL512
02382                                     PB-I-LF-BENEFIT-AMT           EL512
02383                                     PB-I-LF-ALT-BENEFIT-AMT       EL512
02384                                     PB-I-LF-PREMIUM-AMT           EL512
02385                                     PB-I-LF-ALT-PREMIUM-AMT       EL512
02386                                     PB-I-LF-PREM-CALC             EL512
02387                                     PB-I-LF-ALT-PREM-CALC         EL512
02388                                     PB-I-LF-RATE                  EL512
02389                                     PB-I-LF-ALT-RATE              EL512
02390                                     PB-I-LF-REI-RATE              EL512
02391                                     PB-I-LF-ALT-REI-RATE          EL512
02392                                     PB-I-AH-BENEFIT-CD            EL512
02393                                     PB-I-AH-BENEFIT-AMT           EL512
02394                                     PB-I-AH-PREMIUM-AMT           EL512
02395                                     PB-I-AH-PREM-CALC             EL512
02396                                     PB-I-AH-RATE                  EL512
02397                                     PB-I-AH-REI-RATE              EL512
02398                                     PB-I-AH-RATE-TRM              EL512
011904                                    PB-I-TOT-FEES
011904                                    PB-I-TOT-FEES-CALC
02399                                     PB-I-BUSINESS-TYPE            EL512
02400                                     PB-I-LF-CRIT-PER              EL512
02401                                     PB-I-AH-CRIT-PER              EL512
02402                                     PB-I-RATE-DEV-PCT-LF          EL512
02403                                     PB-I-RATE-DEV-PCT-AH          EL512
02404                                     PB-I-LIFE-COMMISSION          EL512
02405                                     PB-I-JOINT-COMMISSION         EL512
02406                                     PB-I-AH-COMMISSION            EL512
02407                                     PB-I-LOAN-APR                 EL512
02408                                     PB-I-CURR-SEQ                 EL512
02409                                     PB-I-EXTENTION-DAYS           EL512
02410                                     PB-I-TERM-IN-DAYS             EL512
02411                                     PB-I-LIVES                    EL512
02412                                     PB-I-STATE-TAX                EL512
02413                                     PB-I-MUNI-TAX                 EL512
02414                                     PB-I-NUM-BILLED               EL512
02415                                     PB-CHG-COUNT                  EL512
02416                                     PB-LF-BILLED-AMTS             EL512
02417                                     PB-AH-BILLED-AMTS             EL512
02418                                     PB-CALC-TOLERANCE             EL512
02419 *                                   PB-I-MICROFILM-NO.            EL512
02420                                                                   EL512
02421      MOVE LOW-VALUES             TO PB-CREDIT-ACCEPT-DT           EL512
02422                                     PB-CREDIT-SELECT-DT           EL512
02423                                     PB-I-BIRTHDAY                 EL512
02424                                     PB-I-LF-EXPIRE-DT             EL512
02425                                     PB-I-AH-EXPIRE-DT             EL512
02426                                     PB-I-1ST-PMT-DT               EL512
02427                                     PB-BILLED-DT                  EL512
02428                                     PB-CONFIRMATION-REPT-DT       EL512
02429                                     PB-ACCT-EFF-DT                EL512
02430                                     PB-ACCT-EXP-DT                EL512
02431                                     PB-COMMON-ERRORS.             EL512
02432                                                                   EL512
02433 *    IF DTE-CLIENT = 'HER'                                        EL512
02434 *       COMPUTE PB-I-MICROFILM-NO =                               EL512
02435 *               (RUN-MO * +100) + RUN-YR.                         EL512
02436                                                                   EL512
02437      MOVE LIFE-OVERRIDE-L1       TO PB-LIFE-OVERRIDE-L1.          EL512
02438      MOVE AH-OVERRIDE-L1         TO PB-AH-OVERRIDE-L1.            EL512
02439                                                                   EL512
02440      IF PB-COMPANY-ID = 'DMD'                                     EL512
02441          MOVE WS-SAVE-BIN-DATE       TO PB-CREDIT-SELECT-DT       EL512
02442        ELSE                                                       EL512
02443          MOVE WS-MONTH-END-DATE      TO PB-CREDIT-SELECT-DT.      EL512
02444                                                                   EL512
02445  5100-EXIT.                                                       EL512
02446      EXIT.                                                        EL512
02447      EJECT                                                        EL512
02448                                                                   EL512
02449  5200-BUILD-CANCEL-RECORD.                                        EL512
02450      MOVE SPACES                 TO PENDING-BUSINESS.             EL512
02451      MOVE 'PB'                   TO PB-RECORD-ID.                 EL512
02452      MOVE CF-COMPANY-CD          TO PB-COMPANY-CD                 EL512
02453                                     PB-COMPANY-CD-A1              EL512
02454                                     PB-ORIGINAL-COMPANY-CD.       EL512
02455      MOVE SR-BATCH-NO            TO PB-ENTRY-BATCH                EL512
02456                                     PB-ORIGINAL-ENTRY-BATCH.      EL512
02457      MOVE SR-SEQ-NO              TO PB-BATCH-SEQ-NO               EL512
02458                                     WS-LAST-SEQ-NO                EL512
02459                                     PB-ORIGINAL-SEQ-NO.           EL512
02460      MOVE WS-SAVE-DATE           TO PB-LAST-MAINT-DT              EL512
02461                                     PB-INPUT-DT.                  EL512
02462      MOVE WS-SAVE-TIME           TO PB-LAST-MAINT-HHMMSS.         EL512
02463      MOVE WS-PROCESSOR-ID        TO PB-LAST-MAINT-BY              EL512
02464                                     PB-INPUT-BY.                  EL512
02465      MOVE '2'                    TO PB-RECORD-TYPE.               EL512
02466      MOVE PBI-CERT-PRIME         TO PB-CERT-PRIME.                EL512
02467      MOVE PBI-CERT-SFX           TO PB-CERT-SFX.                  EL512
02468      MOVE CF-COMPANY-ID          TO PB-COMPANY-ID.                EL512
02469      MOVE WS-SAVE-BIN-DATE       TO PB-CERT-EFF-DT.               EL512
02470      MOVE 'X'                    TO PB-FATAL-FLAG.                EL512
02471                                                                      CL**8
02472      MOVE PBI-C-LF-CAN-YR        TO DC-MDY-YEAR.                  EL512
02473      MOVE PBI-C-LF-CAN-MO        TO DC-MDY-MONTH.                 EL512
02474      MOVE PBI-C-LF-CAN-DA        TO DC-MDY-DAY.                   EL512
02475      MOVE '4'                    TO DC-OPTION-CODE.               EL512
02476      PERFORM 8500-DATE-CONVERSION.                                EL512
02477      IF NO-CONVERSION-ERROR                                       EL512
02478          MOVE DC-BIN-DATE-1      TO PB-C-LF-CANCEL-DT             EL512
02479      ELSE                                                         EL512
02480          MOVE LOW-VALUES         TO PB-C-LF-CANCEL-DT.            EL512
02481                                                                   EL512
02482      MOVE PBI-C-AH-CAN-YR        TO DC-MDY-YEAR.                  EL512
02483      MOVE PBI-C-AH-CAN-MO        TO DC-MDY-MONTH.                 EL512
02484      MOVE PBI-C-AH-CAN-DA        TO DC-MDY-DAY.                   EL512
02485      MOVE '4'                    TO DC-OPTION-CODE.               EL512
02486      PERFORM 8500-DATE-CONVERSION.                                EL512
02487      IF NO-CONVERSION-ERROR                                       EL512
02488          MOVE DC-BIN-DATE-1      TO PB-C-AH-CANCEL-DT             EL512
02489      ELSE                                                         EL512
02490          MOVE LOW-VALUES         TO PB-C-AH-CANCEL-DT.            EL512
02491                                                                   EL512
02492      MOVE SR-CARRIER             TO PB-SV-CARRIER.                EL512
02493      MOVE SR-GROUPING            TO PB-SV-GROUPING.               EL512
02494      MOVE SR-STATE               TO PB-SV-STATE.                  EL512
02495                                                                   EL512
02496      MOVE WS-SAVE-ACCOUNT        TO PB-ACCOUNT.                   EL512
02497                                                                   EL512
02498      IF CF-ST-ACCNT-CNTL                                          EL512
02499          MOVE WS-SAVE-STATE      TO PB-STATE.                     EL512
02500                                                                   EL512
02501      IF CF-CARR-ACCNT-CNTL                                        EL512
02502          MOVE WS-SAVE-CARRIER    TO PB-CARRIER.                   EL512
02503                                                                   EL512
02504      IF CF-CARR-ST-ACCNT-CNTL                                     EL512
02505          MOVE WS-SAVE-STATE      TO PB-STATE                      EL512
02506          MOVE WS-SAVE-CARRIER    TO PB-CARRIER.                   EL512
02507                                                                   EL512
02508      IF CF-CARR-GROUP-ST-ACCNT-CNTL                               EL512
02509          MOVE WS-SAVE-GROUPING   TO PB-GROUPING                   EL512
02510          MOVE WS-SAVE-STATE      TO PB-STATE                      EL512
02511          MOVE WS-SAVE-CARRIER    TO PB-CARRIER.                   EL512
02512                                                                   EL512
02513      MOVE PB-COMPANY-CD          TO PB-CSR-COMPANY-CD.            EL512
02514      MOVE PB-ENTRY-BATCH         TO PB-CSR-ENTRY-BATCH.           EL512
02515      MOVE AM-CSR-CODE            TO PB-CSR-ID.                    EL512
02516      MOVE PB-BATCH-SEQ-NO        TO PB-CSR-BATCH-SEQ-NO.          EL512
02517      MOVE +0                     TO PB-CSR-BATCH-CHG-SEQ-NO.      EL512
02518                                                                   EL512
02519      MOVE ZEROS                  TO PB-BATCH-CHG-SEQ-NO           EL512
02520                                     PB-ALT-CHG-SEQ-NO             EL512
02521                                     PB-ORIGINAL-CHG-SEQ-NO        EL512
02522                                     PB-C-LF-REF-CALC              EL512
02523                                     PB-C-AH-REF-CALC              EL512
02524                                     PB-C-AH-REM-TERM              EL512
02525                                     PB-C-LF-REM-TERM              EL512
02526                                     PB-CI-INSURED-AGE             EL512
02527                                     PB-CI-LF-CANCEL-AMT           EL512
02528                                     PB-CI-AH-CANCEL-AMT           EL512
02529                                     PB-CI-LF-TERM                 EL512
02530                                     PB-CI-AH-TERM                 EL512
02531                                     PB-CI-LF-BENEFIT-CD           EL512
02532                                     PB-CI-LF-BENEFIT-AMT          EL512
02533                                     PB-CI-LF-ALT-BENEFIT-AMT      EL512
02534                                     PB-CI-LF-PREMIUM-AMT          EL512
02535                                     PB-CI-LF-ALT-PREMIUM-AMT      EL512
02536                                     PB-CI-AH-BENEFIT-CD           EL512
02537                                     PB-CI-AH-BENEFIT-AMT          EL512
02538                                     PB-CI-AH-PREMIUM-AMT          EL512
02539                                     PB-CI-RATE-DEV-PCT-LF         EL512
02540                                     PB-CI-RATE-DEV-PCT-AH         EL512
02541                                     PB-CI-LIFE-COMMISSION         EL512
02542                                     PB-CI-AH-COMMISSION           EL512
02543                                     PB-CI-PAY-FREQUENCY           EL512
02544                                     PB-CI-LOAN-APR                EL512
02545                                     PB-CI-LOAN-TERM               EL512
02546                                     PB-CI-CURR-SEQ                EL512
02547                                     PB-C-LF-CANCEL-AMT            EL512
02548                                     PB-C-AH-CANCEL-AMT            EL512
02549                                     PB-CHG-COUNT                  EL512
02550                                     PB-LF-BILLED-AMTS             EL512
02551                                     PB-AH-BILLED-AMTS             EL512
02552                                     PB-CALC-TOLERANCE             EL512
02553                                     PB-CI-EXTENTION-DAYS          EL512
02554                                     PB-CI-TERM-IN-DAYS            EL512
02555                                     PB-CI-LIVES                   EL512
02556                                     PB-CI-LF-CRIT-PER             EL512
02557                                     PB-CI-AH-CRIT-PER             EL512
062017                                    PB-C-INT-ON-REFS.
02559                                                                   EL512
02560      MOVE LOW-VALUES             TO PB-CREDIT-ACCEPT-DT           EL512
02561                                     PB-CREDIT-SELECT-DT           EL512
02562                                     PB-CONFIRMATION-REPT-DT       EL512
02563                                     PB-BILLED-DT                  EL512
02564                                     PB-CI-ENTRY-DT                EL512
02565                                     PB-CI-LF-EXPIRE-DT            EL512
02566                                     PB-CI-AH-EXPIRE-DT            EL512
02567                                     PB-CI-AH-PAID-THRU-DT         EL512
02568                                     PB-CI-AH-SETTLEMENT-DT        EL512
02569                                     PB-CI-DEATH-DT                EL512
02570                                     PB-CI-LF-PRIOR-CANCEL-DT      EL512
02571                                     PB-CI-AH-PRIOR-CANCEL-DT      EL512
02572                                     PB-ACCT-EXP-DT                EL512
02573                                     PB-COMMON-ERRORS.             EL512
02574                                                                   EL512
02575 *    IF DTE-CLIENT = 'HER'                                        EL512
02576 *       COMPUTE PB-C-MICROFILM-NO =                               EL512
02577 *               (RUN-MO * +100) + RUN-YR.                         EL512
02578                                                                   EL512
02579      MOVE LIFE-OVERRIDE-L1       TO PB-LIFE-OVERRIDE-L1.          EL512
02580      MOVE AH-OVERRIDE-L1         TO PB-AH-OVERRIDE-L1.            EL512
02581                                                                   EL512
02582      IF PB-COMPANY-ID = 'DMD'                                     EL512
02583          MOVE WS-SAVE-BIN-DATE  TO PB-CREDIT-SELECT-DT            EL512
02584        ELSE                                                       EL512
02585          MOVE WS-MONTH-END-DATE TO PB-CREDIT-SELECT-DT.           EL512
02586                                                                   EL512
02587  5200-EXIT.                                                       EL512
02588      EXIT.                                                        EL512
02589      EJECT                                                        EL512
02590                                                                   EL512
02591  6000-BATCH-TOTALS SECTION.                                       EL512
02592      IF FIRST-BATCH                                               EL512
02593          ADD +1                  TO  WS-FIRST-BATCH-SW            EL512
02594          MOVE +0                 TO  WS-VALID-BATCH-SW            EL512
02595                                      WS-NO-BATCHES                EL512
02596          SET TOT-INDX            TO  +1                           EL512
02597          GO TO 6020-ZERO-TOTALS.                                  EL512
02598                                                                   EL512
02599 ***** UPDATE WORKING STORAGE BATCH TOTALS *****                   EL512
02600                                                                   EL512
02601      SUBTRACT   WS-BT-CNTL-ISS-CNT    FROM WS-BT-ENTR-ISS-CNT     EL512
02602          GIVING WS-BT-DIFF-ISS-CNT.                               EL512
02603      SUBTRACT   WS-BT-CNTL-CAN-CNT    FROM WS-BT-ENTR-CAN-CNT     EL512
02604          GIVING WS-BT-DIFF-CAN-CNT.                               EL512
02605      SUBTRACT   WS-BT-CNTL-LF-PREMIUM FROM WS-BT-ENTR-LF-PREMIUM  EL512
02606          GIVING WS-BT-DIFF-LF-PREMIUM.                            EL512
02607      SUBTRACT   WS-BT-CNTL-AH-PREMIUM FROM WS-BT-ENTR-AH-PREMIUM  EL512
02608          GIVING WS-BT-DIFF-AH-PREMIUM.                            EL512
02609      SUBTRACT   WS-BT-CNTL-AH-REFUND  FROM WS-BT-ENTR-AH-REFUND   EL512
02610          GIVING WS-BT-DIFF-AH-REFUND.                             EL512
02611      SUBTRACT   WS-BT-CNTL-LF-REFUND  FROM WS-BT-ENTR-LF-REFUND   EL512
02612          GIVING WS-BT-DIFF-LF-REFUND.                             EL512
02613                                                                   EL512
02614      IF WS-BT-DIFF-ISS-CNT    NOT = ZERO OR                       EL512
02615         WS-BT-DIFF-CAN-CNT    NOT = ZERO OR                       EL512
02616         WS-BT-DIFF-LF-PREMIUM NOT = ZERO OR                       EL512
02617         WS-BT-DIFF-LF-REFUND  NOT = ZERO OR                       EL512
02618         WS-BT-DIFF-AH-PREMIUM NOT = ZERO OR                       EL512
02619         WS-BT-DIFF-AH-REFUND  NOT = ZERO                          EL512
02620             MOVE +1              TO  WS-BATCH-BALANCE-SW.         EL512
02621                                                                   EL512
02622      MOVE WS-SAVE-BATCH-RECORD   TO PENDING-BUSINESS.             EL512
02623                                                                   EL512
02624 ***** MOVE IN BATCH HEADER TOTALS *****                           EL512
02625                                                                   EL512
02626      IF DTE-CLIENT = 'IMS'                                        EL512
02627          MOVE ZEROS                  TO PB-B-LF-ISS-PRM-REMITTED  EL512
02628                                         PB-B-AH-ISS-PRM-REMITTED  EL512
02629                                         PB-B-ISSUE-CNT-REMITTED   EL512
02630                                         PB-B-CANCEL-CNT-REMITTED  EL512
02631                                         PB-B-LF-CAN-PRM-REMITTED  EL512
02632                                         PB-B-AH-CAN-PRM-REMITTED  EL512
02633      ELSE                                                         EL512
02634          MOVE WS-BT-CNTL-LF-PREMIUM  TO PB-B-LF-ISS-PRM-REMITTED  EL512
02635          MOVE WS-BT-CNTL-AH-PREMIUM  TO PB-B-AH-ISS-PRM-REMITTED  EL512
02636          MOVE WS-BT-CNTL-ISS-CNT     TO PB-B-ISSUE-CNT-REMITTED   EL512
02637          MOVE WS-BT-CNTL-CAN-CNT     TO PB-B-CANCEL-CNT-REMITTED  EL512
02638          MOVE WS-BT-CNTL-LF-REFUND   TO PB-B-LF-CAN-PRM-REMITTED  EL512
02639          MOVE WS-BT-CNTL-AH-REFUND   TO PB-B-AH-CAN-PRM-REMITTED. EL512
02640                                                                   EL512
02641      MOVE WS-BT-ENTR-LF-PREMIUM  TO PB-B-LF-ISS-PRM-ENTERED.      EL512
02642      MOVE WS-BT-ENTR-AH-PREMIUM  TO PB-B-AH-ISS-PRM-ENTERED.      EL512
02643      MOVE WS-BT-ENTR-ISS-CNT     TO PB-B-ISSUE-CNT-ENTERED.       EL512
02644      MOVE WS-BT-ENTR-CAN-CNT     TO PB-B-CANCEL-CNT-ENTERED.      EL512
02645      MOVE WS-BT-ENTR-LF-REFUND   TO PB-B-LF-CAN-PRM-ENTERED.      EL512
02646      MOVE WS-BT-ENTR-AH-REFUND   TO PB-B-AH-CAN-PRM-ENTERED.      EL512
02647      MOVE WS-LAST-SEQ-NO         TO PB-B-HIGHEST-SEQ-NO.          EL512
02648      MOVE ZEROS                  TO WS-LAST-SEQ-NO.               EL512
02649                                                                   EL512
02650 ***** CHECK TO INSURE BATCH HAS NO SEVERE ERRORS *****            EL512
02651                                                                   EL512
02652      IF VALID-BATCH                                               EL512
02653          ADD +1                  TO WS-NO-BATCHES                 EL512
02654          IF COMPLETE-BATCH                                        EL512
02655              WRITE PENDING-BUSINESS                               EL512
02656          ELSE                                                     EL512
02657              MOVE SPACES         TO WS-DETAIL1                    EL512
02658              MOVE PB-ENTRY-BATCH TO P-BATCH-NO                    EL512
02659              MOVE ER-1034        TO P-ERROR-DESC                  EL512
02660              MOVE WS-DETAIL1     TO PRT                           EL512
02661              PERFORM WRITE-A-LINE.                                EL512
02662                                                                   EL512
02663      IF WS-LINE-COUNT GREATER +52                                 EL512
02664          ADD WS-LINE-COUNT-MAX   TO  WS-LINE-COUNT.               EL512
02665                                                                   EL512
02666      MOVE WS-HEADING7            TO  PRT.                         EL512
02667      PERFORM WRITE-A-LINE.                                        EL512
02668                                                                   EL512
02669      SET TOT-INDX                TO  +1.                          EL512
02670                                                                   EL512
02671  6010-CONT.                                                       EL512
02672      MOVE SPACES                 TO  WS-TOTAL-LINE1.              EL512
02673                                                                   EL512
02674      MOVE WS-TOTAL-DESC (TOT-INDX)                                EL512
02675                                  TO  WS-T1-DESC.                  EL512
02676      MOVE WS-TOTAL-ISS-CNT (TOT-INDX)                             EL512
02677                                  TO  WS-T1-ISSUE-COUNT.           EL512
02678      MOVE WS-TOTAL-CAN-CNT (TOT-INDX)                             EL512
02679                                  TO  WS-T1-CANCEL-COUNT.          EL512
02680      MOVE WS-TOTAL-LF-PREMIUM (TOT-INDX)                          EL512
02681                                  TO  WS-T1-LIFE-PREMIUM.          EL512
02682      MOVE WS-TOTAL-LF-REFUND (TOT-INDX)                           EL512
02683                                  TO  WS-T1-LIFE-REFUND.           EL512
02684      MOVE WS-TOTAL-AH-PREMIUM (TOT-INDX)                          EL512
02685                                  TO  WS-T1-AH-PREMIUM.            EL512
02686      MOVE WS-TOTAL-AH-REFUND (TOT-INDX)                           EL512
02687                                  TO  WS-T1-AH-REFUND.             EL512
02688                                                                   EL512
02689      IF TOT-INDX = +3                                             EL512
02690          IF BATCH-NOT-IN-BALANCE                                  EL512
02691              MOVE +0             TO  WS-BATCH-BALANCE-SW          EL512
02692              MOVE ER-1028        TO  WS-T1-ERROR-DESC.            EL512
02693                                                                   EL512
02694      MOVE WS-TOTAL-LINE1         TO  PRT.                         EL512
02695      PERFORM WRITE-A-LINE.                                        EL512
02696                                                                   EL512
02697      SET TOT-INDX UP BY +1.                                       EL512
02698                                                                   EL512
02699      IF TOT-INDX GREATER +3                                       EL512
02700          NEXT SENTENCE                                            EL512
02701      ELSE                                                         EL512
02702          GO TO 6010-CONT.                                         EL512
02703                                                                   EL512
02704      IF SR-ACCOUNT = WS-SAVE-ACCOUNT                              EL512
02705          NEXT SENTENCE                                            EL512
02706      ELSE                                                         EL512
02707          PERFORM 6100-ACCOUNT-TOTALS THRU 6100-EXIT.              EL512
02708                                                                   EL512
02709      IF CF-ST-ACCNT-CNTL                                          EL512
02710          IF SR-STATE = WS-SAVE-STATE                              EL512
02711              NEXT SENTENCE                                        EL512
02712          ELSE                                                     EL512
02713              PERFORM 6100-ACCOUNT-TOTALS THRU 6100-EXIT.          EL512
02714                                                                   EL512
02715      IF CF-CARR-ACCNT-CNTL                                        EL512
02716          IF SR-CARRIER  = WS-SAVE-CARRIER                         EL512
02717              NEXT SENTENCE                                        EL512
02718          ELSE                                                     EL512
02719              PERFORM 6100-ACCOUNT-TOTALS THRU 6100-EXIT.          EL512
02720                                                                   EL512
02721      IF CF-CARR-ST-ACCNT-CNTL                                     EL512
02722          IF SR-STATE    = WS-SAVE-STATE    AND                    EL512
02723             SR-CARRIER  = WS-SAVE-CARRIER                         EL512
02724              NEXT SENTENCE                                        EL512
02725          ELSE                                                     EL512
02726              PERFORM 6100-ACCOUNT-TOTALS THRU 6100-EXIT.          EL512
02727                                                                   EL512
02728      IF CF-CARR-GROUP-ST-ACCNT-CNTL                               EL512
02729          IF SR-STATE     = WS-SAVE-STATE   AND                    EL512
02730             SR-CARRIER   = WS-SAVE-CARRIER AND                    EL512
02731             SR-GROUPING  = WS-SAVE-GROUPING                       EL512
02732              NEXT SENTENCE                                        EL512
02733          ELSE                                                     EL512
02734              PERFORM 6100-ACCOUNT-TOTALS THRU 6100-EXIT.          EL512
02735                                                                   EL512
02736      IF LAST-BATCH                                                EL512
02737          GO TO 6000-EXIT.                                         EL512
02738                                                                   EL512
02739      SET TOT-INDX                TO +1.                           EL512
02740                                                                   EL512
02741  6020-ZERO-TOTALS.                                                EL512
02742      MOVE ZEROS                  TO WS-TOTAL-ISS-CNT    (TOT-INDX)EL512
02743                                     WS-TOTAL-CAN-CNT    (TOT-INDX)EL512
02744                                     WS-TOTAL-LF-PREMIUM (TOT-INDX)EL512
02745                                     WS-TOTAL-LF-REFUND  (TOT-INDX)EL512
02746                                     WS-TOTAL-AH-PREMIUM (TOT-INDX)EL512
02747                                     WS-TOTAL-AH-REFUND  (TOT-INDX)EL512
02748      SET TOT-INDX UP BY +1.                                       EL512
02749                                                                   EL512
02750      IF TOT-INDX GREATER +3                                       EL512
02751          SET TOT-INDX TO +1                                       EL512
02752      ELSE                                                         EL512
02753          GO TO 6020-ZERO-TOTALS.                                  EL512
02754                                                                   EL512
02755      IF FIRST-ACCOUNT                                             EL512
02756          PERFORM 6100-ACCOUNT-TOTALS THRU 6100-EXIT.              EL512
02757                                                                   EL512
02758      ADD  PBI-B-LF-PRM-WRITTEN   TO  WS-BT-CNTL-LF-PREMIUM        EL512
02759                                      WS-AT-CNTL-LF-PREMIUM        EL512
02760      ADD  PBI-B-LF-PRM-CANCELLED TO  WS-BT-CNTL-LF-REFUND         EL512
02761                                      WS-AT-CNTL-LF-REFUND         EL512
02762      ADD  PBI-B-AH-PRM-WRITTEN   TO  WS-BT-CNTL-AH-PREMIUM        EL512
02763                                      WS-AT-CNTL-AH-PREMIUM        EL512
02764      ADD  PBI-B-AH-PRM-CANCELLED TO  WS-BT-CNTL-AH-REFUND         EL512
02765                                      WS-AT-CNTL-AH-REFUND         EL512
02766      ADD  PBI-B-CERT-ISS-COUNT   TO  WS-BT-CNTL-ISS-CNT           EL512
02767                                      WS-AT-CNTL-ISS-CNT           EL512
02768      ADD  PBI-B-CERT-CAN-COUNT   TO  WS-BT-CNTL-CAN-CNT           EL512
02769                                      WS-AT-CNTL-CAN-CNT           EL512
02770                                                                   EL512
02771      ADD WS-LINE-COUNT-MAX       TO  WS-LINE-COUNT.               EL512
02772                                                                   EL512
02773  6000-EXIT.                                                       EL512
02774      EXIT.                                                        EL512
02775      EJECT                                                        EL512
02776                                                                   EL512
02777  6100-ACCOUNT-TOTALS SECTION.                                     EL512
02778      IF FIRST-ACCOUNT                                             EL512
02779          ADD +1                  TO  WS-FIRST-ACCOUNT-SW          EL512
02780          SET TOT-INDX            TO  +4                           EL512
02781          GO TO 6120-ZERO-TOTALS.                                  EL512
02782                                                                   EL512
02783      SUBTRACT   WS-AT-CNTL-ISS-CNT    FROM WS-AT-ENTR-ISS-CNT     EL512
02784          GIVING WS-AT-DIFF-ISS-CNT.                               EL512
02785      SUBTRACT   WS-AT-CNTL-CAN-CNT    FROM WS-AT-ENTR-CAN-CNT     EL512
02786          GIVING WS-AT-DIFF-CAN-CNT.                               EL512
02787      SUBTRACT   WS-AT-CNTL-LF-PREMIUM FROM WS-AT-ENTR-LF-PREMIUM  EL512
02788          GIVING WS-AT-DIFF-LF-PREMIUM.                            EL512
02789      SUBTRACT   WS-AT-CNTL-AH-PREMIUM FROM WS-AT-ENTR-AH-PREMIUM  EL512
02790          GIVING WS-AT-DIFF-AH-PREMIUM.                            EL512
02791      SUBTRACT   WS-AT-CNTL-AH-REFUND  FROM WS-AT-ENTR-AH-REFUND   EL512
02792          GIVING WS-AT-DIFF-AH-REFUND.                             EL512
02793      SUBTRACT   WS-AT-CNTL-LF-REFUND  FROM WS-AT-ENTR-LF-REFUND   EL512
02794          GIVING WS-AT-DIFF-LF-REFUND.                             EL512
02795                                                                   EL512
02796      IF WS-AT-DIFF-ISS-CNT    NOT = ZERO OR                       EL512
02797         WS-AT-DIFF-CAN-CNT    NOT = ZERO OR                       EL512
02798         WS-AT-DIFF-LF-PREMIUM NOT = ZERO OR                       EL512
02799         WS-AT-DIFF-LF-REFUND  NOT = ZERO OR                       EL512
02800         WS-AT-DIFF-AH-PREMIUM NOT = ZERO OR                       EL512
02801         WS-AT-DIFF-AH-REFUND  NOT = ZERO                          EL512
02802             MOVE +1              TO  WS-ACCOUNT-BALANCE-SW.       EL512
02803                                                                   EL512
02804      IF WS-LINE-COUNT GREATER +52                                 EL512
02805          ADD WS-LINE-COUNT-MAX   TO  WS-LINE-COUNT.               EL512
02806                                                                   EL512
02807      IF ONLY-ONE-BATCH-IN-ACCOUNT                                 EL512
02808          NEXT SENTENCE                                            EL512
02809      ELSE                                                         EL512
02810          MOVE WS-HEADING8        TO  PRT                          EL512
02811          PERFORM WRITE-A-LINE.                                    EL512
02812                                                                   EL512
02813      SET TOT-INDX                TO  +4.                          EL512
02814      SET TOT-INDX1               TO  +7.                          EL512
02815      SET TOT-INDX2               TO  +10.                         EL512
02816                                                                   EL512
02817  6110-CONT.                                                       EL512
02818      MOVE SPACES                 TO  WS-TOTAL-LINE1.              EL512
02819                                                                   EL512
02820      MOVE WS-TOTAL-DESC (TOT-INDX)                                EL512
02821                                  TO  WS-T1-DESC.                  EL512
02822      MOVE WS-TOTAL-ISS-CNT (TOT-INDX)                             EL512
02823                                  TO  WS-T1-ISSUE-COUNT.           EL512
02824      MOVE WS-TOTAL-CAN-CNT (TOT-INDX)                             EL512
02825                                  TO  WS-T1-CANCEL-COUNT.          EL512
02826      MOVE WS-TOTAL-LF-PREMIUM (TOT-INDX)                          EL512
02827                                  TO  WS-T1-LIFE-PREMIUM.          EL512
02828      MOVE WS-TOTAL-LF-REFUND (TOT-INDX)                           EL512
02829                                  TO  WS-T1-LIFE-REFUND.           EL512
02830      MOVE WS-TOTAL-AH-PREMIUM (TOT-INDX)                          EL512
02831                                  TO  WS-T1-AH-PREMIUM.            EL512
02832      MOVE WS-TOTAL-AH-REFUND (TOT-INDX)                           EL512
02833                                  TO  WS-T1-AH-REFUND.             EL512
02834                                                                   EL512
02835      IF PREVIOUS-ACCOUNT-INVALID                                  EL512
02836          ADD  WS-TOTAL-ISS-CNT (TOT-INDX)                         EL512
02837                                TO  WS-TOTAL-ISS-CNT (TOT-INDX1)   EL512
02838          ADD  WS-TOTAL-CAN-CNT (TOT-INDX)                         EL512
02839                                TO  WS-TOTAL-CAN-CNT (TOT-INDX1)   EL512
02840          ADD  WS-TOTAL-LF-PREMIUM (TOT-INDX)                      EL512
02841                                TO  WS-TOTAL-LF-PREMIUM (TOT-INDX1)EL512
02842          ADD  WS-TOTAL-LF-REFUND (TOT-INDX)                       EL512
02843                                TO  WS-TOTAL-LF-REFUND (TOT-INDX1) EL512
02844          ADD  WS-TOTAL-AH-PREMIUM (TOT-INDX)                      EL512
02845                                TO  WS-TOTAL-AH-PREMIUM (TOT-INDX1)EL512
02846          ADD  WS-TOTAL-AH-REFUND (TOT-INDX)                       EL512
02847                                TO  WS-TOTAL-AH-REFUND (TOT-INDX1) EL512
02848      ELSE                                                         EL512
02849          ADD  WS-TOTAL-ISS-CNT (TOT-INDX)                         EL512
02850                                TO  WS-TOTAL-ISS-CNT (TOT-INDX2)   EL512
02851          ADD  WS-TOTAL-CAN-CNT (TOT-INDX)                         EL512
02852                                TO  WS-TOTAL-CAN-CNT (TOT-INDX2)   EL512
02853          ADD  WS-TOTAL-LF-PREMIUM (TOT-INDX)                      EL512
02854                                TO  WS-TOTAL-LF-PREMIUM (TOT-INDX2)EL512
02855          ADD  WS-TOTAL-LF-REFUND (TOT-INDX)                       EL512
02856                                TO  WS-TOTAL-LF-REFUND (TOT-INDX2) EL512
02857          ADD  WS-TOTAL-AH-PREMIUM (TOT-INDX)                      EL512
02858                                TO  WS-TOTAL-AH-PREMIUM (TOT-INDX2)EL512
02859          ADD  WS-TOTAL-AH-REFUND (TOT-INDX)                       EL512
02860                                TO  WS-TOTAL-AH-REFUND (TOT-INDX2).EL512
02861                                                                   EL512
02862  6115-CONT.                                                       EL512
02863      IF TOT-INDX = TOT-INDX-MAX                                   EL512
02864          IF ACCOUNT-NOT-IN-BALANCE                                EL512
02865              MOVE +0             TO  WS-ACCOUNT-BALANCE-SW        EL512
02866              MOVE ER-1030        TO  WS-T1-ERROR-DESC.            EL512
02867                                                                   EL512
02868      IF ONLY-ONE-BATCH-IN-ACCOUNT                                 EL512
02869          NEXT SENTENCE                                            EL512
02870      ELSE                                                         EL512
02871          MOVE WS-TOTAL-LINE1     TO  PRT                          EL512
02872          PERFORM WRITE-A-LINE.                                    EL512
02873                                                                   EL512
02874      SET TOT-INDX                                                 EL512
02875          TOT-INDX1                                                EL512
02876          TOT-INDX2 UP BY +1.                                      EL512
02877                                                                   EL512
02878      IF TOT-INDX GREATER TOT-INDX-MAX                             EL512
02879          SET TOT-INDX TO +4                                       EL512
02880      ELSE                                                         EL512
02881          GO TO 6110-CONT.                                         EL512
02882                                                                   EL512
02883      IF LAST-ACCOUNT                                              EL512
02884          GO TO 6100-EXIT.                                         EL512
02885                                                                   EL512
02886  6120-ZERO-TOTALS.                                                EL512
02887      MOVE ZEROS                  TO WS-TOTAL-ISS-CNT (TOT-INDX)   EL512
02888                                     WS-TOTAL-CAN-CNT (TOT-INDX)   EL512
02889                                     WS-TOTAL-LF-PREMIUM (TOT-INDX)EL512
02890                                     WS-TOTAL-LF-REFUND (TOT-INDX) EL512
02891                                     WS-TOTAL-AH-PREMIUM (TOT-INDX)EL512
02892                                     WS-TOTAL-AH-REFUND (TOT-INDX).EL512
02893      SET TOT-INDX UP BY +1.                                       EL512
02894                                                                   EL512
02895      IF TOT-INDX GREATER TOT-INDX-MAX                             EL512
02896          NEXT SENTENCE                                            EL512
02897      ELSE                                                         EL512
02898          GO TO 6120-ZERO-TOTALS.                                  EL512
02899                                                                   EL512
02900      MOVE SPACES                 TO  WS-DETAIL1.                  EL512
02901                                                                   EL512
02902      MOVE +0                     TO  WS-NO-BATCHES.               EL512
02903      MOVE SR-CARRIER             TO  WS-SAVE-CARRIER.             EL512
02904      MOVE SR-GROUPING            TO  WS-SAVE-GROUPING.            EL512
02905      MOVE SR-STATE               TO  WS-SAVE-STATE.               EL512
02906      MOVE SR-ACCOUNT-NAME        TO  H4-ACCOUNT-NAME.             EL512
02907      MOVE SR-ACCOUNT             TO  WS-SAVE-ACCOUNT              EL512
02908                                      H4-ACCOUNT.                  EL512
02909      IF CF-ST-ACCNT-CNTL                                          EL512
02910          MOVE SR-STATE           TO  H4-STATE.                    EL512
02911                                                                   EL512
02912      IF CF-CARR-ACCNT-CNTL                                        EL512
02913          MOVE SR-CARRIER         TO  H4-CARRIER.                  EL512
02914                                                                   EL512
02915      IF CF-CARR-ST-ACCNT-CNTL                                     EL512
02916          MOVE SR-CARRIER         TO  H4-CARRIER                   EL512
02917          MOVE SR-STATE           TO  H4-STATE.                    EL512
02918                                                                   EL512
02919      IF CF-CARR-GROUP-ST-ACCNT-CNTL                               EL512
02920          MOVE SR-CARRIER         TO  H4-CARRIER                   EL512
02921          MOVE SR-STATE           TO  H4-STATE                     EL512
02922          MOVE SR-GROUPING        TO  H4-GROUPING.                 EL512
02923                                                                   EL512
02924      IF CURRENT-ACCOUNT-VALID                                     EL512
02925          MOVE LOW-VALUES         TO  WS-INVALID-ACCOUNT-SW.       EL512
02926                                                                   EL512
02927  6100-EXIT.                                                       EL512
02928      EXIT.                                                        EL512
02929      EJECT                                                        EL512
02930                                                                   EL512
02931  6200-GET-BATCH-NO SECTION.                                       EL512
02932      PERFORM 7000-READ-CONTROL-FILE THRU 7000-EXIT.               EL512
02933                                                                   EL512
112712     MOVE CF-LAST-BATCH-NO       TO  WS-BATCH-NO-n                EL512
02935      ADD +1                      TO  CF-LAST-BATCH-NO             EL512
110712                                     WS-BATCH-NO-N.               EL512
02937                                                                   EL512
02938      REWRITE CONTROL-FILE.                                        EL512
02939                                                                   EL512
02940      IF ELCNTL-FILE-STATUS NOT = ZEROS                            EL512
02941          DISPLAY '*** EL512 ELCNTL INVALID REWRITE'               EL512
02942          DISPLAY '*** EL512 ELCNTL INVALID REWRITE'               EL512
02943          DISPLAY '*** EL512 ELCNTL INVALID REWRITE'               EL512
02944          DISPLAY '*** EL512 ELCNTL INVALID REWRITE'               EL512
02945          MOVE ELCNTL-FILE-STATUS TO  WS-ABEND-FILE-STATUS         EL512
02946          GO TO ABEND-PGM.                                         EL512
02947                                                                   EL512
02948  6200-EXIT.                                                       EL512
02949      EXIT.                                                        EL512
02950      EJECT                                                        EL512
02951                                                                   EL512
02952  6300-PROCESS-ACCOUNT SECTION.                                    EL512
02953 ******************************************************************EL512
02954 ***** READ CONTROL FILE TO GET REQUIRED FIELDS FOR ACCOUNT *******EL512
02955 ***** MASTER VERIFICATION                                  *******EL512
02956 ******************************************************************EL512
02957                                                                   EL512
02958      PERFORM 7000-READ-CONTROL-FILE THRU 7000-EXIT.               EL512
02959                                                                   EL512
02960      IF NOT CF-COMPANY-MASTER                                     EL512
02961          DISPLAY '*** EL512 ELCNTL COMPANY MASTER MISSING'        EL512
02962          DISPLAY '*** EL512 FOR COMPANY - ' CF-COMPANY-ID         EL512
02963          MOVE ELCNTL-FILE-STATUS TO WS-ABEND-FILE-STATUS          EL512
02964          GO TO ABEND-PGM.                                         EL512
02965                                                                   EL512
02966 ***************************************************************** EL512
02967 *  REWRITE IS EXECUTED TO RELEASE CONTROL OF CONTROL FILE DURING* EL512
02968 *  PROCESSING SINCE FILE IS OPENED I-O                          * EL512
02969 ***************************************************************** EL512
02970                                                                   EL512
02971      REWRITE CONTROL-FILE.                                        EL512
02972                                                                   EL512
02973      IF ELCNTL-FILE-STATUS NOT = ZEROS                            EL512
02974          DISPLAY '*** EL512 ELCNTL INVALID REWRITE'               EL512
02975          MOVE ELCNTL-FILE-STATUS TO  WS-ABEND-FILE-STATUS         EL512
02976          GO TO ABEND-PGM.                                         EL512
02977                                                                   EL512
02978      MOVE CF-CR-MONTH-END-DT     TO  WS-MONTH-END-DATE.           EL512
02979                                                                   EL512
02980      MOVE SPACES                 TO  AM-CONTROL-BY-VAR-GRP.       EL512
02981      MOVE CF-COMPANY-CD          TO  AM-COMPANY-CD-A1.            EL512
02982      MOVE PBI-ACCOUNT            TO  AM-VG-ACCOUNT.               EL512
02983                                                                   EL512
02984      IF CF-ST-ACCNT-CNTL                                          EL512
02985          MOVE PBI-STATE          TO  AM-VG-STATE.                 EL512
02986                                                                   EL512
02987      IF CF-CARR-ACCNT-CNTL                                        EL512
02988          MOVE PBI-CARRIER        TO  AM-VG-CARRIER.               EL512
02989                                                                   EL512
02990      IF CF-CARR-ST-ACCNT-CNTL                                     EL512
02991          MOVE PBI-CARRIER        TO  AM-VG-CARRIER                EL512
02992          MOVE PBI-STATE          TO  AM-VG-STATE.                 EL512
02993                                                                   EL512
02994      IF CF-CARR-GROUP-ST-ACCNT-CNTL                               EL512
02995          MOVE PBI-CARRIER        TO  AM-VG-CARRIER                EL512
02996          MOVE PBI-GROUPING       TO  AM-VG-GROUPING               EL512
02997          MOVE PBI-STATE          TO  AM-VG-STATE.                 EL512
02998                                                                   EL512
02999      START ERACCT                                                 EL512
03000          KEY IS GREATER THAN AM-CONTROL-BY-VAR-GRP.               EL512
03001                                                                   EL512
03002      IF ERACCT-FILE-STATUS = '23'                                 EL512
03003          GO TO 6310-INVALID-ACCOUNT.                              EL512
03004                                                                   EL512
03005      IF ERACCT-FILE-STATUS NOT = ZERO                             EL512
03006          DISPLAY '*** EL512 ERACCT INVALID START'                 EL512
03007          MOVE ERACCT-FILE-STATUS TO  WS-ABEND-FILE-STATUS         EL512
03008          GO TO ABEND-PGM.                                         EL512
03009                                                                   EL512
03010      READ ERACCT NEXT RECORD.                                     EL512
03011                                                                   EL512
03012      COPY ELCACCTI.                                               EL512
03013                                                                   EL512
03014      IF ERACCT-FILE-STATUS NOT = ZERO                             EL512
03015          DISPLAY '*** EL512 ERACCT INVALID READ NEXT'             EL512
03016          MOVE ERACCT-FILE-STATUS TO  WS-ABEND-FILE-STATUS         EL512
03017          GO TO ABEND-PGM.                                         EL512
03018                                                                   EL512
03019      IF CF-ACCNT-CNTL                                             EL512
03020          IF PBI-ACCOUNT = AM-VG-ACCOUNT                           EL512
03021              GO TO 6320-VALID-ACCOUNT                             EL512
03022          ELSE                                                     EL512
03023              GO TO 6310-INVALID-ACCOUNT.                          EL512
03024                                                                   EL512
03025      IF CF-ST-ACCNT-CNTL                                          EL512
03026          IF PBI-ACCOUNT = AM-VG-ACCOUNT AND                       EL512
03027             PBI-STATE   = AM-VG-STATE                             EL512
03028              GO TO 6320-VALID-ACCOUNT                             EL512
03029          ELSE                                                     EL512
03030              GO TO 6310-INVALID-ACCOUNT.                          EL512
03031                                                                   EL512
03032      IF CF-CARR-ACCNT-CNTL                                        EL512
03033          IF PBI-ACCOUNT = AM-VG-ACCOUNT AND                       EL512
03034             PBI-CARRIER = AM-VG-CARRIER                           EL512
03035              GO TO 6320-VALID-ACCOUNT                             EL512
03036          ELSE                                                     EL512
03037              GO TO 6310-INVALID-ACCOUNT.                          EL512
03038                                                                   EL512
03039      IF CF-CARR-ST-ACCNT-CNTL                                     EL512
03040          IF PBI-ACCOUNT  = AM-VG-ACCOUNT AND                      EL512
03041             PBI-STATE    = AM-VG-STATE   AND                      EL512
03042             PBI-CARRIER  = AM-VG-CARRIER                          EL512
03043              GO TO 6320-VALID-ACCOUNT                             EL512
03044          ELSE                                                     EL512
03045              GO TO 6310-INVALID-ACCOUNT.                          EL512
03046                                                                   EL512
03047      IF CF-CARR-GROUP-ST-ACCNT-CNTL                               EL512
03048          IF PBI-ACCOUNT  = AM-VG-ACCOUNT AND                      EL512
03049             PBI-STATE    = AM-VG-STATE   AND                      EL512
03050             PBI-CARRIER  = AM-VG-CARRIER AND                      EL512
03051             PBI-GROUPING = AM-VG-GROUPING                         EL512
03052              GO TO 6320-VALID-ACCOUNT.                            EL512
03053                                                                   EL512
03054  6310-INVALID-ACCOUNT.                                            EL512
03055      IF DTE-CLIENT EQUAL 'HAN'                                    EL512
03056          MOVE '1'                TO PBI-CARRIER                   EL512
03057          MOVE '999999'           TO PBI-GROUPING                  EL512
03058          MOVE '99'               TO PBI-STATE                     EL512
03059          MOVE '000NOMATCH'       TO PBI-ACCOUNT.                  EL512
03060                                                                   EL512
03061      MOVE '**INVALID ACCOUNT**'  TO  SR-ACCOUNT-NAME.             EL512
03062      MOVE '0'                    TO  WS-SR-VALID-ACCOUNT-SW.      EL512
03063      MOVE PBI-CARRIER            TO  WS-SR-CARRIER.               EL512
03064      MOVE PBI-GROUPING           TO  WS-SR-GROUPING.              EL512
03065      MOVE PBI-STATE              TO  WS-SR-STATE.                 EL512
03066      MOVE PBI-ACCOUNT            TO  WS-SR-ACCOUNT                EL512
03067                                      WS-SAVE-ACCOUNT.             EL512
03068      GO TO 6300-EXIT.                                             EL512
03069                                                                   EL512
03070  6320-VALID-ACCOUNT.                                              EL512
03071      MOVE '1'                    TO  WS-SR-VALID-ACCOUNT-SW.      EL512
03072      MOVE AM-NAME                TO  SR-ACCOUNT-NAME.             EL512
03073      MOVE AM-CARRIER             TO  WS-SR-CARRIER.               EL512
03074      MOVE AM-GROUPING            TO  WS-SR-GROUPING.              EL512
03075      MOVE AM-STATE               TO  WS-SR-STATE.                 EL512
03076      MOVE AM-ACCOUNT             TO  WS-SR-ACCOUNT                EL512
03077                                      WS-SAVE-ACCOUNT.             EL512
03078                                                                   EL512
03079  6300-EXIT.                                                       EL512
03080      EXIT.                                                        EL512
03081      EJECT                                                        EL512
03082                                                                   EL512
03083  6400-FINAL-TOTALS SECTION.                                       EL512
03084      MOVE SPACES                 TO H4-CARRIER                    EL512
03085                                     H4-GROUPING                   EL512
03086                                     H4-STATE                      EL512
03087                                     H4-ACCOUNT                    EL512
03088                                     H4-ACCOUNT-NAME.              EL512
03089                                                                   EL512
03090      COMPUTE WS-FT-NET-ISS-CNT = WS-FT-ISS-CNT           +        EL512
03091                                  WS-FT-INVL-ISS-CNT      +        EL512
03092                                  WS-FT-LTYPE-ISS-CNT     +        EL512
03093                                  WS-FT-INVL-CERT-ISS-CNT +        EL512
03094                                  WS-FT-INVL-LTYPE-ISS-CNT.        EL512
03095                                                                   EL512
03096      COMPUTE WS-FT-NET-CAN-CNT = WS-FT-CAN-CNT           +        EL512
03097                                  WS-FT-INVL-CAN-CNT      +        EL512
03098                                  WS-FT-INVL-CERT-CAN-CNT.         EL512
03099                                                                   EL512
03100      COMPUTE WS-FT-ISS-CAN-CNT = WS-FT-NET-ISS-CNT  +             EL512
03101                                  WS-FT-NET-CAN-CNT  +             EL512
03102                                  WS-FT-INVL-TRAN-CNT.             EL512
03103                                                                   EL512
03104      COMPUTE WS-FT-TOTAL-CNT   = WS-FT-ISS-CAN-CNT  +             EL512
03105                                  WS-FT-REMIT-CNT.                 EL512
03106                                                                   EL512
03107      ADD WS-LINE-COUNT-MAX       TO  WS-LINE-COUNT.               EL512
03108      MOVE WS-HEADING9            TO  PRT.                         EL512
03109      PERFORM WRITE-A-LINE.                                        EL512
03110                                                                   EL512
03111      SET TOT-INDX2               TO  +7.                          EL512
03112                                                                   EL512
03113  6410-CONT.                                                       EL512
03114      MOVE SPACES                 TO  WS-TOTAL-LINE1.              EL512
03115                                                                   EL512
03116      IF TOT-INDX2 = +7 OR +10                                     EL512
03117          MOVE '0'                TO  WS-T1-CTL.                   EL512
03118                                                                   EL512
03119      MOVE WS-TOTAL-DESC (TOT-INDX2)                               EL512
03120                                  TO  WS-T1-DESC.                  EL512
03121      MOVE WS-TOTAL-ISS-CNT (TOT-INDX2)                            EL512
03122                                  TO  WS-T1-ISSUE-COUNT.           EL512
03123      MOVE WS-TOTAL-CAN-CNT (TOT-INDX2)                            EL512
03124                                  TO  WS-T1-CANCEL-COUNT.          EL512
03125      MOVE WS-TOTAL-LF-PREMIUM (TOT-INDX2)                         EL512
03126                                  TO  WS-T1-LIFE-PREMIUM.          EL512
03127      MOVE WS-TOTAL-LF-REFUND (TOT-INDX2)                          EL512
03128                                  TO  WS-T1-LIFE-REFUND.           EL512
03129      MOVE WS-TOTAL-AH-PREMIUM (TOT-INDX2)                         EL512
03130                                  TO  WS-T1-AH-PREMIUM.            EL512
03131      MOVE WS-TOTAL-AH-REFUND (TOT-INDX2)                          EL512
03132                                  TO  WS-T1-AH-REFUND.             EL512
03133      MOVE WS-TOTAL-LINE1         TO  PRT.                         EL512
03134      PERFORM WRITE-A-LINE.                                        EL512
03135                                                                   EL512
03136      SET TOT-INDX2 UP BY +1.                                      EL512
03137                                                                   EL512
03138      IF TOT-INDX2 GREATER TOT-INDX2-MAX                           EL512
03139          NEXT SENTENCE                                            EL512
03140      ELSE                                                         EL512
03141          GO TO 6410-CONT.                                         EL512
03142                                                                   EL512
03143      MOVE SPACES                 TO  WS-TOTAL-LINE1               EL512
03144      MOVE '-'                    TO  WS-T1-CTL.                   EL512
03145      MOVE WS-TOTAL-LINE1         TO  PRT.                         EL512
03146      PERFORM WRITE-A-LINE.                                        EL512
03147                                                                   EL512
03148      SET FINAL-INDX              TO  +1.                          EL512
03149                                                                   EL512
03150  6420-CONT.                                                       EL512
03151      MOVE SPACES                 TO  WS-TOTAL-LINE1.              EL512
03152                                                                   EL512
03153      MOVE WS-FINAL-DESC (FINAL-INDX)                              EL512
03154                                  TO  WS-T2-DESC.                  EL512
03155      MOVE WS-FINAL-COUNT (FINAL-INDX)                             EL512
03156                                  TO  WS-T2-COUNT.                 EL512
03157      MOVE WS-TOTAL-LINE1         TO  PRT.                         EL512
03158      PERFORM WRITE-A-LINE.                                        EL512
03159                                                                   EL512
03160      SET FINAL-INDX UP BY +1.                                     EL512
03161                                                                   EL512
03162      IF FINAL-INDX GREATER FINAL-INDX-MAX                         EL512
03163          NEXT SENTENCE                                            EL512
03164      ELSE                                                         EL512
03165          GO TO 6420-CONT.                                         EL512
03166                                                                   EL512
03167  6400-EXIT.                                                       EL512
03168      EXIT.                                                        EL512
03169      EJECT                                                        EL512
03170                                                                   EL512
03171  7000-READ-CONTROL-FILE SECTION.                                  EL512
03172      MOVE LOW-VALUES             TO  CF-CONTROL-PRIMARY.          EL512
03173      MOVE DTE-CLIENT             TO  CF-COMPANY-ID                EL512
03174                                      WS-PROCESSOR-ID.             EL512
03175      MOVE '1'                    TO  CF-RECORD-TYPE.              EL512
03176      MOVE SPACES                 TO  CF-ACCESS-CD-GENL.           EL512
03177      MOVE ZEROS                  TO  CF-SEQUENCE-NO.              EL512
03178                                                                   EL512
03179      READ ELCNTL.                                                 EL512
03180                                                                   EL512
03181      IF ELCNTL-FILE-STATUS NOT = ZEROS                            EL512
03182          DISPLAY '*** EL512 ELCNTL INVALID READ'                  EL512
03183          MOVE ELCNTL-FILE-STATUS TO  WS-ABEND-FILE-STATUS         EL512
03184          GO TO ABEND-PGM.                                         EL512
03185                                                                   EL512
03186  7000-EXIT.                                                       EL512
03187      EXIT.                                                        EL512
03188      EJECT                                                        EL512
03189                                                                   EL512
03190  8500-DATE-CONVERSION SECTION.                                    EL512
03191  8510-DATE-CONVERSION.                                            EL512
03192      CALL 'ELDATCX' USING DATE-CONVERSION-DATA.                   EL512
03193                                                                   EL512
03194  8590-EXIT.                                                       EL512
03195      EXIT.                                                        EL512
03196                                                                   EL512
03197  GET-DATE SECTION.                                                EL512
03198                                                                   EL512
03199  GDS-010.                                                         EL512
03200      MOVE WS-CURRENT-DATE        TO  DC-GREG-DATE-1-EDIT.         EL512
03201      MOVE '2'                    TO  DC-OPTION-CODE.              EL512
03202      PERFORM 8500-DATE-CONVERSION.                                EL512
03203      MOVE DC-BIN-DATE-1          TO  WS-SAVE-DATE.                EL512
03204      MOVE DC-GREG-DATE-1-YMD     TO  WS-CURRENT-DT.                  CL**7
03205      MOVE DC-ALPHA-CENTURY       TO  WS-CURRENT-CC.               EL512
03206                                                                   EL512
03207      MOVE WS-TIME                TO  WS-SAVE-TIME.                EL512
03208                                                                   EL512
03209  GDS-EXIT.                                                        EL512
03210      EXIT.                                                        EL512
03211                                                                   EL512
03212  ERROR-ROUTINE  SECTION.                                          EL512
03213                                                                   EL512
03214  ERS-000.                                                         EL512
03215      ADD +1                      TO  WS-ERROR-CNT.                EL512
03216                                                                   EL512
03217      MOVE WS-DETAIL1A            TO  WS-SAVE-DETAIL1A.            EL512
03218                                                                   EL512
03219      IF MULTIPLE-ERRORS                                           EL512
03220          MOVE SPACES             TO  WS-DETAIL1A.                 EL512
03221                                                                   EL512
03222      IF WS-LINE-COUNT GREATER WS-LINE-COUNT-MAX                   EL512
03223          MOVE WS-SAVE-DETAIL1A   TO  WS-DETAIL1A                  EL512
03224          MOVE WS-BATCH-NO        TO  P-BATCH-NO.                  EL512
03225                                                                   EL512
03226      MOVE WS-DETAIL1             TO  PRT.                         EL512
CIDMOD     MOVE ' '                    TO  P-CTL.                          CL**2
03227                                                                   EL512
03228      PERFORM WRITE-A-LINE.                                        EL512
03229                                                                   EL512
03230  ERS-EXIT.                                                        EL512
03231      EXIT.                                                        EL512
03232                                                                   EL512
03233  WRITE-A-LINE SECTION.                                            EL512
03234      IF WS-LINE-COUNT GREATER THAN WS-LINE-COUNT-MAX              EL512
03235          PERFORM WRITE-HEADINGS.                                  EL512
03236                                                                   EL512
03237      IF P-CTL = '1'                                                  CL**2
03238          MOVE +1  TO  WS-LINE-COUNT                               EL512
03239        ELSE                                                       EL512
03240          IF P-CTL = SPACE                                            CL**2
03241              ADD +1  TO  WS-LINE-COUNT                            EL512
03242            ELSE                                                   EL512
03243              IF P-CTL = ZERO                                         CL**2
03244                  ADD +2  TO  WS-LINE-COUNT                        EL512
03245                ELSE                                               EL512
03246                  ADD +3  TO  WS-LINE-COUNT.                       EL512
03247                                                                   EL512
03248      PERFORM WRITE-PRINTER.                                       EL512
03249                                                                   EL512
03250  WAL-EXIT.                                                        EL512
03251      EXIT.                                                        EL512
03252                                                                   EL512
03253  WRITE-HEADINGS SECTION.                                          EL512
03254                                                                   EL512
03255      IF WS-FIRST-TIME-SW = 'Y'                                    EL512
03256          MOVE 'N'                TO  WS-FIRST-TIME-SW             EL512
03257          MOVE WS-CURRENT-DATE    TO  WS-H2-DATE                   EL512
03258          MOVE COMPANY-NAME       TO  WS-H2-CLIENT-NAME            EL512
03259          MOVE ALPH-DATE          TO  WS-H3-DATE                   EL512
03260          MOVE LIFE-OVERRIDE-L6   TO  H5-L1                        EL512
03261          MOVE LIFE-OVERRIDE-L6   TO  H5-L2                        EL512
03262          MOVE AH-OVERRIDE-L6     TO  H5-A1                        EL512
03263          MOVE AH-OVERRIDE-L6     TO  H5-A2.                       EL512
03264                                                                   EL512
03265      ADD +1  TO  WS-PAGE.                                         EL512
03266      MOVE WS-PAGE                TO  WS-H3-PAGE.                  EL512
03267                                                                   EL512
03268      MOVE PRT                    TO  WS-SAVE-PRINT-RECORD.        EL512
03269                                                                   EL512
03270      MOVE ZERO                   TO  WS-LINE-COUNT.               EL512
03271                                                                   EL512
03272      MOVE WS-HEADING1            TO  PRT.                         EL512
03273      PERFORM WRITE-PRINTER.                                       EL512
03274                                                                   EL512
03275      MOVE WS-HEADING2            TO  PRT.                         EL512
CIDMOD     MOVE ' '                    TO  P-CTL.                          CL**2
03276      PERFORM WRITE-PRINTER.                                       EL512
03277                                                                   EL512
03278      MOVE WS-HEADING3            TO  PRT.                         EL512
CIDMOD     MOVE ' '                    TO  P-CTL.                          CL**2
03279      PERFORM WRITE-PRINTER.                                       EL512
03280                                                                   EL512
03281      MOVE WS-HEADING4            TO  PRT.                         EL512
03282      PERFORM WRITE-PRINTER.                                       EL512
03283                                                                   EL512
03284      MOVE WS-HEADING5            TO  PRT.                         EL512
CIDMOD     MOVE ' '                    TO  P-CTL.                          CL**2
03285      PERFORM WRITE-PRINTER.                                       EL512
03286                                                                   EL512
03287      MOVE WS-HEADING6            TO  PRT.                         EL512
CIDMOD     MOVE ' '                    TO  P-CTL.                          CL**2
03288      PERFORM WRITE-PRINTER.                                       EL512
03289                                                                   EL512
03290      MOVE +8                     TO  WS-LINE-COUNT.               EL512
03291                                                                   EL512
03292  WHS-020.                                                         EL512
03293      MOVE WS-SAVE-PRINT-RECORD   TO  PRT.                         EL512
03294 **   MOVE '1'                    TO  P-CTL.                          CL**2
CIDMOD     MOVE '-'                    TO  P-CTL.                          CL**2
03295                                                                   EL512
03296  WHS-EXIT.                                                        EL512
03297      EXIT.                                                        EL512
03298                                                                   EL512
03299  WRITE-PRINTER SECTION.                                           EL512
03300  WPS-010.                                                         EL512
03301      MOVE P-CTL                  TO  X.                           EL512
03302                                                                   EL512
03303  WPS-020. COPY ELCPRT2X.                                          EL512
03304                                                                   EL512
03305      EJECT                                                        EL512
03306  OPEN-FILES SECTION.                                              EL512
03307                                                                   EL512
03308  OFS-010.                                                         EL512
03309      OPEN INPUT CARDS-IN                                          EL512
03310                 ERACCT                                            EL512
03311           I-O   ELCNTL                                            EL512
03312           OUTPUT PRNTR.                                           EL512
03313                                                                   EL512
03314      IF SYS006-FILE-STATUS NOT = ZEROS                            EL512
03315         DISPLAY 'EL512  SYS006 EMPTY'                             EL512
03316         MOVE '-  ***** EL512 SYS006 EMPTY *****' TO PRT           EL512
03317         PERFORM WRITE-A-LINE                                      EL512
03318         MOVE '-  ***** EL512 SYS006 EMPTY *****' TO PRT           EL512
03319         PERFORM WRITE-A-LINE                                      EL512
03320         GOBACK.                                                   EL512
03321                                                                   EL512
03322      IF TAPE-BATCHES NOT = ZERO                                   EL512
03323          OPEN INPUT PENDING-IN                                    EL512
03324          IF SYS010-FILE-STATUS NOT = ZEROS                        EL512
pemuni            display ' open error ' sys010-file-status
03325             DISPLAY 'EL512  SYS010 EMPTY'                         EL512
03326             MOVE '-  ***** EL512 SYS010 EMPTY *****' TO PRT       EL512
03327             PERFORM WRITE-A-LINE                                  EL512
03328             MOVE '-  ***** EL512 SYS010 EMPTY *****' TO PRT       EL512
03329             PERFORM WRITE-A-LINE                                  EL512
03330             GOBACK.                                               EL512
03331                                                                   EL512
03332      IF ERACCT-FILE-STATUS  = '00' OR '97'                        EL512
03333          NEXT SENTENCE                                            EL512
03334        ELSE                                                       EL512
03335          DISPLAY '*** EL512  ERACCT OPEN ERROR - JOB WILL ABEND'  EL512
03336          MOVE ERACCT-FILE-STATUS TO WS-ABEND-FILE-STATUS          EL512
03337          GO TO ABEND-PGM.                                         EL512
03338                                                                   EL512
03339      IF ELCNTL-FILE-STATUS  = '00' OR '97'                        EL512
03340          NEXT SENTENCE                                            EL512
03341        ELSE                                                       EL512
03342          DISPLAY '*** EL512  ELCNTL OPEN ERROR - JOB WILL ABEND'  EL512
03343          MOVE ELCNTL-FILE-STATUS TO WS-ABEND-FILE-STATUS          EL512
03344          GO TO ABEND-PGM.                                         EL512
03345                                                                   EL512
03346  OFS-EXIT.                                                        EL512
03347      EXIT.                                                        EL512
03348                                                                   EL512
03349      EJECT                                                        EL512
03350  CLOSE-FILES SECTION.                                             EL512
03351                                                                   EL512
03352  CFS-010.                                                         EL512
03353      MOVE SPACES                 TO  WS-DETAIL1.                  EL512
03354      MOVE +99                    TO  WS-LINE-COUNT.               EL512
03355                                                                   EL512
03356  CFS-050. COPY ELCPRTCX.                                          EL512
03357                                                                   EL512
03358      IF PENDING-OPEN                                              EL512
03359          CLOSE PENDING-OUT.                                       EL512
03360                                                                   EL512
03361      CLOSE PRNTR   CARDS-IN                                       EL512
03362            ERACCT  ELCNTL.                                        EL512
03363                                                                   EL512
03364      IF ERACCT-FILE-STATUS NOT = ZEROS                            EL512
03365          DISPLAY '*** EL512  ERACCT CLOSE ERROR - JOB WILL ABEND' EL512
03366          MOVE ERACCT-FILE-STATUS TO WS-ABEND-FILE-STATUS          EL512
03367          GO TO ABEND-PGM.                                         EL512
03368                                                                   EL512
03369      IF ELCNTL-FILE-STATUS NOT = ZEROS                            EL512
03370          DISPLAY '*** EL512  ELCNTL CLOSE ERROR - JOB WILL ABEND' EL512
03371          MOVE ELCNTL-FILE-STATUS TO WS-ABEND-FILE-STATUS          EL512
03372          GO TO ABEND-PGM.                                         EL512
03373                                                                   EL512
03374  CFS-EXIT.                                                        EL512
03375      EXIT.                                                        EL512
03376                                                                   EL512
03377  ABEND-PGM SECTION. COPY ELCABEND SUPPRESS.                       EL512
