       IDENTIFICATION DIVISION.
       PROGRAM-ID.    JMICCERT.
       AUTHOR.        PABLO.
       DATE-COMPILED.

      *REMARKS.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT JMC-FILE-IN          ASSIGN TO SYS010.
      *       ORGANIZATION IS LINE SEQUENTIAL.
           SELECT SORT-FILE            ASSIGN TO SORTWK1.
           SELECT CID-FILE-OUT         ASSIGN TO SYS011.
           SELECT DISK-DATE            ASSIGN TO SYS019.
           SELECT PRINTX               ASSIGN TO SYS008.

       DATA DIVISION.
       FILE SECTION.

       FD  JMC-FILE-IN
           BLOCK CONTAINS 0 RECORDS
           RECORDING MODE IS F.

       01  JMC-CERT-RECORD.
           05  JMC-STATE               PIC X(10).
           05  JMC-ACCOUNT             PIC X(10).
           05  JMC-EFF-DATE            PIC 9(8).
           05  JMC-CERT-NO             PIC X(10).
           05  JMC-EXP-DATE            PIC 9(8).
           05  JMC-TERM                PIC 999.
           05  JMC-COV                 PIC X(5).
           05  JMC-COV-TYP             PIC X(5).
           05  JMC-UNITS               PIC 9(4)V9(4).
           05  JMC-MO-PMT              PIC 9(7)V99.
           05  JMC-APR                 PIC 9(5)V9(4).
           05  JMC-INIT-BEN            PIC 9(9)V99.
           05  JMC-PREM                PIC 9(9)V99.
           05  JMC-AGE                 PIC 999.
           05  JMC-REIN-CO             PIC X(35).

       SD  SORT-FILE. 

       01  SORT-RECORD.
           05  FILLER                  PIC XX.
           05  SORT-KEY.
               10  FILLER              PIC X(36).
               10  SORT-CERT-SFX       PIC X.
           05  FILLER                  PIC X(1017).

       FD  CID-FILE-OUT
           BLOCK CONTAINS 0 RECORDS
           RECORDING MODE IS F.

       01  CID-RECORD-OUT              PIC X(1056).

       FD  DISK-DATE
                                       COPY ELCDTEFD.
           EJECT
       FD  PRINTX
                                       COPY ELCPRTFD.

       WORKING-STORAGE SECTION.
       77  FILLER  PIC X(32) VALUE '********************************'.
       77  FILLER  PIC X(32) VALUE '    JMICCERT  WORKING STORAGE   '.
       77  FILLER  PIC X(32) VALUE '********************************'.

       77  WS-EOF-SW                   PIC X  VALUE SPACES.
           88  END-OF-INPUT               VALUE 'Y'.
       77  SUB1                        PIC S999   COMP-3 VALUE +0.
       77  BUSNDX                      PIC S9(03) COMP-3 VALUE +0.
       77  ACTNDX                      PIC S9(03) COMP-3 VALUE +0.
       77  PAGE-CTR                    PIC S9(07) VALUE +0  COMP-3.
       77  LINE-CTR                    PIC S9(03) VALUE +99 COMP-3.
       77  X                           PIC X      VALUE ' '.
       77  WS-INPUT-CNT                PIC 9(9)   VALUE ZEROS.
       77  WS-OUTPUT-CNT               PIC 9(9)   VALUE ZEROS.
       77  WS-REL-CNT                  PIC 9(9)   VALUE ZEROS.
       77  WS-EQ-CNT                   PIC 9(9)   VALUE ZEROS.
       77  WS-NO-ACCT-CNT              PIC 9(9)   VALUE ZEROS.
       77  WS-INIT-CERT                PIC X(1056).
       77  WS-SAVE-CERT                PIC X(1056).
       77  JMC-PREV-KEY                PIC X(38)  VALUE LOW-VALUES.
       77  S1                          PIC S999   VALUE +0 COMP-3.
       77  A1                          PIC S9(5)  VALUE +0 COMP-3.

                                       COPY ECSCRT01.
       01  WS-MISC.
           05  WS-DATE-1               PIC S9(3)  COMP-3  VALUE +0.
           05  WS-DATE-2               PIC S9     COMP-3  VALUE +0.
               88  LEAP-YEAR               VALUE +0.

           05  WS-N-SEX-CNT            PIC 9(7)  VALUE ZEROS.
           05  WS-HOLD-LFAMT-ALT       PIC S9(9)V99 VALUE +0.
           05  WS-HOLD-LFPRM-ALT       PIC S9(9)V99 VALUE +0.
           05  WS-BALLOON-SPLIT-SW     PIC X     VALUE SPACES.
               88  SPLIT-BALLOONS        VALUE 'Y'.
           05  WS-ACCT-TABLE.
               10  FILLER       PIC X(20) VALUE 'AL011031000900001001'.
               10  FILLER       PIC X(20) VALUE 'AL011028000900073001'.
               10  FILLER       PIC X(20) VALUE 'AL011178000900073002'.
               10  FILLER       PIC X(20) VALUE 'AL011046000900179001'.
               10  FILLER       PIC X(20) VALUE 'AL011047000900179002'.
               10  FILLER       PIC X(20) VALUE 'AL011050000900179003'.
               10  FILLER       PIC X(20) VALUE 'AL011054000900179004'.
               10  FILLER       PIC X(20) VALUE 'AL011177000900179005'.
               10  FILLER       PIC X(20) VALUE 'AL01T059000900179006'.
               10  FILLER       PIC X(20) VALUE 'AL01T071000900179007'.
               10  FILLER       PIC X(20) VALUE 'AL011103000900183001'.
               10  FILLER       PIC X(20) VALUE 'AL011150000900203001'.
               10  FILLER       PIC X(20) VALUE 'AL011095000900330001'.
               10  FILLER       PIC X(20) VALUE 'AL011086000900341001'.
               10  FILLER       PIC X(20) VALUE 'AL011090000900341002'.
               10  FILLER       PIC X(20) VALUE 'AL011091000900341003'.
               10  FILLER       PIC X(20) VALUE 'AL01T080000900341004'.
               10  FILLER       PIC X(20) VALUE 'AL011063000900363001'.
               10  FILLER       PIC X(20) VALUE 'AL011125000900402001'.
               10  FILLER       PIC X(20) VALUE 'AL011154000900402002'.
               10  FILLER       PIC X(20) VALUE 'AL011128000900413001'.
               10  FILLER       PIC X(20) VALUE 'AL011147000900530001'.
               10  FILLER       PIC X(20) VALUE 'AL01T064000900627001'.
               10  FILLER       PIC X(20) VALUE 'AL011045000900632001'.
               10  FILLER       PIC X(20) VALUE 'AL011064000990000101'.
               10  FILLER       PIC X(20) VALUE 'AL011126000990000102'.
               10  FILLER       PIC X(20) VALUE 'AL011133000990000103'.
               10  FILLER       PIC X(20) VALUE 'AL011165000990000104'.
               10  FILLER       PIC X(20) VALUE 'AL011168000990000105'.
               10  FILLER       PIC X(20) VALUE 'AL01T013000990000106'.
               10  FILLER       PIC X(20) VALUE 'AL01T019000990000107'.
               10  FILLER       PIC X(20) VALUE 'AL01T053000990000108'.
               10  FILLER       PIC X(20) VALUE 'AL01T061000990000109'.
               10  FILLER       PIC X(20) VALUE 'AL01T066000990000110'.
               10  FILLER       PIC X(20) VALUE 'AL01T073000990000111'.
               10  FILLER       PIC X(20) VALUE 'AL01T076000990000112'.
               10  FILLER       PIC X(20) VALUE 'AL01T077000990000113'.
               10  FILLER       PIC X(20) VALUE 'AL01T078000990000114'.
               10  FILLER       PIC X(20) VALUE 'AL01T079000990000115'.
               10  FILLER       PIC X(20) VALUE 'AL011180000990000382'.
               10  FILLER       PIC X(20) VALUE 'AL01T033000990000383'.
               10  FILLER       PIC X(20) VALUE 'AL011159000997212001'.
               10  FILLER       PIC X(20) VALUE 'AL011157000997212002'.
               10  FILLER       PIC X(20) VALUE 'AL011158000997212003'.
               10  FILLER       PIC X(20) VALUE 'AL011164000997330001'.
               10  FILLER       PIC X(20) VALUE 'AL011166000997459001'.
               10  FILLER       PIC X(20) VALUE 'AL01T081000997459002'.
               10  FILLER       PIC X(20) VALUE 'AL011084000997472001'.
               10  FILLER       PIC X(20) VALUE 'AL011179000997472002'.
               10  FILLER       PIC X(20) VALUE 'AL011169000997528001'.
               10  FILLER       PIC X(20) VALUE 'AL011170000997528002'.
               10  FILLER       PIC X(20) VALUE 'AL011176000997579001'.
               10  FILLER       PIC X(20) VALUE 'AR031001000900996001'.
               10  FILLER       PIC X(20) VALUE 'AR031017000990000116'.
               10  FILLER       PIC X(20) VALUE 'AR031014000997464001'.
               10  FILLER       PIC X(20) VALUE 'AR031013000997464003'.
               10  FILLER       PIC X(20) VALUE 'AZ021030000900508001'.
               10  FILLER       PIC X(20) VALUE 'AZ021033000900508002'.
               10  FILLER       PIC X(20) VALUE 'AZ021034000900508003'.
               10  FILLER       PIC X(20) VALUE 'AZ021040000900508004'.
               10  FILLER       PIC X(20) VALUE 'AZ021054000900508005'.
               10  FILLER       PIC X(20) VALUE 'AZ021055000900508006'.
               10  FILLER       PIC X(20) VALUE 'AZ021056000900508007'.
               10  FILLER       PIC X(20) VALUE 'AZ021001000900615001'.
               10  FILLER       PIC X(20) VALUE 'AZ021008000900615002'.
               10  FILLER       PIC X(20) VALUE 'AZ021041000997125001'.
               10  FILLER       PIC X(20) VALUE 'CO051003000900162004'.
               10  FILLER       PIC X(20) VALUE 'CO051046000900162005'.
               10  FILLER       PIC X(20) VALUE 'CO051048000900162008'.
               10  FILLER       PIC X(20) VALUE 'CO051022000900461001'.
               10  FILLER       PIC X(20) VALUE 'CO051023000900461002'.
               10  FILLER       PIC X(20) VALUE 'CO051024000900461003'.
               10  FILLER       PIC X(20) VALUE 'CO051027000900461004'.
               10  FILLER       PIC X(20) VALUE 'CO051029000900508008'.
               10  FILLER       PIC X(20) VALUE 'CO051030000900508009'.
               10  FILLER       PIC X(20) VALUE 'CO051031000900508010'.
               10  FILLER       PIC X(20) VALUE 'CO051044000900508012'.
               10  FILLER       PIC X(20) VALUE 'CO051055000900733001'.
               10  FILLER       PIC X(20) VALUE 'CO051056000900733002'.
               10  FILLER       PIC X(20) VALUE 'CO051054000900733035'.
               10  FILLER       PIC X(20) VALUE 'CO051053000900733037'.
               10  FILLER       PIC X(20) VALUE 'CO051057000990000117'.
               10  FILLER       PIC X(20) VALUE 'CO051060000990000118'.
               10  FILLER       PIC X(20) VALUE 'CT061024000990000119'.
               10  FILLER       PIC X(20) VALUE 'CT061035000997216001'.
               10  FILLER       PIC X(20) VALUE 'CT061036000997216002'.
               10  FILLER       PIC X(20) VALUE 'DE071008000990000120'.
               10  FILLER       PIC X(20) VALUE 'DE071010000990000363'.
               10  FILLER       PIC X(20) VALUE 'DE071009000997640001'.
               10  FILLER       PIC X(20) VALUE 'FL091051000900008001'.
               10  FILLER       PIC X(20) VALUE 'FL091321000900008002'.
               10  FILLER       PIC X(20) VALUE 'FL091539000900008003'.
               10  FILLER       PIC X(20) VALUE 'FL091032000900009001'.
               10  FILLER       PIC X(20) VALUE 'FL091119000900011001'.
               10  FILLER       PIC X(20) VALUE 'FL091170000900011002'.
               10  FILLER       PIC X(20) VALUE 'FL091813000900011003'.
               10  FILLER       PIC X(20) VALUE 'FL091108000900025001'.
               10  FILLER       PIC X(20) VALUE 'FL091026000900025002'.
               10  FILLER       PIC X(20) VALUE 'FL091192000900029001'.
               10  FILLER       PIC X(20) VALUE 'FL091225000900032001'.
               10  FILLER       PIC X(20) VALUE 'FL091837000900032002'.
               10  FILLER       PIC X(20) VALUE 'FL091286000900036001'.
               10  FILLER       PIC X(20) VALUE 'FL091287000900036002'.
               10  FILLER       PIC X(20) VALUE 'FL09T154000900036003'.
               10  FILLER       PIC X(20) VALUE 'FL09T079000900081001'.
               10  FILLER       PIC X(20) VALUE 'FL092368000900081002'.
               10  FILLER       PIC X(20) VALUE 'FL091425000900091001'.
               10  FILLER       PIC X(20) VALUE 'FL091362000900094001'.
               10  FILLER       PIC X(20) VALUE 'FL091363000900094002'.
               10  FILLER       PIC X(20) VALUE 'FL091364000900094003'.
               10  FILLER       PIC X(20) VALUE 'FL091762000900094004'.
               10  FILLER       PIC X(20) VALUE 'FL09T165000900094005'.
               10  FILLER       PIC X(20) VALUE 'FL091324000900096001'.
               10  FILLER       PIC X(20) VALUE 'FL09T175000900096002'.
               10  FILLER       PIC X(20) VALUE 'FL999999240900096003'.
               10  FILLER       PIC X(20) VALUE 'FL091323000900097001'.
               10  FILLER       PIC X(20) VALUE 'FL09T178000900097002'.
               10  FILLER       PIC X(20) VALUE 'FL091586000900098001'.
               10  FILLER       PIC X(20) VALUE 'FL09T168000900098002'.
               10  FILLER       PIC X(20) VALUE 'FL09T182000900098003'.
               10  FILLER       PIC X(20) VALUE 'FL091221000900105001'.
               10  FILLER       PIC X(20) VALUE 'FL091187000900120001'.
               10  FILLER       PIC X(20) VALUE 'FL091188000900120002'.
               10  FILLER       PIC X(20) VALUE 'FL091777000900120003'.
               10  FILLER       PIC X(20) VALUE 'FL091839000900120004'.
               10  FILLER       PIC X(20) VALUE 'FL09T112000900120005'.
               10  FILLER       PIC X(20) VALUE 'FL09T207000900120006'.
               10  FILLER       PIC X(20) VALUE 'FL091227000900122001'.
               10  FILLER       PIC X(20) VALUE 'FL091948000900128001'.
               10  FILLER       PIC X(20) VALUE 'FL091111000900139001'.
               10  FILLER       PIC X(20) VALUE 'FL091112000900139002'.
               10  FILLER       PIC X(20) VALUE 'FL091278000900139003'.
               10  FILLER       PIC X(20) VALUE 'FL091347000900139004'.
               10  FILLER       PIC X(20) VALUE 'FL091444000900139005'.
               10  FILLER       PIC X(20) VALUE 'FL091520000900139006'.
               10  FILLER       PIC X(20) VALUE 'FL091868000900139007'.
               10  FILLER       PIC X(20) VALUE 'FL091913000900139008'.
               10  FILLER       PIC X(20) VALUE 'FL091037000900162001'.
               10  FILLER       PIC X(20) VALUE 'FL091038000900162002'.
               10  FILLER       PIC X(20) VALUE 'FL091193000900162003'.
               10  FILLER       PIC X(20) VALUE 'FL091211000900162006'.
               10  FILLER       PIC X(20) VALUE 'FL091177000900162007'.
               10  FILLER       PIC X(20) VALUE 'FL09T162000900194001'.
               10  FILLER       PIC X(20) VALUE 'FL091341000900231001'.
               10  FILLER       PIC X(20) VALUE 'FL091380000900231002'.
               10  FILLER       PIC X(20) VALUE 'FL091795000900231003'.
               10  FILLER       PIC X(20) VALUE 'FL091796000900231004'.
               10  FILLER       PIC X(20) VALUE 'FL091797000900231005'.
               10  FILLER       PIC X(20) VALUE 'FL091552000900329001'.
               10  FILLER       PIC X(20) VALUE 'FL091555000900329002'.
               10  FILLER       PIC X(20) VALUE 'FL091664000900329003'.
               10  FILLER       PIC X(20) VALUE 'FL09T214000900329004'.
               10  FILLER       PIC X(20) VALUE 'FL091547000900349001'.
               10  FILLER       PIC X(20) VALUE 'FL091789000900349002'.
               10  FILLER       PIC X(20) VALUE 'FL091891000900432001'.
               10  FILLER       PIC X(20) VALUE 'FL09T189000900432002'.
               10  FILLER       PIC X(20) VALUE 'FL091223000900433001'.
               10  FILLER       PIC X(20) VALUE 'FL091673000900433002'.
               10  FILLER       PIC X(20) VALUE 'FL091800000900433003'.
               10  FILLER       PIC X(20) VALUE 'FL09T107000900433004'.
               10  FILLER       PIC X(20) VALUE 'FL091623000900433005'.
               10  FILLER       PIC X(20) VALUE 'FL091932000900433006'.
               10  FILLER       PIC X(20) VALUE 'FL091757000900444001'.
               10  FILLER       PIC X(20) VALUE 'FL091758000900444002'.
               10  FILLER       PIC X(20) VALUE 'FL091041000900462001'.
               10  FILLER       PIC X(20) VALUE 'FL091705000900473002'.
               10  FILLER       PIC X(20) VALUE 'FL091590000900510001'.
               10  FILLER       PIC X(20) VALUE 'FL091591000900510002'.
               10  FILLER       PIC X(20) VALUE 'FL091812000900511001'.
               10  FILLER       PIC X(20) VALUE 'FL091817000900511002'.
               10  FILLER       PIC X(20) VALUE 'FL091818000900511003'.
               10  FILLER       PIC X(20) VALUE 'FL091510000900584001'.
               10  FILLER       PIC X(20) VALUE 'FL091793000900584002'.
               10  FILLER       PIC X(20) VALUE 'FL091987000900584003'.
               10  FILLER       PIC X(20) VALUE 'FL09T163000900622001'.
               10  FILLER       PIC X(20) VALUE 'FL091005000900686001'.
               10  FILLER       PIC X(20) VALUE 'FL091010000900686002'.
               10  FILLER       PIC X(20) VALUE 'FL091398000900686003'.
               10  FILLER       PIC X(20) VALUE 'FL09T046000900690001'.
               10  FILLER       PIC X(20) VALUE 'FL091451000900711001'.
               10  FILLER       PIC X(20) VALUE 'FL091741000900711002'.
               10  FILLER       PIC X(20) VALUE 'FL091947000900711003'.
               10  FILLER       PIC X(20) VALUE 'FL091921000900711004'.
               10  FILLER       PIC X(20) VALUE 'FL091501000900719001'.
               10  FILLER       PIC X(20) VALUE 'FL091472000900733003'.
               10  FILLER       PIC X(20) VALUE 'FL091486000900733004'.
               10  FILLER       PIC X(20) VALUE 'FL091516000900733005'.
               10  FILLER       PIC X(20) VALUE 'FL091523000900733006'.
               10  FILLER       PIC X(20) VALUE 'FL091524000900733007'.
               10  FILLER       PIC X(20) VALUE 'FL091636000900733008'.
               10  FILLER       PIC X(20) VALUE 'FL091689000900733009'.
               10  FILLER       PIC X(20) VALUE 'FL091691000900733010'.
               10  FILLER       PIC X(20) VALUE 'FL091692000900733011'.
               10  FILLER       PIC X(20) VALUE 'FL091695000900733012'.
               10  FILLER       PIC X(20) VALUE 'FL091722000900733013'.
               10  FILLER       PIC X(20) VALUE 'FL091811000900733014'.
               10  FILLER       PIC X(20) VALUE 'FL091834000900733015'.
               10  FILLER       PIC X(20) VALUE 'FL091861000900733016'.
               10  FILLER       PIC X(20) VALUE 'FL091901000900733017'.
               10  FILLER       PIC X(20) VALUE 'FL091908000900733018'.
               10  FILLER       PIC X(20) VALUE 'FL091912000900733019'.
               10  FILLER       PIC X(20) VALUE 'FL091929000900733020'.
               10  FILLER       PIC X(20) VALUE 'FL091952000900733021'.
               10  FILLER       PIC X(20) VALUE 'FL091982000900733022'.
               10  FILLER       PIC X(20) VALUE 'FL091983000900733023'.
               10  FILLER       PIC X(20) VALUE 'FL091989000900733024'.
               10  FILLER       PIC X(20) VALUE 'FL09T205000900733025'.
               10  FILLER       PIC X(20) VALUE 'FL092336000900733036'.
               10  FILLER       PIC X(20) VALUE 'FL092358000900733038'.
               10  FILLER       PIC X(20) VALUE 'FL09T218000900733039'.
               10  FILLER       PIC X(20) VALUE 'FL007330430900733043'.
               10  FILLER       PIC X(20) VALUE 'FL007330440900733044'.
               10  FILLER       PIC X(20) VALUE 'FL091506000900774001'.
               10  FILLER       PIC X(20) VALUE 'FL091495000900792001'.
               10  FILLER       PIC X(20) VALUE 'FL091496000900792002'.
               10  FILLER       PIC X(20) VALUE 'FL091601000900792003'.
               10  FILLER       PIC X(20) VALUE 'FL091602000900792004'.
               10  FILLER       PIC X(20) VALUE 'FL09T203000900792005'.
               10  FILLER       PIC X(20) VALUE 'FL091534000900797001'.
               10  FILLER       PIC X(20) VALUE 'FL091553000900817001'.
               10  FILLER       PIC X(20) VALUE 'FL091563000900817002'.
               10  FILLER       PIC X(20) VALUE 'FL091667000900817003'.
               10  FILLER       PIC X(20) VALUE 'FL091743000900817004'.
               10  FILLER       PIC X(20) VALUE 'FL091820000900817005'.
               10  FILLER       PIC X(20) VALUE 'FL091866000900817006'.
               10  FILLER       PIC X(20) VALUE 'FL091897000900817007'.
               10  FILLER       PIC X(20) VALUE 'FL091909000900817008'.
               10  FILLER       PIC X(20) VALUE 'FL09T211000900817009'.
               10  FILLER       PIC X(20) VALUE 'FL09T194000900826001'.
               10  FILLER       PIC X(20) VALUE 'FL091558000900830001'.
               10  FILLER       PIC X(20) VALUE 'FL091659000900831001'.
               10  FILLER       PIC X(20) VALUE 'FL091707000900831002'.
               10  FILLER       PIC X(20) VALUE 'FL091863000900831003'.
               10  FILLER       PIC X(20) VALUE 'FL091658000900831005'.
               10  FILLER       PIC X(20) VALUE 'FL091614000900859001'.
               10  FILLER       PIC X(20) VALUE 'FL091615000900859002'.
               10  FILLER       PIC X(20) VALUE 'FL091650000900859003'.
               10  FILLER       PIC X(20) VALUE 'FL091644000900863001'.
               10  FILLER       PIC X(20) VALUE 'FL091645000900863002'.
               10  FILLER       PIC X(20) VALUE 'FL091646000900863003'.
               10  FILLER       PIC X(20) VALUE 'FL999999170900863008'.
               10  FILLER       PIC X(20) VALUE 'FL999999180900863009'.
               10  FILLER       PIC X(20) VALUE 'FL091653000900881001'.
               10  FILLER       PIC X(20) VALUE 'FL092334000900881002'.
               10  FILLER       PIC X(20) VALUE 'FL09T204000900881003'.
               10  FILLER       PIC X(20) VALUE 'FL091676000900902001'.
               10  FILLER       PIC X(20) VALUE 'FL091854000900902002'.
               10  FILLER       PIC X(20) VALUE 'FL091855000900902003'.
               10  FILLER       PIC X(20) VALUE 'FL091875000900902004'.
               10  FILLER       PIC X(20) VALUE 'FL091698000900910001'.
               10  FILLER       PIC X(20) VALUE 'FL091699000900910002'.
               10  FILLER       PIC X(20) VALUE 'FL091712000900910003'.
               10  FILLER       PIC X(20) VALUE 'FL091815000900910004'.
               10  FILLER       PIC X(20) VALUE 'FL091442000900911001'.
               10  FILLER       PIC X(20) VALUE 'FL091011000900961001'.
               10  FILLER       PIC X(20) VALUE 'FL091844000900991001'.
               10  FILLER       PIC X(20) VALUE 'FL091514000990000121'.
               10  FILLER       PIC X(20) VALUE 'FL091538000990000122'.
               10  FILLER       PIC X(20) VALUE 'FL091573000990000123'.
               10  FILLER       PIC X(20) VALUE 'FL091582000990000124'.
               10  FILLER       PIC X(20) VALUE 'FL091630000990000125'.
               10  FILLER       PIC X(20) VALUE 'FL091638000990000126'.
               10  FILLER       PIC X(20) VALUE 'FL091671000990000127'.
               10  FILLER       PIC X(20) VALUE 'FL091672000990000128'.
               10  FILLER       PIC X(20) VALUE 'FL091697000990000129'.
               10  FILLER       PIC X(20) VALUE 'FL091719000990000130'.
               10  FILLER       PIC X(20) VALUE 'FL091723000990000131'.
               10  FILLER       PIC X(20) VALUE 'FL091742000990000132'.
               10  FILLER       PIC X(20) VALUE 'FL091751000990000133'.
               10  FILLER       PIC X(20) VALUE 'FL091761000990000134'.
               10  FILLER       PIC X(20) VALUE 'FL091773000990000135'.
               10  FILLER       PIC X(20) VALUE 'FL091780000990000136'.
               10  FILLER       PIC X(20) VALUE 'FL091790000990000137'.
               10  FILLER       PIC X(20) VALUE 'FL091792000990000138'.
               10  FILLER       PIC X(20) VALUE 'FL091810000990000139'.
               10  FILLER       PIC X(20) VALUE 'FL091832000990000140'.
               10  FILLER       PIC X(20) VALUE 'FL091833000990000141'.
               10  FILLER       PIC X(20) VALUE 'FL091840000990000142'.
               10  FILLER       PIC X(20) VALUE 'FL091845000990000143'.
               10  FILLER       PIC X(20) VALUE 'FL091846000990000144'.
               10  FILLER       PIC X(20) VALUE 'FL091870000990000145'.
               10  FILLER       PIC X(20) VALUE 'FL091872000990000146'.
               10  FILLER       PIC X(20) VALUE 'FL091874000990000147'.
               10  FILLER       PIC X(20) VALUE 'FL091892000990000148'.
               10  FILLER       PIC X(20) VALUE 'FL091894000990000149'.
               10  FILLER       PIC X(20) VALUE 'FL091902000990000150'.
               10  FILLER       PIC X(20) VALUE 'FL091923000990000151'.
               10  FILLER       PIC X(20) VALUE 'FL091938000990000152'.
               10  FILLER       PIC X(20) VALUE 'FL091949000990000153'.
               10  FILLER       PIC X(20) VALUE 'FL091954000990000154'.
               10  FILLER       PIC X(20) VALUE 'FL091955000990000155'.
               10  FILLER       PIC X(20) VALUE 'FL091961000990000156'.
               10  FILLER       PIC X(20) VALUE 'FL091985000990000157'.
               10  FILLER       PIC X(20) VALUE 'FL091999000990000158'.
               10  FILLER       PIC X(20) VALUE 'FL092320000990000159'.
               10  FILLER       PIC X(20) VALUE 'FL092363000990000160'.
               10  FILLER       PIC X(20) VALUE 'FL092370000990000161'.
               10  FILLER       PIC X(20) VALUE 'FL092380000990000162'.
               10  FILLER       PIC X(20) VALUE 'FL09T094000990000163'.
               10  FILLER       PIC X(20) VALUE 'FL09T095000990000164'.
               10  FILLER       PIC X(20) VALUE 'FL09T096000990000165'.
               10  FILLER       PIC X(20) VALUE 'FL09T113000990000166'.
               10  FILLER       PIC X(20) VALUE 'FL09T126000990000167'.
               10  FILLER       PIC X(20) VALUE 'FL09T149000990000168'.
               10  FILLER       PIC X(20) VALUE 'FL09T159000990000169'.
               10  FILLER       PIC X(20) VALUE 'FL09T174000990000170'.
               10  FILLER       PIC X(20) VALUE 'FL09T183000990000171'.
               10  FILLER       PIC X(20) VALUE 'FL09T190000990000172'.
               10  FILLER       PIC X(20) VALUE 'FL09T201000990000173'.
               10  FILLER       PIC X(20) VALUE 'FL09T202000990000174'.
               10  FILLER       PIC X(20) VALUE 'FL09T215000990000175'.
               10  FILLER       PIC X(20) VALUE 'FL09T217000990000176'.
               10  FILLER       PIC X(20) VALUE 'FL091996000990000364'.
               10  FILLER       PIC X(20) VALUE 'FL092345000990000365'.
               10  FILLER       PIC X(20) VALUE 'FL092349000990000366'.
               10  FILLER       PIC X(20) VALUE 'FL092373000990000367'.
               10  FILLER       PIC X(20) VALUE 'FL091767000990000384'.
               10  FILLER       PIC X(20) VALUE 'FL092357000990000385'.
               10  FILLER       PIC X(20) VALUE 'FL092369000990000386'.
               10  FILLER       PIC X(20) VALUE 'FL091572000990000393'.
               10  FILLER       PIC X(20) VALUE 'FL094000000990000394'.
               10  FILLER       PIC X(20) VALUE 'FL091819000990000397'.
               10  FILLER       PIC X(20) VALUE 'FL091997000990000399'.
               10  FILLER       PIC X(20) VALUE 'FL091769000990000402'.
               10  FILLER       PIC X(20) VALUE 'FL091858000990000404'.
               10  FILLER       PIC X(20) VALUE 'FL091713000990000406'.
               10  FILLER       PIC X(20) VALUE 'FL091825000997029001'.
               10  FILLER       PIC X(20) VALUE 'FL091827000997029002'.
               10  FILLER       PIC X(20) VALUE 'FL091992000997108001'.
               10  FILLER       PIC X(20) VALUE 'FL091993000997108002'.
               10  FILLER       PIC X(20) VALUE 'FL091905000997183001'.
               10  FILLER       PIC X(20) VALUE 'FL091906000997183002'.
               10  FILLER       PIC X(20) VALUE 'FL091734000997287001'.
               10  FILLER       PIC X(20) VALUE 'FL091918000997287002'.
               10  FILLER       PIC X(20) VALUE 'FL091924000997303001'.
               10  FILLER       PIC X(20) VALUE 'FL091316000997316001'.
               10  FILLER       PIC X(20) VALUE 'FL091928000997327001'.
               10  FILLER       PIC X(20) VALUE 'FL091933000997341001'.
               10  FILLER       PIC X(20) VALUE 'FL091934000997341002'.
               10  FILLER       PIC X(20) VALUE 'FL091936000997341003'.
               10  FILLER       PIC X(20) VALUE 'FL091935000997341004'.
               10  FILLER       PIC X(20) VALUE 'FL091950000997361001'.
               10  FILLER       PIC X(20) VALUE 'FL091951000997361002'.
               10  FILLER       PIC X(20) VALUE 'FL091916000997362001'.
               10  FILLER       PIC X(20) VALUE 'FL091917000997362002'.
               10  FILLER       PIC X(20) VALUE 'FL091962000997425001'.
               10  FILLER       PIC X(20) VALUE 'FL091963000997425002'.
               10  FILLER       PIC X(20) VALUE 'FL092352000997425003'.
               10  FILLER       PIC X(20) VALUE 'FL091436000997427001'.
               10  FILLER       PIC X(20) VALUE 'FL091988000997453001'.
               10  FILLER       PIC X(20) VALUE 'FL371136000997453002'.
               10  FILLER       PIC X(20) VALUE 'FL091991000997462001'.
               10  FILLER       PIC X(20) VALUE 'FL091898000997474001'.
               10  FILLER       PIC X(20) VALUE 'FL092310000997533001'.
               10  FILLER       PIC X(20) VALUE 'FL092335000997555001'.
               10  FILLER       PIC X(20) VALUE 'FL091418000997555002'.
               10  FILLER       PIC X(20) VALUE 'FL091831000997563001'.
               10  FILLER       PIC X(20) VALUE 'FL092337000997563002'.
               10  FILLER       PIC X(20) VALUE 'FL092372000997563003'.
               10  FILLER       PIC X(20) VALUE 'FL092340000997569001'.
               10  FILLER       PIC X(20) VALUE 'FL092341000997569002'.
               10  FILLER       PIC X(20) VALUE 'FL092347000997581001'.
               10  FILLER       PIC X(20) VALUE 'FL092346000997581002'.
               10  FILLER       PIC X(20) VALUE 'FL092348000997581003'.
               10  FILLER       PIC X(20) VALUE 'FL091956000997612001'.
               10  FILLER       PIC X(20) VALUE 'FL092360000997612002'.
               10  FILLER       PIC X(20) VALUE 'FL09T179000997624001'.
               10  FILLER       PIC X(20) VALUE 'FL091824000997624003'.
               10  FILLER       PIC X(20) VALUE 'FL091753000997632001'.
               10  FILLER       PIC X(20) VALUE 'FL092365000997664004'.
               10  FILLER       PIC X(20) VALUE 'FL092366000997664005'.
               10  FILLER       PIC X(20) VALUE 'FL092367000997664006'.
               10  FILLER       PIC X(20) VALUE 'GA10T044000900013001'.
               10  FILLER       PIC X(20) VALUE 'GA101311000900038001'.
               10  FILLER       PIC X(20) VALUE 'GA101312000900038002'.
               10  FILLER       PIC X(20) VALUE 'GA101313000900038003'.
               10  FILLER       PIC X(20) VALUE 'GA101314000900038004'.
               10  FILLER       PIC X(20) VALUE 'GA10T085000900038005'.
               10  FILLER       PIC X(20) VALUE 'GA101098000900072001'.
               10  FILLER       PIC X(20) VALUE 'GA101127000900091002'.
               10  FILLER       PIC X(20) VALUE 'GA101319000900091003'.
               10  FILLER       PIC X(20) VALUE 'GA101056000900136001'.
               10  FILLER       PIC X(20) VALUE 'GA101479000900136002'.
               10  FILLER       PIC X(20) VALUE 'GA10T017000900136003'.
               10  FILLER       PIC X(20) VALUE 'GA101060000900140001'.
               10  FILLER       PIC X(20) VALUE 'GA101095000900183002'.
               10  FILLER       PIC X(20) VALUE 'GA101047000900212001'.
               10  FILLER       PIC X(20) VALUE 'GA101063000900212002'.
               10  FILLER       PIC X(20) VALUE 'GA10T035000900212003'.
               10  FILLER       PIC X(20) VALUE 'GA101112000900217001'.
               10  FILLER       PIC X(20) VALUE 'GA10T015000900224001'.
               10  FILLER       PIC X(20) VALUE 'GA10T109000900273001'.
               10  FILLER       PIC X(20) VALUE 'GA101032000900331001'.
               10  FILLER       PIC X(20) VALUE 'GA101136000900331002'.
               10  FILLER       PIC X(20) VALUE 'GA101179000900378001'.
               10  FILLER       PIC X(20) VALUE 'GA101180000900378002'.
               10  FILLER       PIC X(20) VALUE 'GA101181000900378003'.
               10  FILLER       PIC X(20) VALUE 'GA101182000900378004'.
               10  FILLER       PIC X(20) VALUE 'GA101465000900378005'.
               10  FILLER       PIC X(20) VALUE 'GA101488000900378006'.
               10  FILLER       PIC X(20) VALUE 'GA101189000900399001'.
               10  FILLER       PIC X(20) VALUE 'GA101559000900399002'.
               10  FILLER       PIC X(20) VALUE 'GA101188000900399003'.
               10  FILLER       PIC X(20) VALUE 'GA10T041000900458001'.
               10  FILLER       PIC X(20) VALUE 'GA101340000900473001'.
               10  FILLER       PIC X(20) VALUE 'GA101410000900496001'.
               10  FILLER       PIC X(20) VALUE 'GA101480000900496002'.
               10  FILLER       PIC X(20) VALUE 'GA101420000900536001'.
               10  FILLER       PIC X(20) VALUE 'GA10T113000900616001'.
               10  FILLER       PIC X(20) VALUE 'GA101113000900617001'.
               10  FILLER       PIC X(20) VALUE 'GA10T078000900617002'.
               10  FILLER       PIC X(20) VALUE 'GA101045000900632002'.
               10  FILLER       PIC X(20) VALUE 'GA101105000900632003'.
               10  FILLER       PIC X(20) VALUE 'GA101108000900640001'.
               10  FILLER       PIC X(20) VALUE 'GA10T087000900640002'.
               10  FILLER       PIC X(20) VALUE 'GA101202000900712001'.
               10  FILLER       PIC X(20) VALUE 'GA101133000900719002'.
               10  FILLER       PIC X(20) VALUE 'GA101460000900797002'.
               10  FILLER       PIC X(20) VALUE 'GA101545000900831004'.
               10  FILLER       PIC X(20) VALUE 'GA101164000900856001'.
               10  FILLER       PIC X(20) VALUE 'GA10T100000900856002'.
               10  FILLER       PIC X(20) VALUE 'GA101184000900863004'.
               10  FILLER       PIC X(20) VALUE 'GA101353000900863005'.
               10  FILLER       PIC X(20) VALUE 'GA101566000900863006'.
               10  FILLER       PIC X(20) VALUE 'GA101339000900871001'.
               10  FILLER       PIC X(20) VALUE 'GA101580000900871002'.
               10  FILLER       PIC X(20) VALUE 'GA101190000900888001'.
               10  FILLER       PIC X(20) VALUE 'GA101199000900902005'.
               10  FILLER       PIC X(20) VALUE 'GA101200000900902006'.
               10  FILLER       PIC X(20) VALUE 'GA101315000900902007'.
               10  FILLER       PIC X(20) VALUE 'GA101316000900902008'.
               10  FILLER       PIC X(20) VALUE 'GA101351000900902009'.
               10  FILLER       PIC X(20) VALUE 'GA10T106000900902010'.
               10  FILLER       PIC X(20) VALUE 'GA101497000900947001'.
               10  FILLER       PIC X(20) VALUE 'GA101206000900962001'.
               10  FILLER       PIC X(20) VALUE 'GA101207000900962002'.
               10  FILLER       PIC X(20) VALUE 'GA101303000900979001'.
               10  FILLER       PIC X(20) VALUE 'GA101317000900979002'.
               10  FILLER       PIC X(20) VALUE 'GA101336000900979003'.
               10  FILLER       PIC X(20) VALUE 'GA101520000900979004'.
               10  FILLER       PIC X(20) VALUE 'GA101072000990000177'.
               10  FILLER       PIC X(20) VALUE 'GA101099000990000178'.
               10  FILLER       PIC X(20) VALUE 'GA101322000990000179'.
               10  FILLER       PIC X(20) VALUE 'GA101325000990000180'.
               10  FILLER       PIC X(20) VALUE 'GA101327000990000181'.
               10  FILLER       PIC X(20) VALUE 'GA101359000990000182'.
               10  FILLER       PIC X(20) VALUE 'GA101400000990000183'.
               10  FILLER       PIC X(20) VALUE 'GA101450000990000184'.
               10  FILLER       PIC X(20) VALUE 'GA101463000990000185'.
               10  FILLER       PIC X(20) VALUE 'GA101472000990000186'.
               10  FILLER       PIC X(20) VALUE 'GA101496000990000187'.
               10  FILLER       PIC X(20) VALUE 'GA101530000990000188'.
               10  FILLER       PIC X(20) VALUE 'GA101531000990000189'.
               10  FILLER       PIC X(20) VALUE 'GA101561000990000190'.
               10  FILLER       PIC X(20) VALUE 'GA101572000990000191'.
               10  FILLER       PIC X(20) VALUE 'GA101579000990000192'.
               10  FILLER       PIC X(20) VALUE 'GA101584000990000193'.
               10  FILLER       PIC X(20) VALUE 'GA10T030000990000194'.
               10  FILLER       PIC X(20) VALUE 'GA10T032000990000195'.
               10  FILLER       PIC X(20) VALUE 'GA10T048000990000196'.
               10  FILLER       PIC X(20) VALUE 'GA10T090000990000197'.
               10  FILLER       PIC X(20) VALUE 'GA10T098000990000198'.
               10  FILLER       PIC X(20) VALUE 'GA10T099000990000199'.
               10  FILLER       PIC X(20) VALUE 'GA10T107000990000200'.
               10  FILLER       PIC X(20) VALUE 'GA10T108000990000201'.
               10  FILLER       PIC X(20) VALUE 'GA10T110000990000202'.
               10  FILLER       PIC X(20) VALUE 'GA10T112000990000203'.
               10  FILLER       PIC X(20) VALUE 'GA10T114000990000204'.
               10  FILLER       PIC X(20) VALUE 'GA101440000990000368'.
               10  FILLER       PIC X(20) VALUE 'GA101477000990000369'.
               10  FILLER       PIC X(20) VALUE 'GA101508000990000370'.
               10  FILLER       PIC X(20) VALUE 'GA101556000990000387'.
               10  FILLER       PIC X(20) VALUE 'GA101564000990000388'.
               10  FILLER       PIC X(20) VALUE 'GA101498000990000403'.
               10  FILLER       PIC X(20) VALUE 'GA101484000990000408'.
               10  FILLER       PIC X(20) VALUE 'GA101366000997041001'.
               10  FILLER       PIC X(20) VALUE 'GA101367000997041002'.
               10  FILLER       PIC X(20) VALUE 'GA101368000997041003'.
               10  FILLER       PIC X(20) VALUE 'GA101369000997041004'.
               10  FILLER       PIC X(20) VALUE 'GA101364000997041005'.
               10  FILLER       PIC X(20) VALUE 'GA999999110997041006'.
               10  FILLER       PIC X(20) VALUE 'GA10T105000997072001'.
               10  FILLER       PIC X(20) VALUE 'GA101203000997105001'.
               10  FILLER       PIC X(20) VALUE 'GA10T096000997105002'.
               10  FILLER       PIC X(20) VALUE 'GA101471000997126001'.
               10  FILLER       PIC X(20) VALUE 'GA101483000997199001'.
               10  FILLER       PIC X(20) VALUE 'GA101482000997199002'.
               10  FILLER       PIC X(20) VALUE 'GA101503000997316002'.
               10  FILLER       PIC X(20) VALUE 'GA101505000997379001'.
               10  FILLER       PIC X(20) VALUE 'GA101506000997379002'.
               10  FILLER       PIC X(20) VALUE 'GA101499000997391001'.
               10  FILLER       PIC X(20) VALUE 'GA101547000997437001'.
               10  FILLER       PIC X(20) VALUE 'GA101548000997437002'.
               10  FILLER       PIC X(20) VALUE 'GA101549000997437003'.
               10  FILLER       PIC X(20) VALUE 'GA101550000997437004'.
               10  FILLER       PIC X(20) VALUE 'GA101551000997437005'.
               10  FILLER       PIC X(20) VALUE 'GA101585000997437007'.
               10  FILLER       PIC X(20) VALUE 'GA101567000997437008'.
               10  FILLER       PIC X(20) VALUE 'GA101552000997448001'.
               10  FILLER       PIC X(20) VALUE 'GA101555000997448002'.
               10  FILLER       PIC X(20) VALUE 'GA101570000997461001'.
               10  FILLER       PIC X(20) VALUE 'GA101571000997461002'.
               10  FILLER       PIC X(20) VALUE 'GA101560000997526001'.
               10  FILLER       PIC X(20) VALUE 'GA10T083000997526002'.
               10  FILLER       PIC X(20) VALUE 'GA101563000997549001'.
               10  FILLER       PIC X(20) VALUE 'GA101574000997624002'.
               10  FILLER       PIC X(20) VALUE 'HI551016000900406001'.
               10  FILLER       PIC X(20) VALUE 'HI551017000900406002'.
               10  FILLER       PIC X(20) VALUE 'HI551020000900955001'.
               10  FILLER       PIC X(20) VALUE 'HI551021000900955002'.
               10  FILLER       PIC X(20) VALUE 'HI551022000900955003'.
               10  FILLER       PIC X(20) VALUE 'HI551041000900955004'.
               10  FILLER       PIC X(20) VALUE 'HI551013000990000361'.
               10  FILLER       PIC X(20) VALUE 'HI551023000990000362'.
               10  FILLER       PIC X(20) VALUE 'HI551025000997129001'.
               10  FILLER       PIC X(20) VALUE 'HI551027000997129002'.
               10  FILLER       PIC X(20) VALUE 'IA141008000900490001'.
               10  FILLER       PIC X(20) VALUE 'IA141009000900490002'.
               10  FILLER       PIC X(20) VALUE 'IA141010000900490003'.
               10  FILLER       PIC X(20) VALUE 'IA141011000900490004'.
               10  FILLER       PIC X(20) VALUE 'IA141012000900490005'.
               10  FILLER       PIC X(20) VALUE 'IA141056000900490006'.
               10  FILLER       PIC X(20) VALUE 'IA141024000900514001'.
               10  FILLER       PIC X(20) VALUE 'IA141025000900514002'.
               10  FILLER       PIC X(20) VALUE 'IA141029000990000223'.
               10  FILLER       PIC X(20) VALUE 'IA141034000990000224'.
               10  FILLER       PIC X(20) VALUE 'IA141039000990000225'.
               10  FILLER       PIC X(20) VALUE 'IA141044000990000226'.
               10  FILLER       PIC X(20) VALUE 'IA141045000990000227'.
               10  FILLER       PIC X(20) VALUE 'IA141050000990000228'.
               10  FILLER       PIC X(20) VALUE 'IA141054000990000229'.
               10  FILLER       PIC X(20) VALUE 'IA141040000990000371'.
               10  FILLER       PIC X(20) VALUE 'IA141021000997011001'.
               10  FILLER       PIC X(20) VALUE 'IA141022000997011002'.
               10  FILLER       PIC X(20) VALUE 'IA141031000997123001'.
               10  FILLER       PIC X(20) VALUE 'IA141027000997206001'.
               10  FILLER       PIC X(20) VALUE 'IA141041000997484001'.
               10  FILLER       PIC X(20) VALUE 'IA141042000997484002'.
               10  FILLER       PIC X(20) VALUE 'IA141043000997484003'.
               10  FILLER       PIC X(20) VALUE 'IA141055000997484004'.
               10  FILLER       PIC X(20) VALUE 'IA141046000997504001'.
               10  FILLER       PIC X(20) VALUE 'IA141048000997504002'.
               10  FILLER       PIC X(20) VALUE 'IA141049000997504003'.
               10  FILLER       PIC X(20) VALUE 'IA141051000997551001'.
               10  FILLER       PIC X(20) VALUE 'IA141052000997551002'.
               10  FILLER       PIC X(20) VALUE 'IA141053000997551003'.
               10  FILLER       PIC X(20) VALUE 'ID110002000997043001'.
               10  FILLER       PIC X(20) VALUE 'ID110003000997043002'.
               10  FILLER       PIC X(20) VALUE 'IL121120000900444003'.
               10  FILLER       PIC X(20) VALUE 'IL121121000900444004'.
               10  FILLER       PIC X(20) VALUE 'IL121122000900444005'.
               10  FILLER       PIC X(20) VALUE 'IL121124000900444006'.
               10  FILLER       PIC X(20) VALUE 'IL121126000900444007'.
               10  FILLER       PIC X(20) VALUE 'IL121175000900444008'.
               10  FILLER       PIC X(20) VALUE 'IL121131000900508011'.
               10  FILLER       PIC X(20) VALUE 'IL121019000900720001'.
               10  FILLER       PIC X(20) VALUE 'IL121020000900720002'.
               10  FILLER       PIC X(20) VALUE 'IL121054000900842001'.
               10  FILLER       PIC X(20) VALUE 'IL121087000900951001'.
               10  FILLER       PIC X(20) VALUE 'IL121032000990000205'.
               10  FILLER       PIC X(20) VALUE 'IL121098000990000206'.
               10  FILLER       PIC X(20) VALUE 'IL121109000990000207'.
               10  FILLER       PIC X(20) VALUE 'IL121111000990000208'.
               10  FILLER       PIC X(20) VALUE 'IL121113000990000209'.
               10  FILLER       PIC X(20) VALUE 'IL121128000990000210'.
               10  FILLER       PIC X(20) VALUE 'IL121132000990000211'.
               10  FILLER       PIC X(20) VALUE 'IL121146000990000212'.
               10  FILLER       PIC X(20) VALUE 'IL121154000990000213'.
               10  FILLER       PIC X(20) VALUE 'IL121158000990000214'.
               10  FILLER       PIC X(20) VALUE 'IL121160000990000215'.
               10  FILLER       PIC X(20) VALUE 'IL121163000990000216'.
               10  FILLER       PIC X(20) VALUE 'IL121179000990000217'.
               10  FILLER       PIC X(20) VALUE 'IL121181000990000218'.
               10  FILLER       PIC X(20) VALUE 'IL121182000990000219'.
               10  FILLER       PIC X(20) VALUE 'IL121183000990000220'.
               10  FILLER       PIC X(20) VALUE 'IL121184000990000221'.
               10  FILLER       PIC X(20) VALUE 'IL121110000990000395'.
               10  FILLER       PIC X(20) VALUE 'IL121180000990000396'.
               10  FILLER       PIC X(20) VALUE 'IL121143000997028001'.
               10  FILLER       PIC X(20) VALUE 'IL121149000997028002'.
               10  FILLER       PIC X(20) VALUE 'IL121159000997319001'.
               10  FILLER       PIC X(20) VALUE 'IL121165000997386001'.
               10  FILLER       PIC X(20) VALUE 'IL121167000997386002'.
               10  FILLER       PIC X(20) VALUE 'IL121170000997428001'.
               10  FILLER       PIC X(20) VALUE 'IL121171000997428002'.
               10  FILLER       PIC X(20) VALUE 'IL121173000997478001'.
               10  FILLER       PIC X(20) VALUE 'IL121174000997478002'.
               10  FILLER       PIC X(20) VALUE 'IN131030000900888002'.
               10  FILLER       PIC X(20) VALUE 'IN131032000900888003'.
               10  FILLER       PIC X(20) VALUE 'IN131033000900888004'.
               10  FILLER       PIC X(20) VALUE 'IN131034000900888005'.
               10  FILLER       PIC X(20) VALUE 'IN131035000900888006'.
               10  FILLER       PIC X(20) VALUE 'IN131036000900888007'.
               10  FILLER       PIC X(20) VALUE 'IN131061000900888008'.
               10  FILLER       PIC X(20) VALUE 'IN131067000900888009'.
               10  FILLER       PIC X(20) VALUE 'IN131065000900975001'.
               10  FILLER       PIC X(20) VALUE 'IN131057000997001001'.
               10  FILLER       PIC X(20) VALUE 'IN131059000997001002'.
               10  FILLER       PIC X(20) VALUE 'IN131060000997001003'.
               10  FILLER       PIC X(20) VALUE 'IN131068000997602001'.
               10  FILLER       PIC X(20) VALUE 'IN131069000997602002'.
               10  FILLER       PIC X(20) VALUE 'KS151007000900091004'.
               10  FILLER       PIC X(20) VALUE 'KS151010000900091005'.
               10  FILLER       PIC X(20) VALUE 'KS151024000900531001'.
               10  FILLER       PIC X(20) VALUE 'KS151027000900531002'.
               10  FILLER       PIC X(20) VALUE 'KS151028000900531003'.
               10  FILLER       PIC X(20) VALUE 'KS151029000900531004'.
               10  FILLER       PIC X(20) VALUE 'KS151037000900531005'.
               10  FILLER       PIC X(20) VALUE 'KS151016000900950001'.
               10  FILLER       PIC X(20) VALUE 'KS151017000900950002'.
               10  FILLER       PIC X(20) VALUE 'KS151038000990000230'.
               10  FILLER       PIC X(20) VALUE 'KS151041000990000405'.
               10  FILLER       PIC X(20) VALUE 'KY161044000900217002'.
               10  FILLER       PIC X(20) VALUE 'KY161007000900809001'.
               10  FILLER       PIC X(20) VALUE 'KY161010000900810001'.
               10  FILLER       PIC X(20) VALUE 'KY161012000900810002'.
               10  FILLER       PIC X(20) VALUE 'KY161013000900810003'.
               10  FILLER       PIC X(20) VALUE 'KY161014000900810004'.
               10  FILLER       PIC X(20) VALUE 'KY161016000900810005'.
               10  FILLER       PIC X(20) VALUE 'KY161020000900810006'.
               10  FILLER       PIC X(20) VALUE 'KY161021000900810007'.
               10  FILLER       PIC X(20) VALUE 'KY161028000900810008'.
               10  FILLER       PIC X(20) VALUE 'KY161047000900810009'.
               10  FILLER       PIC X(20) VALUE 'KY161055000900810010'.
               10  FILLER       PIC X(20) VALUE 'KY161061000900810011'.
               10  FILLER       PIC X(20) VALUE 'KY999999200900810012'.
               10  FILLER       PIC X(20) VALUE 'KY999999210900810013'.
               10  FILLER       PIC X(20) VALUE 'KY999999220900810014'.
               10  FILLER       PIC X(20) VALUE 'KY999999230900810015'.
               10  FILLER       PIC X(20) VALUE 'KY161022000900816001'.
               10  FILLER       PIC X(20) VALUE 'KY161023000900816002'.
               10  FILLER       PIC X(20) VALUE 'KY161051000900975002'.
               10  FILLER       PIC X(20) VALUE 'KY161059000900975004'.
               10  FILLER       PIC X(20) VALUE 'KY161008000990000231'.
               10  FILLER       PIC X(20) VALUE 'LA171003000900840001'.
               10  FILLER       PIC X(20) VALUE 'LA171041000900840002'.
               10  FILLER       PIC X(20) VALUE 'LA171012000900840003'.
               10  FILLER       PIC X(20) VALUE 'LA171005000900849001'.
               10  FILLER       PIC X(20) VALUE 'LA171002000900849005'.
               10  FILLER       PIC X(20) VALUE 'LA171036000900849006'.
               10  FILLER       PIC X(20) VALUE 'LA171019000900902011'.
               10  FILLER       PIC X(20) VALUE 'LA171020000900902012'.
               10  FILLER       PIC X(20) VALUE 'LA171021000900902013'.
               10  FILLER       PIC X(20) VALUE 'LA171022000900902014'.
               10  FILLER       PIC X(20) VALUE 'LA171033000900902015'.
               10  FILLER       PIC X(20) VALUE 'LA171035000900902016'.
               10  FILLER       PIC X(20) VALUE 'LA171018000990000232'.
               10  FILLER       PIC X(20) VALUE 'LA171027000997045001'.
               10  FILLER       PIC X(20) VALUE 'LA171028000997045002'.
               10  FILLER       PIC X(20) VALUE 'LA171029000997045003'.
               10  FILLER       PIC X(20) VALUE 'LA171030000997045004'.
               10  FILLER       PIC X(20) VALUE 'LA171032000997403001'.
               10  FILLER       PIC X(20) VALUE 'LA171042000997516001'.
               10  FILLER       PIC X(20) VALUE 'LA171044000997516002'.
               10  FILLER       PIC X(20) VALUE 'LA171047000997528003'.
               10  FILLER       PIC X(20) VALUE 'LA171048000997528004'.
               10  FILLER       PIC X(20) VALUE 'MA201073000900017001'.
               10  FILLER       PIC X(20) VALUE 'MA201013000900198001'.
               10  FILLER       PIC X(20) VALUE 'MA201021000900198002'.
               10  FILLER       PIC X(20) VALUE 'MA201049000900198003'.
               10  FILLER       PIC X(20) VALUE 'MA201030000900374001'.
               10  FILLER       PIC X(20) VALUE 'MA201031000900374002'.
               10  FILLER       PIC X(20) VALUE 'MA201032000900374003'.
               10  FILLER       PIC X(20) VALUE 'MA201059000900374004'.
               10  FILLER       PIC X(20) VALUE 'MA201041000900386001'.
               10  FILLER       PIC X(20) VALUE 'MA201045000900386002'.
               10  FILLER       PIC X(20) VALUE 'MA201068000900547001'.
               10  FILLER       PIC X(20) VALUE 'MA201069000900547002'.
               10  FILLER       PIC X(20) VALUE 'MA201099000900902017'.
               10  FILLER       PIC X(20) VALUE 'MA201100000900902018'.
               10  FILLER       PIC X(20) VALUE 'MA201101000900902019'.
               10  FILLER       PIC X(20) VALUE 'MA201102000900902020'.
               10  FILLER       PIC X(20) VALUE 'MA201103000900902021'.
               10  FILLER       PIC X(20) VALUE 'MA201104000900902022'.
               10  FILLER       PIC X(20) VALUE 'MA201105000900902023'.
               10  FILLER       PIC X(20) VALUE 'MA201106000900902024'.
               10  FILLER       PIC X(20) VALUE 'MA201107000900902025'.
               10  FILLER       PIC X(20) VALUE 'MA201108000900902026'.
               10  FILLER       PIC X(20) VALUE 'MA201109000900902027'.
               10  FILLER       PIC X(20) VALUE 'MA201054000900921001'.
               10  FILLER       PIC X(20) VALUE 'MA201055000900921002'.
               10  FILLER       PIC X(20) VALUE 'MA201052000990000239'.
               10  FILLER       PIC X(20) VALUE 'MA201071000990000240'.
               10  FILLER       PIC X(20) VALUE 'MA201081000990000241'.
               10  FILLER       PIC X(20) VALUE 'MA201089000990000242'.
               10  FILLER       PIC X(20) VALUE 'MA201110000990000243'.
               10  FILLER       PIC X(20) VALUE 'MA201115000990000244'.
               10  FILLER       PIC X(20) VALUE 'MA201120000990000245'.
               10  FILLER       PIC X(20) VALUE 'MA201098000990000390'.
               10  FILLER       PIC X(20) VALUE 'MA201078000997035001'.
               10  FILLER       PIC X(20) VALUE 'MA201079000997035002'.
               10  FILLER       PIC X(20) VALUE 'MA201085000997205001'.
               10  FILLER       PIC X(20) VALUE 'MA201093000997227001'.
               10  FILLER       PIC X(20) VALUE 'MA201097000997340001'.
               10  FILLER       PIC X(20) VALUE 'MA201090000997340002'.
               10  FILLER       PIC X(20) VALUE 'MA201130000997554001'.
               10  FILLER       PIC X(20) VALUE 'MA201096000997588001'.
               10  FILLER       PIC X(20) VALUE 'MD191018000900311001'.
               10  FILLER       PIC X(20) VALUE 'MD191019000900311002'.
               10  FILLER       PIC X(20) VALUE 'MD191022000900311003'.
               10  FILLER       PIC X(20) VALUE 'MD191023000900311004'.
               10  FILLER       PIC X(20) VALUE 'MD191024000900311005'.
               10  FILLER       PIC X(20) VALUE 'MD191052000900311006'.
               10  FILLER       PIC X(20) VALUE 'MD191021000900311007'.
               10  FILLER       PIC X(20) VALUE 'MD191033000900318001'.
               10  FILLER       PIC X(20) VALUE 'MD191035000900318002'.
               10  FILLER       PIC X(20) VALUE 'MD191036000900335001'.
               10  FILLER       PIC X(20) VALUE 'MD191037000900335002'.
               10  FILLER       PIC X(20) VALUE 'MD191038000900335003'.
               10  FILLER       PIC X(20) VALUE 'MD191051000900335004'.
               10  FILLER       PIC X(20) VALUE 'MD191059000900335005'.
               10  FILLER       PIC X(20) VALUE 'MD191060000900335006'.
               10  FILLER       PIC X(20) VALUE 'MD191069000900335007'.
               10  FILLER       PIC X(20) VALUE 'MD191070000900335008'.
               10  FILLER       PIC X(20) VALUE 'MD191071000900335009'.
               10  FILLER       PIC X(20) VALUE 'MD191107000900335010'.
               10  FILLER       PIC X(20) VALUE 'MD191123000900335011'.
               10  FILLER       PIC X(20) VALUE 'MD191068000900581001'.
               10  FILLER       PIC X(20) VALUE 'MD999999990900581002'.
               10  FILLER       PIC X(20) VALUE 'MD191053000900863007'.
               10  FILLER       PIC X(20) VALUE 'MD191044000990000233'.
               10  FILLER       PIC X(20) VALUE 'MD191054000990000234'.
               10  FILLER       PIC X(20) VALUE 'MD191089000990000235'.
               10  FILLER       PIC X(20) VALUE 'MD191100000990000236'.
               10  FILLER       PIC X(20) VALUE 'MD191127000990000237'.
               10  FILLER       PIC X(20) VALUE 'MD191128000990000238'.
               10  FILLER       PIC X(20) VALUE 'MD191125000990000389'.
               10  FILLER       PIC X(20) VALUE 'MD191046000990000398'.
               10  FILLER       PIC X(20) VALUE 'MD191103000990000400'.
               10  FILLER       PIC X(20) VALUE 'MD191061000997030001'.
               10  FILLER       PIC X(20) VALUE 'MD191041000997101001'.
               10  FILLER       PIC X(20) VALUE 'MD191042000997101002'.
               10  FILLER       PIC X(20) VALUE 'MD191095000997143001'.
               10  FILLER       PIC X(20) VALUE 'MD191112000997390001'.
               10  FILLER       PIC X(20) VALUE 'MD191115000997390002'.
               10  FILLER       PIC X(20) VALUE 'MD191117000997390003'.
               10  FILLER       PIC X(20) VALUE 'MD191122000997390004'.
               10  FILLER       PIC X(20) VALUE 'MD191109000997390005'.
               10  FILLER       PIC X(20) VALUE 'MD191114000997390006'.
               10  FILLER       PIC X(20) VALUE 'MD191129000997654001'.
               10  FILLER       PIC X(20) VALUE 'MD191130000997654002'.
               10  FILLER       PIC X(20) VALUE 'ME181002000900169001'.
               10  FILLER       PIC X(20) VALUE 'ME181003000900169002'.
               10  FILLER       PIC X(20) VALUE 'ME181005000900169003'.
               10  FILLER       PIC X(20) VALUE 'ME181013000900169004'.
               10  FILLER       PIC X(20) VALUE 'ME181007000900169006'.
               10  FILLER       PIC X(20) VALUE 'ME181008000900169007'.
               10  FILLER       PIC X(20) VALUE 'ME181009000900169008'.
               10  FILLER       PIC X(20) VALUE 'ME181012000900169009'.
               10  FILLER       PIC X(20) VALUE 'MI211023000997188001'.
               10  FILLER       PIC X(20) VALUE 'MI211026000997310001'.
               10  FILLER       PIC X(20) VALUE 'MO241007000900091006'.
               10  FILLER       PIC X(20) VALUE 'MO241009000900091007'.
               10  FILLER       PIC X(20) VALUE 'MO241017000900091008'.
               10  FILLER       PIC X(20) VALUE 'MO241001000900638001'.
               10  FILLER       PIC X(20) VALUE 'MO241002000900638002'.
               10  FILLER       PIC X(20) VALUE 'MO241055000900638003'.
               10  FILLER       PIC X(20) VALUE 'MO241014000900742001'.
               10  FILLER       PIC X(20) VALUE 'MO241013000900742002'.
               10  FILLER       PIC X(20) VALUE 'MO241030000900915001'.
               10  FILLER       PIC X(20) VALUE 'MO241019000900919001'.
               10  FILLER       PIC X(20) VALUE 'MO241032000900919002'.
               10  FILLER       PIC X(20) VALUE 'MO241052000900919003'.
               10  FILLER       PIC X(20) VALUE 'MO241037000990000246'.
               10  FILLER       PIC X(20) VALUE 'MO241062000990000247'.
               10  FILLER       PIC X(20) VALUE 'MO241067000990000248'.
               10  FILLER       PIC X(20) VALUE 'MO241068000990000249'.
               10  FILLER       PIC X(20) VALUE 'MO241073000990000409'.
               10  FILLER       PIC X(20) VALUE 'MO241060000997268001'.
               10  FILLER       PIC X(20) VALUE 'MO241059000997321001'.
               10  FILLER       PIC X(20) VALUE 'MO241058000997321002'.
               10  FILLER       PIC X(20) VALUE 'MO241034000997544001'.
               10  FILLER       PIC X(20) VALUE 'MO999999950997544002'.
               10  FILLER       PIC X(20) VALUE 'MO999999940997544003'.
               10  FILLER       PIC X(20) VALUE 'MO241069000997601001'.
               10  FILLER       PIC X(20) VALUE 'MO241070000997601002'.
               10  FILLER       PIC X(20) VALUE 'MO241071000997603001'.
               10  FILLER       PIC X(20) VALUE 'MO241072000997603002'.
               10  FILLER       PIC X(20) VALUE 'MO241050000997677001'.
               10  FILLER       PIC X(20) VALUE 'MO241066000997677002'.
               10  FILLER       PIC X(20) VALUE 'MS231001000900203002'.
               10  FILLER       PIC X(20) VALUE 'MS231002000900203003'.
               10  FILLER       PIC X(20) VALUE 'MS999999120900203004'.
               10  FILLER       PIC X(20) VALUE 'MS231062000900733026'.
               10  FILLER       PIC X(20) VALUE 'MS231063000900733040'.
               10  FILLER       PIC X(20) VALUE 'MS231040000997462002'.
               10  FILLER       PIC X(20) VALUE 'MT250004000900483001'.
               10  FILLER       PIC X(20) VALUE 'MT250008000900997001'.
               10  FILLER       PIC X(20) VALUE 'MT401008000900997002'.
               10  FILLER       PIC X(20) VALUE 'NC321315000900016001'.
               10  FILLER       PIC X(20) VALUE 'NC321326000900016002'.
               10  FILLER       PIC X(20) VALUE 'NC321384000900016003'.
               10  FILLER       PIC X(20) VALUE 'NC321314000900016004'.
               10  FILLER       PIC X(20) VALUE 'NC321025000900018001'.
               10  FILLER       PIC X(20) VALUE 'NC321038000900018002'.
               10  FILLER       PIC X(20) VALUE 'NC32T001000900089001'.
               10  FILLER       PIC X(20) VALUE 'NC321161000900091009'.
               10  FILLER       PIC X(20) VALUE 'NC321164000900091010'.
               10  FILLER       PIC X(20) VALUE 'NC321165000900091011'.
               10  FILLER       PIC X(20) VALUE 'NC321166000900091012'.
               10  FILLER       PIC X(20) VALUE 'NC321167000900091013'.
               10  FILLER       PIC X(20) VALUE 'NC321169000900091014'.
               10  FILLER       PIC X(20) VALUE 'NC321171000900091015'.
               10  FILLER       PIC X(20) VALUE 'NC321172000900091016'.
               10  FILLER       PIC X(20) VALUE 'NC321175000900091017'.
               10  FILLER       PIC X(20) VALUE 'NC321176000900091018'.
               10  FILLER       PIC X(20) VALUE 'NC321183000900091019'.
               10  FILLER       PIC X(20) VALUE 'NC321184000900091020'.
               10  FILLER       PIC X(20) VALUE 'NC321186000900091021'.
               10  FILLER       PIC X(20) VALUE 'NC321261000900091022'.
               10  FILLER       PIC X(20) VALUE 'NC321277000900091023'.
               10  FILLER       PIC X(20) VALUE 'NC321338000900091024'.
               10  FILLER       PIC X(20) VALUE 'NC32T076000900091025'.
               10  FILLER       PIC X(20) VALUE 'NC32T106000900091026'.
               10  FILLER       PIC X(20) VALUE 'NC321077000900099001'.
               10  FILLER       PIC X(20) VALUE 'NC321085000900103001'.
               10  FILLER       PIC X(20) VALUE 'NC321016000900151001'.
               10  FILLER       PIC X(20) VALUE 'NC321017000900151002'.
               10  FILLER       PIC X(20) VALUE 'NC321018000900151003'.
               10  FILLER       PIC X(20) VALUE 'NC32T097000900151004'.
               10  FILLER       PIC X(20) VALUE 'NC32T133000900151005'.
               10  FILLER       PIC X(20) VALUE 'NC321155000900269001'.
               10  FILLER       PIC X(20) VALUE 'NC321157000900269002'.
               10  FILLER       PIC X(20) VALUE 'NC321158000900269003'.
               10  FILLER       PIC X(20) VALUE 'NC321322000900269004'.
               10  FILLER       PIC X(20) VALUE 'NC321344000900269005'.
               10  FILLER       PIC X(20) VALUE 'NC321395000900269006'.
               10  FILLER       PIC X(20) VALUE 'NC32T132000900269007'.
               10  FILLER       PIC X(20) VALUE 'NC32T125000900273002'.
               10  FILLER       PIC X(20) VALUE 'NC321096000900322001'.
               10  FILLER       PIC X(20) VALUE 'NC321193000900322002'.
               10  FILLER       PIC X(20) VALUE 'NC321285000900393001'.
               10  FILLER       PIC X(20) VALUE 'NC321301000900419001'.
               10  FILLER       PIC X(20) VALUE 'NC321254000900509001'.
               10  FILLER       PIC X(20) VALUE 'NC321127000900616002'.
               10  FILLER       PIC X(20) VALUE 'NC321350000900616003'.
               10  FILLER       PIC X(20) VALUE 'NC32T061000900628001'.
               10  FILLER       PIC X(20) VALUE 'NC32T085000900689001'.
               10  FILLER       PIC X(20) VALUE 'NC321339000900733027'.
               10  FILLER       PIC X(20) VALUE 'NC321381000900733028'.
               10  FILLER       PIC X(20) VALUE 'NC321391000900733029'.
               10  FILLER       PIC X(20) VALUE 'NC32T096000900733030'.
               10  FILLER       PIC X(20) VALUE 'NC321360000900817010'.
               10  FILLER       PIC X(20) VALUE 'NC321361000900817011'.
               10  FILLER       PIC X(20) VALUE 'NC32T138000900817012'.
               10  FILLER       PIC X(20) VALUE 'NC32T118000900836001'.
               10  FILLER       PIC X(20) VALUE 'NC321305000900947002'.
               10  FILLER       PIC X(20) VALUE 'NC321306000900947003'.
               10  FILLER       PIC X(20) VALUE 'NC321154000990000262'.
               10  FILLER       PIC X(20) VALUE 'NC321304000990000263'.
               10  FILLER       PIC X(20) VALUE 'NC321367000990000264'.
               10  FILLER       PIC X(20) VALUE 'NC32T024000990000265'.
               10  FILLER       PIC X(20) VALUE 'NC32T069000990000266'.
               10  FILLER       PIC X(20) VALUE 'NC32T127000990000267'.
               10  FILLER       PIC X(20) VALUE 'NC32T129000990000268'.
               10  FILLER       PIC X(20) VALUE 'NC32T130000990000269'.
               10  FILLER       PIC X(20) VALUE 'NC32T134000990000270'.
               10  FILLER       PIC X(20) VALUE 'NC32T135000990000271'.
               10  FILLER       PIC X(20) VALUE 'NC32T137000990000272'.
               10  FILLER       PIC X(20) VALUE 'NC32T140000990000273'.
               10  FILLER       PIC X(20) VALUE 'NC321337000990000375'.
               10  FILLER       PIC X(20) VALUE 'NC321346000990000376'.
               10  FILLER       PIC X(20) VALUE 'NC321348000990000377'.
               10  FILLER       PIC X(20) VALUE 'NC32T107000990000378'.
               10  FILLER       PIC X(20) VALUE 'NC321325000997111001'.
               10  FILLER       PIC X(20) VALUE 'NC321327000997111002'.
               10  FILLER       PIC X(20) VALUE 'NC321330000997133001'.
               10  FILLER       PIC X(20) VALUE 'NC321334000997133002'.
               10  FILLER       PIC X(20) VALUE 'NC321335000997133003'.
               10  FILLER       PIC X(20) VALUE 'NC32T111000997133004'.
               10  FILLER       PIC X(20) VALUE 'NC321331000997133005'.
               10  FILLER       PIC X(20) VALUE 'NC321393000997133006'.
               10  FILLER       PIC X(20) VALUE 'NC321333000997133007'.
               10  FILLER       PIC X(20) VALUE 'NC321341000997153001'.
               10  FILLER       PIC X(20) VALUE 'NC321342000997153002'.
               10  FILLER       PIC X(20) VALUE 'NC321343000997153003'.
               10  FILLER       PIC X(20) VALUE 'NC321359000997153004'.
               10  FILLER       PIC X(20) VALUE 'NC32T136000997153005'.
               10  FILLER       PIC X(20) VALUE 'NC321362000997196003'.
               10  FILLER       PIC X(20) VALUE 'NC321396000997204003'.
               10  FILLER       PIC X(20) VALUE 'NC321353000997279001'.
               10  FILLER       PIC X(20) VALUE 'NC321349000997313001'.
               10  FILLER       PIC X(20) VALUE 'NC321355000997350001'.
               10  FILLER       PIC X(20) VALUE 'NC321356000997350002'.
               10  FILLER       PIC X(20) VALUE 'NC321336000997364001'.
               10  FILLER       PIC X(20) VALUE 'NC321354000997364002'.
               10  FILLER       PIC X(20) VALUE 'NC321363000997427002'.
               10  FILLER       PIC X(20) VALUE 'NC32T139000997427003'.
               10  FILLER       PIC X(20) VALUE 'NC321351000997429001'.
               10  FILLER       PIC X(20) VALUE 'NC321364000997429002'.
               10  FILLER       PIC X(20) VALUE 'ND331001000900417001'.
               10  FILLER       PIC X(20) VALUE 'ND331011000900417002'.
               10  FILLER       PIC X(20) VALUE 'ND331006000990000274'.
               10  FILLER       PIC X(20) VALUE 'NE261020000990000250'.
               10  FILLER       PIC X(20) VALUE 'NE261005000997103001'.
               10  FILLER       PIC X(20) VALUE 'NE261004000997103002'.
               10  FILLER       PIC X(20) VALUE 'NE261006000997422001'.
               10  FILLER       PIC X(20) VALUE 'NH281023000900902028'.
               10  FILLER       PIC X(20) VALUE 'NH281024000900902029'.
               10  FILLER       PIC X(20) VALUE 'NH281008000900963001'.
               10  FILLER       PIC X(20) VALUE 'NH281020000900963002'.
               10  FILLER       PIC X(20) VALUE 'NH281021000900963003'.
               10  FILLER       PIC X(20) VALUE 'NH281025000990000251'.
               10  FILLER       PIC X(20) VALUE 'NH281011000997096001'.
               10  FILLER       PIC X(20) VALUE 'NH281012000997096002'.
               10  FILLER       PIC X(20) VALUE 'NH281013000997096003'.
               10  FILLER       PIC X(20) VALUE 'NH281014000997096004'.
               10  FILLER       PIC X(20) VALUE 'NH281015000997096005'.
               10  FILLER       PIC X(20) VALUE 'NH281016000997282001'.
               10  FILLER       PIC X(20) VALUE 'NH281017000997282002'.
               10  FILLER       PIC X(20) VALUE 'NH281019000997282003'.
               10  FILLER       PIC X(20) VALUE 'NJ291257000900152001'.
               10  FILLER       PIC X(20) VALUE 'NJ291028000900153001'.
               10  FILLER       PIC X(20) VALUE 'NJ291030000900153002'.
               10  FILLER       PIC X(20) VALUE 'NJ291076000900153003'.
               10  FILLER       PIC X(20) VALUE 'NJ291196000900153004'.
               10  FILLER       PIC X(20) VALUE 'NJ291143000900153005'.
               10  FILLER       PIC X(20) VALUE 'NJ291197000900153006'.
               10  FILLER       PIC X(20) VALUE 'NJ291029000900153007'.
               10  FILLER       PIC X(20) VALUE 'NJ291037000900175001'.
               10  FILLER       PIC X(20) VALUE 'NJ291047000900197001'.
               10  FILLER       PIC X(20) VALUE 'NJ291049000900197002'.
               10  FILLER       PIC X(20) VALUE 'NJ291071000900197003'.
               10  FILLER       PIC X(20) VALUE 'NJ291081000900236001'.
               10  FILLER       PIC X(20) VALUE 'NJ291082000900236002'.
               10  FILLER       PIC X(20) VALUE 'NJ291256000900236003'.
               10  FILLER       PIC X(20) VALUE 'NJ999999190900236004'.
               10  FILLER       PIC X(20) VALUE 'NJ291136000900358001'.
               10  FILLER       PIC X(20) VALUE 'NJ291198000900476001'.
               10  FILLER       PIC X(20) VALUE 'NJ291199000900476002'.
               10  FILLER       PIC X(20) VALUE 'NJ291200000900476003'.
               10  FILLER       PIC X(20) VALUE 'NJ291204000900476004'.
               10  FILLER       PIC X(20) VALUE 'NJ291205000900476005'.
               10  FILLER       PIC X(20) VALUE 'NJ291206000900476006'.
               10  FILLER       PIC X(20) VALUE 'NJ291220000900476007'.
               10  FILLER       PIC X(20) VALUE 'NJ291228000900476008'.
               10  FILLER       PIC X(20) VALUE 'NJ291207000900476009'.
               10  FILLER       PIC X(20) VALUE 'NJ291214000900551001'.
               10  FILLER       PIC X(20) VALUE 'NJ291215000900551002'.
               10  FILLER       PIC X(20) VALUE 'NJ291217000900551003'.
               10  FILLER       PIC X(20) VALUE 'NJ291218000900551004'.
               10  FILLER       PIC X(20) VALUE 'NJ291060000900646001'.
               10  FILLER       PIC X(20) VALUE 'NJ291061000900646002'.
               10  FILLER       PIC X(20) VALUE 'NJ291097000900646003'.
               10  FILLER       PIC X(20) VALUE 'NJ291135000900646004'.
               10  FILLER       PIC X(20) VALUE 'NJ291134000900795001'.
               10  FILLER       PIC X(20) VALUE 'NJ999999140900795002'.
               10  FILLER       PIC X(20) VALUE 'NJ999999150900795003'.
               10  FILLER       PIC X(20) VALUE 'NJ999999160900795004'.
               10  FILLER       PIC X(20) VALUE 'NJ291243000900902030'.
               10  FILLER       PIC X(20) VALUE 'NJ291111000900905001'.
               10  FILLER       PIC X(20) VALUE 'NJ291211000990000252'.
               10  FILLER       PIC X(20) VALUE 'NJ291212000990000253'.
               10  FILLER       PIC X(20) VALUE 'NJ291216000990000254'.
               10  FILLER       PIC X(20) VALUE 'NJ291232000990000255'.
               10  FILLER       PIC X(20) VALUE 'NJ291233000990000256'.
               10  FILLER       PIC X(20) VALUE 'NJ291237000990000257'.
               10  FILLER       PIC X(20) VALUE 'NJ291253000990000258'.
               10  FILLER       PIC X(20) VALUE 'NJ291263000990000259'.
               10  FILLER       PIC X(20) VALUE 'NJ291120000990000373'.
               10  FILLER       PIC X(20) VALUE 'NJ291229000990000374'.
               10  FILLER       PIC X(20) VALUE 'NJ291227000997019001'.
               10  FILLER       PIC X(20) VALUE 'NJ291249000997253001'.
               10  FILLER       PIC X(20) VALUE 'NJ291231000997368001'.
               10  FILLER       PIC X(20) VALUE 'NJ291244000997368002'.
               10  FILLER       PIC X(20) VALUE 'NJ291251000997537001'.
               10  FILLER       PIC X(20) VALUE 'NM301007000900362001'.
               10  FILLER       PIC X(20) VALUE 'NM301035000900362002'.
               10  FILLER       PIC X(20) VALUE 'NM999999280900362003'.
               10  FILLER       PIC X(20) VALUE 'NM301011000900397001'.
               10  FILLER       PIC X(20) VALUE 'NM301012000900397002'.
               10  FILLER       PIC X(20) VALUE 'NM301013000900397003'.
               10  FILLER       PIC X(20) VALUE 'NM301019000900397004'.
               10  FILLER       PIC X(20) VALUE 'NM301048000900397005'.
               10  FILLER       PIC X(20) VALUE 'NM301049000900397006'.
               10  FILLER       PIC X(20) VALUE 'NM301023000900522001'.
               10  FILLER       PIC X(20) VALUE 'NM301024000900539001'.
               10  FILLER       PIC X(20) VALUE 'NM301031000900588001'.
               10  FILLER       PIC X(20) VALUE 'NM999999250900588002'.
               10  FILLER       PIC X(20) VALUE 'NM999999260900588003'.
               10  FILLER       PIC X(20) VALUE 'NM301008000900866001'.
               10  FILLER       PIC X(20) VALUE 'NM301010000900866002'.
               10  FILLER       PIC X(20) VALUE 'NM301045000990000260'.
               10  FILLER       PIC X(20) VALUE 'NM301050000990000261'.
               10  FILLER       PIC X(20) VALUE 'NM301030000997531001'.
               10  FILLER       PIC X(20) VALUE 'NV271005000900641001'.
               10  FILLER       PIC X(20) VALUE 'OH341005000900077001'.
               10  FILLER       PIC X(20) VALUE 'OH341028000900077002'.
               10  FILLER       PIC X(20) VALUE 'OH341137000900077003'.
               10  FILLER       PIC X(20) VALUE 'OH341138000900077004'.
               10  FILLER       PIC X(20) VALUE 'OH341065000900120007'.
               10  FILLER       PIC X(20) VALUE 'OH341066000900120008'.
               10  FILLER       PIC X(20) VALUE 'OH341067000900120009'.
               10  FILLER       PIC X(20) VALUE 'OH341080000900120010'.
               10  FILLER       PIC X(20) VALUE 'OH341090000900120011'.
               10  FILLER       PIC X(20) VALUE 'OH341130000900120012'.
               10  FILLER       PIC X(20) VALUE 'OH341131000900120013'.
               10  FILLER       PIC X(20) VALUE 'OH341141000900120014'.
               10  FILLER       PIC X(20) VALUE 'OH341021000900263001'.
               10  FILLER       PIC X(20) VALUE 'OH341127000900263002'.
               10  FILLER       PIC X(20) VALUE 'OH341059000900389002'.
               10  FILLER       PIC X(20) VALUE 'OH341011000900625001'.
               10  FILLER       PIC X(20) VALUE 'OH341098000900625002'.
               10  FILLER       PIC X(20) VALUE 'OH341075000900975003'.
               10  FILLER       PIC X(20) VALUE 'OH341072000900976001'.
               10  FILLER       PIC X(20) VALUE 'OH341076000900976002'.
               10  FILLER       PIC X(20) VALUE 'OH341704000900976003'.
               10  FILLER       PIC X(20) VALUE 'OH341034000990000275'.
               10  FILLER       PIC X(20) VALUE 'OH341096000990000276'.
               10  FILLER       PIC X(20) VALUE 'OH341099000990000277'.
               10  FILLER       PIC X(20) VALUE 'OH341100000990000278'.
               10  FILLER       PIC X(20) VALUE 'OH341125000990000279'.
               10  FILLER       PIC X(20) VALUE 'OH341139000990000280'.
               10  FILLER       PIC X(20) VALUE 'OH341140000990000281'.
               10  FILLER       PIC X(20) VALUE 'OH341142000990000282'.
               10  FILLER       PIC X(20) VALUE 'OH341146000990000283'.
               10  FILLER       PIC X(20) VALUE 'OH341149000990000284'.
               10  FILLER       PIC X(20) VALUE 'OH341150000990000285'.
               10  FILLER       PIC X(20) VALUE 'OH341113000997059001'.
               10  FILLER       PIC X(20) VALUE 'OH341116000997063001'.
               10  FILLER       PIC X(20) VALUE 'OH341126000997063003'.
               10  FILLER       PIC X(20) VALUE 'OH999999970997063004'.
               10  FILLER       PIC X(20) VALUE 'OH999999960997063005'.
               10  FILLER       PIC X(20) VALUE 'OH341121000997080001'.
               10  FILLER       PIC X(20) VALUE 'OH341122000997080002'.
               10  FILLER       PIC X(20) VALUE 'OH341133000997295001'.
               10  FILLER       PIC X(20) VALUE 'OH341134000997295002'.
               10  FILLER       PIC X(20) VALUE 'OH341135000997295003'.
               10  FILLER       PIC X(20) VALUE 'OH341136000997295004'.
               10  FILLER       PIC X(20) VALUE 'OR361004000900371001'.
               10  FILLER       PIC X(20) VALUE 'OR361003000900371002'.
               10  FILLER       PIC X(20) VALUE 'OR361047000990000286'.
               10  FILLER       PIC X(20) VALUE 'OR361048000990000287'.
               10  FILLER       PIC X(20) VALUE 'OR361049000990000288'.
               10  FILLER       PIC X(20) VALUE 'OR361050000990000289'.
               10  FILLER       PIC X(20) VALUE 'OR361013000997097001'.
               10  FILLER       PIC X(20) VALUE 'OR361014000997097002'.
               10  FILLER       PIC X(20) VALUE 'OR361016000997097003'.
               10  FILLER       PIC X(20) VALUE 'OR361027000997097004'.
               10  FILLER       PIC X(20) VALUE 'OR361045000997097005'.
               10  FILLER       PIC X(20) VALUE 'OR361017000997161001'.
               10  FILLER       PIC X(20) VALUE 'OR361018000997161002'.
               10  FILLER       PIC X(20) VALUE 'OR361019000997161003'.
               10  FILLER       PIC X(20) VALUE 'OR361020000997161004'.
               10  FILLER       PIC X(20) VALUE 'OR361021000997161005'.
               10  FILLER       PIC X(20) VALUE 'OR361033000997506001'.
               10  FILLER       PIC X(20) VALUE 'OR361038000997506002'.
               10  FILLER       PIC X(20) VALUE 'OR361039000997506003'.
               10  FILLER       PIC X(20) VALUE 'OR361041000997506004'.
               10  FILLER       PIC X(20) VALUE 'OR361042000997506005'.
               10  FILLER       PIC X(20) VALUE 'OR361043000997506006'.
               10  FILLER       PIC X(20) VALUE 'OR361044000997506007'.
               10  FILLER       PIC X(20) VALUE 'OR361060000997693001'.
               10  FILLER       PIC X(20) VALUE 'OR361070000997693002'.
               10  FILLER       PIC X(20) VALUE 'PA341043000900389001'.
               10  FILLER       PIC X(20) VALUE 'PA371049000900389003'.
               10  FILLER       PIC X(20) VALUE 'PA371051000900389004'.
               10  FILLER       PIC X(20) VALUE 'PA371023000900729001'.
               10  FILLER       PIC X(20) VALUE 'PA371025000900729002'.
               10  FILLER       PIC X(20) VALUE 'PA371026000900729003'.
               10  FILLER       PIC X(20) VALUE 'PA371040000900729004'.
               10  FILLER       PIC X(20) VALUE 'PA371096000900828001'.
               10  FILLER       PIC X(20) VALUE 'PA371060000900948001'.
               10  FILLER       PIC X(20) VALUE 'PA371061000900948002'.
               10  FILLER       PIC X(20) VALUE 'PA371062000900948003'.
               10  FILLER       PIC X(20) VALUE 'PA371063000900948004'.
               10  FILLER       PIC X(20) VALUE 'PA371065000900948005'.
               10  FILLER       PIC X(20) VALUE 'PA371066000900948006'.
               10  FILLER       PIC X(20) VALUE 'PA371067000900948007'.
               10  FILLER       PIC X(20) VALUE 'PA371068000900948008'.
               10  FILLER       PIC X(20) VALUE 'PA371152000900948009'.
               10  FILLER       PIC X(20) VALUE 'PA999999930900948010'.
               10  FILLER       PIC X(20) VALUE 'PA371075000900948011'.
               10  FILLER       PIC X(20) VALUE 'PA999999980900948012'.
               10  FILLER       PIC X(20) VALUE 'PA371078000900998001'.
               10  FILLER       PIC X(20) VALUE 'PA371079000900998002'.
               10  FILLER       PIC X(20) VALUE 'PA371080000900998003'.
               10  FILLER       PIC X(20) VALUE 'PA371081000900998004'.
               10  FILLER       PIC X(20) VALUE 'PA371028000990000290'.
               10  FILLER       PIC X(20) VALUE 'PA371045000990000291'.
               10  FILLER       PIC X(20) VALUE 'PA371074000990000292'.
               10  FILLER       PIC X(20) VALUE 'PA371094000990000293'.
               10  FILLER       PIC X(20) VALUE 'PA371099000990000294'.
               10  FILLER       PIC X(20) VALUE 'PA371110000990000295'.
               10  FILLER       PIC X(20) VALUE 'PA371114000990000296'.
               10  FILLER       PIC X(20) VALUE 'PA371115000990000297'.
               10  FILLER       PIC X(20) VALUE 'PA371119000990000298'.
               10  FILLER       PIC X(20) VALUE 'PA371130000990000299'.
               10  FILLER       PIC X(20) VALUE 'PA371131000990000300'.
               10  FILLER       PIC X(20) VALUE 'PA371154000990000301'.
               10  FILLER       PIC X(20) VALUE 'PA371160000990000302'.
               10  FILLER       PIC X(20) VALUE 'PA371161000990000303'.
               10  FILLER       PIC X(20) VALUE 'PA371164000990000304'.
               10  FILLER       PIC X(20) VALUE 'PA371087000997007001'.
               10  FILLER       PIC X(20) VALUE 'PA371088000997007002'.
               10  FILLER       PIC X(20) VALUE 'PA371089000997007003'.
               10  FILLER       PIC X(20) VALUE 'PA371086000997019002'.
               10  FILLER       PIC X(20) VALUE 'PA371132000997240001'.
               10  FILLER       PIC X(20) VALUE 'PA371121000997322001'.
               10  FILLER       PIC X(20) VALUE 'PA371125000997325001'.
               10  FILLER       PIC X(20) VALUE 'PA371163000997537002'.
               10  FILLER       PIC X(20) VALUE 'PA371140000997545001'.
               10  FILLER       PIC X(20) VALUE 'PA371141000997545002'.
               10  FILLER       PIC X(20) VALUE 'PA371153000997545003'.
               10  FILLER       PIC X(20) VALUE 'PA371162000997545004'.
               10  FILLER       PIC X(20) VALUE 'PA371143000997545005'.
               10  FILLER       PIC X(20) VALUE 'PA371142000997545006'.
               10  FILLER       PIC X(20) VALUE 'PA371144000997545007'.
               10  FILLER       PIC X(20) VALUE 'PA371146000997545008'.
               10  FILLER       PIC X(20) VALUE 'PA371147000997564001'.
               10  FILLER       PIC X(20) VALUE 'PA371148000997564002'.
               10  FILLER       PIC X(20) VALUE 'PA371149000997564003'.
               10  FILLER       PIC X(20) VALUE 'PA371150000997564004'.
               10  FILLER       PIC X(20) VALUE 'PA371151000997564005'.
               10  FILLER       PIC X(20) VALUE 'PA371155000997595001'.
               10  FILLER       PIC X(20) VALUE 'PA371156000997595002'.
               10  FILLER       PIC X(20) VALUE 'PA371134000997604001'.
               10  FILLER       PIC X(20) VALUE 'PA371157000997604002'.
               10  FILLER       PIC X(20) VALUE 'PA371158000997626001'.
               10  FILLER       PIC X(20) VALUE 'PA371159000997626002'.
               10  FILLER       PIC X(20) VALUE 'RI381043000900017002'.
               10  FILLER       PIC X(20) VALUE 'RI381011000900198004'.
               10  FILLER       PIC X(20) VALUE 'RI381034000900198005'.
               10  FILLER       PIC X(20) VALUE 'RI381042000990000305'.
               10  FILLER       PIC X(20) VALUE 'RI381046000990000306'.
               10  FILLER       PIC X(20) VALUE 'RI381047000990000307'.
               10  FILLER       PIC X(20) VALUE 'RI381052000990000308'.
               10  FILLER       PIC X(20) VALUE 'RI381050000997598001'.
               10  FILLER       PIC X(20) VALUE 'RI381051000997598002'.
               10  FILLER       PIC X(20) VALUE 'RI381053000997698001'.
               10  FILLER       PIC X(20) VALUE 'RI381054000997698002'.
               10  FILLER       PIC X(20) VALUE 'RI381055000997698003'.
               10  FILLER       PIC X(20) VALUE 'RI381056000997698004'.
               10  FILLER       PIC X(20) VALUE 'SC39T018000900068001'.
               10  FILLER       PIC X(20) VALUE 'SC39T036000900072002'.
               10  FILLER       PIC X(20) VALUE 'SC391075000900091027'.
               10  FILLER       PIC X(20) VALUE 'SC391078000900091028'.
               10  FILLER       PIC X(20) VALUE 'SC391080000900091029'.
               10  FILLER       PIC X(20) VALUE 'SC391081000900091030'.
               10  FILLER       PIC X(20) VALUE 'SC391082000900091031'.
               10  FILLER       PIC X(20) VALUE 'SC391083000900091032'.
               10  FILLER       PIC X(20) VALUE 'SC391077000900091038'.
               10  FILLER       PIC X(20) VALUE 'SC391229000900163001'.
               10  FILLER       PIC X(20) VALUE 'SC39T035000900163002'.
               10  FILLER       PIC X(20) VALUE 'SC39G576000900171001'.
               10  FILLER       PIC X(20) VALUE 'SC391022000900196001'.
               10  FILLER       PIC X(20) VALUE 'SC391041000900196002'.
               10  FILLER       PIC X(20) VALUE 'SC391126000900196003'.
               10  FILLER       PIC X(20) VALUE 'SC391127000900196004'.
               10  FILLER       PIC X(20) VALUE 'SC391094000900298001'.
               10  FILLER       PIC X(20) VALUE 'SC391160000900298002'.
               10  FILLER       PIC X(20) VALUE 'SC391100000900381001'.
               10  FILLER       PIC X(20) VALUE 'SC391132000900419002'.
               10  FILLER       PIC X(20) VALUE 'SC391133000900419003'.
               10  FILLER       PIC X(20) VALUE 'SC391134000900419004'.
               10  FILLER       PIC X(20) VALUE 'SC391135000900419005'.
               10  FILLER       PIC X(20) VALUE 'SC391137000900419006'.
               10  FILLER       PIC X(20) VALUE 'SC391180000900419007'.
               10  FILLER       PIC X(20) VALUE 'SC391162000900569001'.
               10  FILLER       PIC X(20) VALUE 'SC39T028000900569002'.
               10  FILLER       PIC X(20) VALUE 'SC391225000900733041'.
               10  FILLER       PIC X(20) VALUE 'SC391121000900889001'.
               10  FILLER       PIC X(20) VALUE 'SC39T050000900889002'.
               10  FILLER       PIC X(20) VALUE 'SC391122000900893001'.
               10  FILLER       PIC X(20) VALUE 'SC391123000900893002'.
               10  FILLER       PIC X(20) VALUE 'SC391124000900893003'.
               10  FILLER       PIC X(20) VALUE 'SC391184000900947004'.
               10  FILLER       PIC X(20) VALUE 'SC391092000990000309'.
               10  FILLER       PIC X(20) VALUE 'SC391108000990000310'.
               10  FILLER       PIC X(20) VALUE 'SC391117000990000311'.
               10  FILLER       PIC X(20) VALUE 'SC391125000990000312'.
               10  FILLER       PIC X(20) VALUE 'SC391144000990000313'.
               10  FILLER       PIC X(20) VALUE 'SC391155000990000314'.
               10  FILLER       PIC X(20) VALUE 'SC391183000990000315'.
               10  FILLER       PIC X(20) VALUE 'SC391192000990000316'.
               10  FILLER       PIC X(20) VALUE 'SC391196000990000317'.
               10  FILLER       PIC X(20) VALUE 'SC391210000990000318'.
               10  FILLER       PIC X(20) VALUE 'SC391219000990000319'.
               10  FILLER       PIC X(20) VALUE 'SC391223000990000320'.
               10  FILLER       PIC X(20) VALUE 'SC391224000990000321'.
               10  FILLER       PIC X(20) VALUE 'SC39T003000990000322'.
               10  FILLER       PIC X(20) VALUE 'SC39T007000990000323'.
               10  FILLER       PIC X(20) VALUE 'SC39T031000990000324'.
               10  FILLER       PIC X(20) VALUE 'SC39T042000990000325'.
               10  FILLER       PIC X(20) VALUE 'SC39T049000990000326'.
               10  FILLER       PIC X(20) VALUE 'SC39T053000990000327'.
               10  FILLER       PIC X(20) VALUE 'SC391102000997006001'.
               10  FILLER       PIC X(20) VALUE 'SC391215000997063002'.
               10  FILLER       PIC X(20) VALUE 'SC391187000997189001'.
               10  FILLER       PIC X(20) VALUE 'SC391179000997204001'.
               10  FILLER       PIC X(20) VALUE 'SC39T051000997204002'.
               10  FILLER       PIC X(20) VALUE 'SC39T006000997226001'.
               10  FILLER       PIC X(20) VALUE 'SC391197000997355001'.
               10  FILLER       PIC X(20) VALUE 'SC397789000997355002'.
               10  FILLER       PIC X(20) VALUE 'SC391201000997407001'.
               10  FILLER       PIC X(20) VALUE 'SC391195000997436001'.
               10  FILLER       PIC X(20) VALUE 'SC391204000997436002'.
               10  FILLER       PIC X(20) VALUE 'SC391205000997436003'.
               10  FILLER       PIC X(20) VALUE 'SC391206000997436004'.
               10  FILLER       PIC X(20) VALUE 'SC391211000997437006'.
               10  FILLER       PIC X(20) VALUE 'SC391209000997437009'.
               10  FILLER       PIC X(20) VALUE 'SC391207000997438001'.
               10  FILLER       PIC X(20) VALUE 'SC391208000997438002'.
               10  FILLER       PIC X(20) VALUE 'SC39T040000997438003'.
               10  FILLER       PIC X(20) VALUE 'SC391212000997439001'.
               10  FILLER       PIC X(20) VALUE 'SC391218000997479001'.
               10  FILLER       PIC X(20) VALUE 'SC39T032000997479002'.
               10  FILLER       PIC X(20) VALUE 'SC39T043000997505001'.
               10  FILLER       PIC X(20) VALUE 'SC391182000997577001'.
               10  FILLER       PIC X(20) VALUE 'SC391214000997594001'.
               10  FILLER       PIC X(20) VALUE 'SC391228000997594002'.
               10  FILLER       PIC X(20) VALUE 'SC39T052000997606001'.
               10  FILLER       PIC X(20) VALUE 'SD400001000900880001'.
               10  FILLER       PIC X(20) VALUE 'SD400002000900880002'.
               10  FILLER       PIC X(20) VALUE 'SD400003000900880003'.
               10  FILLER       PIC X(20) VALUE 'SD401009000900880004'.
               10  FILLER       PIC X(20) VALUE 'TN411050000900091033'.
               10  FILLER       PIC X(20) VALUE 'TN411013000900133001'.
               10  FILLER       PIC X(20) VALUE 'TN411016000900133002'.
               10  FILLER       PIC X(20) VALUE 'TN411030000900133003'.
               10  FILLER       PIC X(20) VALUE 'TN411032000900133004'.
               10  FILLER       PIC X(20) VALUE 'TN411057000900133005'.
               10  FILLER       PIC X(20) VALUE 'TN411110000900133006'.
               10  FILLER       PIC X(20) VALUE 'TN411151000900133007'.
               10  FILLER       PIC X(20) VALUE 'TN411118000900402003'.
               10  FILLER       PIC X(20) VALUE 'TN411065000900405001'.
               10  FILLER       PIC X(20) VALUE 'TN411100000900541001'.
               10  FILLER       PIC X(20) VALUE 'TN411088000900586001'.
               10  FILLER       PIC X(20) VALUE 'TN411111000900586002'.
               10  FILLER       PIC X(20) VALUE 'TN411117000900586003'.
               10  FILLER       PIC X(20) VALUE 'TN411146000900586004'.
               10  FILLER       PIC X(20) VALUE 'TN411105000900616004'.
               10  FILLER       PIC X(20) VALUE 'TN411055000900733031'.
               10  FILLER       PIC X(20) VALUE 'TN411078000900733032'.
               10  FILLER       PIC X(20) VALUE 'TN411112000900733033'.
               10  FILLER       PIC X(20) VALUE 'TN411136000900733034'.
               10  FILLER       PIC X(20) VALUE 'TN411089000900733042'.
               10  FILLER       PIC X(20) VALUE 'TN411099000990000328'.
               10  FILLER       PIC X(20) VALUE 'TN411113000990000329'.
               10  FILLER       PIC X(20) VALUE 'TN411127000990000330'.
               10  FILLER       PIC X(20) VALUE 'TN411130000990000331'.
               10  FILLER       PIC X(20) VALUE 'TN411137000990000332'.
               10  FILLER       PIC X(20) VALUE 'TN411139000990000333'.
               10  FILLER       PIC X(20) VALUE 'TN411147000990000334'.
               10  FILLER       PIC X(20) VALUE 'TN411149000990000335'.
               10  FILLER       PIC X(20) VALUE 'TN411150000990000336'.
               10  FILLER       PIC X(20) VALUE 'TN411152000990000337'.
               10  FILLER       PIC X(20) VALUE 'TN411120000990000391'.
               10  FILLER       PIC X(20) VALUE 'TN411126000990000407'.
               10  FILLER       PIC X(20) VALUE 'TN411102000997207001'.
               10  FILLER       PIC X(20) VALUE 'TN411129000997207002'.
               10  FILLER       PIC X(20) VALUE 'TN411133000997329001'.
               10  FILLER       PIC X(20) VALUE 'TN411134000997329002'.
               10  FILLER       PIC X(20) VALUE 'TN411138000997416001'.
               10  FILLER       PIC X(20) VALUE 'TN411140000997461003'.
               10  FILLER       PIC X(20) VALUE 'TN411143000997461004'.
               10  FILLER       PIC X(20) VALUE 'TN411141000997461005'.
               10  FILLER       PIC X(20) VALUE 'TN411142000997461006'.
               10  FILLER       PIC X(20) VALUE 'TN411144000997461007'.
               10  FILLER       PIC X(20) VALUE 'TN411145000997464002'.
               10  FILLER       PIC X(20) VALUE 'TN411148000997528005'.
               10  FILLER       PIC X(20) VALUE 'TX421018000900091034'.
               10  FILLER       PIC X(20) VALUE 'TX421017000900314001'.
               10  FILLER       PIC X(20) VALUE 'TX421071000900401001'.
               10  FILLER       PIC X(20) VALUE 'TX421021000900777001'.
               10  FILLER       PIC X(20) VALUE 'TX421022000900777002'.
               10  FILLER       PIC X(20) VALUE 'TX421023000900777003'.
               10  FILLER       PIC X(20) VALUE 'TX421044000900777004'.
               10  FILLER       PIC X(20) VALUE 'TX421163000900777005'.
               10  FILLER       PIC X(20) VALUE 'TX999999100900777006'.
               10  FILLER       PIC X(20) VALUE 'TX421031000900849002'.
               10  FILLER       PIC X(20) VALUE 'TX421032000900849003'.
               10  FILLER       PIC X(20) VALUE 'TX421033000900849004'.
               10  FILLER       PIC X(20) VALUE 'TX421045000900924001'.
               10  FILLER       PIC X(20) VALUE 'TX421046000900924002'.
               10  FILLER       PIC X(20) VALUE 'TX421050000990000338'.
               10  FILLER       PIC X(20) VALUE 'TX421073000990000339'.
               10  FILLER       PIC X(20) VALUE 'TX421122000990000340'.
               10  FILLER       PIC X(20) VALUE 'TX421162000990000341'.
               10  FILLER       PIC X(20) VALUE 'TX171040000990000372'.
               10  FILLER       PIC X(20) VALUE 'TX421100000990000379'.
               10  FILLER       PIC X(20) VALUE 'TX421120000990000380'.
               10  FILLER       PIC X(20) VALUE 'TX421121000990000392'.
               10  FILLER       PIC X(20) VALUE 'TX421076000997015001'.
               10  FILLER       PIC X(20) VALUE 'TX421077000997015002'.
               10  FILLER       PIC X(20) VALUE 'TX421117000997196001'.
               10  FILLER       PIC X(20) VALUE 'TX421131000997196002'.
               10  FILLER       PIC X(20) VALUE 'TX421112000997254001'.
               10  FILLER       PIC X(20) VALUE 'TX421149000997453003'.
               10  FILLER       PIC X(20) VALUE 'TX421151000997453004'.
               10  FILLER       PIC X(20) VALUE 'TX421153000997453005'.
               10  FILLER       PIC X(20) VALUE 'TX421152000997528006'.
               10  FILLER       PIC X(20) VALUE 'TX421165000997528007'.
               10  FILLER       PIC X(20) VALUE 'TX421155000997582001'.
               10  FILLER       PIC X(20) VALUE 'TX421156000997582002'.
               10  FILLER       PIC X(20) VALUE 'TX421158000997582003'.
               10  FILLER       PIC X(20) VALUE 'TX421159000997582004'.
               10  FILLER       PIC X(20) VALUE 'TX421160000997582005'.
               10  FILLER       PIC X(20) VALUE 'TX421161000997582006'.
               10  FILLER       PIC X(20) VALUE 'TX421157000997582007'.
               10  FILLER       PIC X(20) VALUE 'TX421166000997582008'.
               10  FILLER       PIC X(20) VALUE 'TX421167000997694001'.
               10  FILLER       PIC X(20) VALUE 'UT431006000997107001'.
               10  FILLER       PIC X(20) VALUE 'UT431012000997528008'.
               10  FILLER       PIC X(20) VALUE 'VA451082000900091035'.
               10  FILLER       PIC X(20) VALUE 'VA451083000900091036'.
               10  FILLER       PIC X(20) VALUE 'VA451085000900091037'.
               10  FILLER       PIC X(20) VALUE 'VA451003000900103002'.
               10  FILLER       PIC X(20) VALUE 'VA451016000900103003'.
               10  FILLER       PIC X(20) VALUE 'VA451018000900103004'.
               10  FILLER       PIC X(20) VALUE 'VA451022000900103005'.
               10  FILLER       PIC X(20) VALUE 'VA451026000900103006'.
               10  FILLER       PIC X(20) VALUE 'VA451027000900103007'.
               10  FILLER       PIC X(20) VALUE 'VA451089000900103008'.
               10  FILLER       PIC X(20) VALUE 'VA451113000900103009'.
               10  FILLER       PIC X(20) VALUE 'VA451151000900103010'.
               10  FILLER       PIC X(20) VALUE 'VA451153000900103011'.
               10  FILLER       PIC X(20) VALUE 'VA451160000900103012'.
               10  FILLER       PIC X(20) VALUE 'VA451161000900103013'.
               10  FILLER       PIC X(20) VALUE 'VA451204000900103014'.
               10  FILLER       PIC X(20) VALUE 'VA451205000900103015'.
               10  FILLER       PIC X(20) VALUE 'VA451208000900103016'.
               10  FILLER       PIC X(20) VALUE 'VA451047000900126001'.
               10  FILLER       PIC X(20) VALUE 'VA451048000900126002'.
               10  FILLER       PIC X(20) VALUE 'VA451059000900126003'.
               10  FILLER       PIC X(20) VALUE 'VA451163000900126004'.
               10  FILLER       PIC X(20) VALUE 'VA451176000900126005'.
               10  FILLER       PIC X(20) VALUE 'VA451037000900161001'.
               10  FILLER       PIC X(20) VALUE 'VA451206000900161002'.
               10  FILLER       PIC X(20) VALUE 'VA451172000900161003'.
               10  FILLER       PIC X(20) VALUE 'VA451055000900161004'.
               10  FILLER       PIC X(20) VALUE 'VA451045000900168001'.
               10  FILLER       PIC X(20) VALUE 'VA451062000900232001'.
               10  FILLER       PIC X(20) VALUE 'VA451063000900232002'.
               10  FILLER       PIC X(20) VALUE 'VA451064000900232003'.
               10  FILLER       PIC X(20) VALUE 'VA999999130900232004'.
               10  FILLER       PIC X(20) VALUE 'VA451091000900271001'.
               10  FILLER       PIC X(20) VALUE 'VA451103000900318003'.
               10  FILLER       PIC X(20) VALUE 'VA451105000900318004'.
               10  FILLER       PIC X(20) VALUE 'VA451106000900318005'.
               10  FILLER       PIC X(20) VALUE 'VA451107000900318006'.
               10  FILLER       PIC X(20) VALUE 'VA451110000900318007'.
               10  FILLER       PIC X(20) VALUE 'VA451111000900318008'.
               10  FILLER       PIC X(20) VALUE 'VA451144000900318009'.
               10  FILLER       PIC X(20) VALUE 'VA451187000900318010'.
               10  FILLER       PIC X(20) VALUE 'VA451201000900318011'.
               10  FILLER       PIC X(20) VALUE 'VA451119000900346001'.
               10  FILLER       PIC X(20) VALUE 'VA451121000900346002'.
               10  FILLER       PIC X(20) VALUE 'VA451122000900346003'.
               10  FILLER       PIC X(20) VALUE 'VA451126000900346004'.
               10  FILLER       PIC X(20) VALUE 'VA451189000900346005'.
               10  FILLER       PIC X(20) VALUE 'VA451120000900346006'.
               10  FILLER       PIC X(20) VALUE 'VA451173000900364001'.
               10  FILLER       PIC X(20) VALUE 'VA451142000900426001'.
               10  FILLER       PIC X(20) VALUE 'VA451112000900527001'.
               10  FILLER       PIC X(20) VALUE 'VA451053000900635001'.
               10  FILLER       PIC X(20) VALUE 'VA451054000900635002'.
               10  FILLER       PIC X(20) VALUE 'VA451057000900635003'.
               10  FILLER       PIC X(20) VALUE 'VA451168000900635004'.
               10  FILLER       PIC X(20) VALUE 'VA451060000900654001'.
               10  FILLER       PIC X(20) VALUE 'VA451073000900669001'.
               10  FILLER       PIC X(20) VALUE 'VA451039000900688001'.
               10  FILLER       PIC X(20) VALUE 'VA451042000900688002'.
               10  FILLER       PIC X(20) VALUE 'VA451043000900688003'.
               10  FILLER       PIC X(20) VALUE 'VA451114000900688004'.
               10  FILLER       PIC X(20) VALUE 'VA451074000900825001'.
               10  FILLER       PIC X(20) VALUE 'VA451127000900825002'.
               10  FILLER       PIC X(20) VALUE 'VA451174000900825003'.
               10  FILLER       PIC X(20) VALUE 'VA451135000990000342'.
               10  FILLER       PIC X(20) VALUE 'VA451137000990000343'.
               10  FILLER       PIC X(20) VALUE 'VA451179000990000344'.
               10  FILLER       PIC X(20) VALUE 'VA451180000990000345'.
               10  FILLER       PIC X(20) VALUE 'VA451188000990000346'.
               10  FILLER       PIC X(20) VALUE 'VA451193000990000347'.
               10  FILLER       PIC X(20) VALUE 'VA451200000990000348'.
               10  FILLER       PIC X(20) VALUE 'VA451202000990000349'.
               10  FILLER       PIC X(20) VALUE 'VA451203000990000350'.
               10  FILLER       PIC X(20) VALUE 'VA451213000990000351'.
               10  FILLER       PIC X(20) VALUE 'VA451217000990000352'.
               10  FILLER       PIC X(20) VALUE 'VA451219000990000353'.
               10  FILLER       PIC X(20) VALUE 'VA451220000990000354'.
               10  FILLER       PIC X(20) VALUE 'VA451221000990000355'.
               10  FILLER       PIC X(20) VALUE 'VA451224000990000356'.
               10  FILLER       PIC X(20) VALUE 'VA451182000997192001'.
               10  FILLER       PIC X(20) VALUE 'VA451212000997192002'.
               10  FILLER       PIC X(20) VALUE 'VA451186000997195001'.
               10  FILLER       PIC X(20) VALUE 'VA451183000997195002'.
               10  FILLER       PIC X(20) VALUE 'VA451184000997195003'.
               10  FILLER       PIC X(20) VALUE 'VA451185000997195004'.
               10  FILLER       PIC X(20) VALUE 'VA451191000997223001'.
               10  FILLER       PIC X(20) VALUE 'VA451192000997223002'.
               10  FILLER       PIC X(20) VALUE 'VA451198000997334001'.
               10  FILLER       PIC X(20) VALUE 'VA451199000997334002'.
               10  FILLER       PIC X(20) VALUE 'VA451215000997456001'.
               10  FILLER       PIC X(20) VALUE 'VA451216000997456002'.
               10  FILLER       PIC X(20) VALUE 'WA461009000990000381'.
               10  FILLER       PIC X(20) VALUE 'WA461005000997097006'.
               10  FILLER       PIC X(20) VALUE 'WA461006000997097007'.
               10  FILLER       PIC X(20) VALUE 'WA461014000997281001'.
               10  FILLER       PIC X(20) VALUE 'WA461018000997281002'.
               10  FILLER       PIC X(20) VALUE 'WI481108000900119001'.
               10  FILLER       PIC X(20) VALUE 'WI481021000900268001'.
               10  FILLER       PIC X(20) VALUE 'WI481022000900268002'.
               10  FILLER       PIC X(20) VALUE 'WI481023000900268003'.
               10  FILLER       PIC X(20) VALUE 'WI481024000900268004'.
               10  FILLER       PIC X(20) VALUE 'WI481025000900268005'.
               10  FILLER       PIC X(20) VALUE 'WI481026000900268006'.
               10  FILLER       PIC X(20) VALUE 'WI481027000900268007'.
               10  FILLER       PIC X(20) VALUE 'WI481028000900268008'.
               10  FILLER       PIC X(20) VALUE 'WI481029000900268009'.
               10  FILLER       PIC X(20) VALUE 'WI481030000900268010'.
               10  FILLER       PIC X(20) VALUE 'WI481033000900268011'.
               10  FILLER       PIC X(20) VALUE 'WI481051000900268012'.
               10  FILLER       PIC X(20) VALUE 'WI481101000900268013'.
               10  FILLER       PIC X(20) VALUE 'WI481102000900268014'.
               10  FILLER       PIC X(20) VALUE 'WI481128000900268015'.
               10  FILLER       PIC X(20) VALUE 'WI481157000900268016'.
               10  FILLER       PIC X(20) VALUE 'WI481161000900268017'.
               10  FILLER       PIC X(20) VALUE 'WI481162000900268018'.
               10  FILLER       PIC X(20) VALUE 'WI481165000900268019'.
               10  FILLER       PIC X(20) VALUE 'WI481034000900320001'.
               10  FILLER       PIC X(20) VALUE 'WI481037000900320002'.
               10  FILLER       PIC X(20) VALUE 'WI481038000900320003'.
               10  FILLER       PIC X(20) VALUE 'WI481039000900320004'.
               10  FILLER       PIC X(20) VALUE 'WI481040000900320005'.
               10  FILLER       PIC X(20) VALUE 'WI481041000900320006'.
               10  FILLER       PIC X(20) VALUE 'WI481130000900320007'.
               10  FILLER       PIC X(20) VALUE 'WI481146000900320008'.
               10  FILLER       PIC X(20) VALUE 'WI481147000900320009'.
               10  FILLER       PIC X(20) VALUE 'WI481148000900320010'.
               10  FILLER       PIC X(20) VALUE 'WI481149000900320011'.
               10  FILLER       PIC X(20) VALUE 'WI481154000900320012'.
               10  FILLER       PIC X(20) VALUE 'WI481155000900320013'.
               10  FILLER       PIC X(20) VALUE 'WI481163000900320014'.
               10  FILLER       PIC X(20) VALUE 'WI999999270900320015'.
               10  FILLER       PIC X(20) VALUE 'WI481057000900348001'.
               10  FILLER       PIC X(20) VALUE 'WI481072000900348002'.
               10  FILLER       PIC X(20) VALUE 'WI481073000900348003'.
               10  FILLER       PIC X(20) VALUE 'WI481078000900367001'.
               10  FILLER       PIC X(20) VALUE 'WI481110000900367002'.
               10  FILLER       PIC X(20) VALUE 'WI481131000900367003'.
               10  FILLER       PIC X(20) VALUE 'WI481116000900443001'.
               10  FILLER       PIC X(20) VALUE 'WI481045000900752001'.
               10  FILLER       PIC X(20) VALUE 'WI481046000900752002'.
               10  FILLER       PIC X(20) VALUE 'WI481047000900752003'.
               10  FILLER       PIC X(20) VALUE 'WI481048000900752004'.
               10  FILLER       PIC X(20) VALUE 'WI481049000900752005'.
               10  FILLER       PIC X(20) VALUE 'WI481062000900788001'.
               10  FILLER       PIC X(20) VALUE 'WI481064000900788002'.
               10  FILLER       PIC X(20) VALUE 'WI481082000900841001'.
               10  FILLER       PIC X(20) VALUE 'WI481083000900841002'.
               10  FILLER       PIC X(20) VALUE 'WI481084000900841003'.
               10  FILLER       PIC X(20) VALUE 'WI481085000900841004'.
               10  FILLER       PIC X(20) VALUE 'WI481086000900841005'.
               10  FILLER       PIC X(20) VALUE 'WI481156000900841006'.
               10  FILLER       PIC X(20) VALUE 'WI481099000900872001'.
               10  FILLER       PIC X(20) VALUE 'WI481031000990000357'.
               10  FILLER       PIC X(20) VALUE 'WI481103000990000358'.
               10  FILLER       PIC X(20) VALUE 'WI481140000990000359'.
               10  FILLER       PIC X(20) VALUE 'WI481141000990000360'.
               10  FILLER       PIC X(20) VALUE 'WI481138000990000401'.
               10  FILLER       PIC X(20) VALUE 'WI481142000997219001'.
               10  FILLER       PIC X(20) VALUE 'WI481143000997219002'.
               10  FILLER       PIC X(20) VALUE 'WI481144000997219003'.
               10  FILLER       PIC X(20) VALUE 'WY490006000900880005'.
           05  FILLER REDEFINES WS-ACCT-TABLE OCCURS 1465.
               10  WS-ACCT-ST          PIC XX.
               10  WS-ACCT-OLD         PIC X(8).
               10  WS-ACCT-NEW         PIC X(10).



           05  WS-STATE-TABLE.
               10  FILLER              PIC X(12)  VALUE 'ALABAMA   AL'.
               10  FILLER              PIC X(12)  VALUE 'ARIZONA   AZ'.
               10  FILLER              PIC X(12)  VALUE 'ARKANSAS  AR'.
               10  FILLER              PIC X(12)  VALUE 'COLORADO  CO'.
               10  FILLER              PIC X(12)  VALUE 'CONNECTICUCT'.
               10  FILLER              PIC X(12)  VALUE 'DELAWARE  DE'.
               10  FILLER              PIC X(12)  VALUE 'FLORIDA   FL'.
               10  FILLER              PIC X(12)  VALUE 'GEORGIA   GA'.
               10  FILLER              PIC X(12)  VALUE 'HAWAII    HI'.
               10  FILLER              PIC X(12)  VALUE 'IDAHO     ID'.
               10  FILLER              PIC X(12)  VALUE 'ILLINOIS  IL'.
               10  FILLER              PIC X(12)  VALUE 'INDIANA   IN'.
               10  FILLER              PIC X(12)  VALUE 'IOWA      IA'.
               10  FILLER              PIC X(12)  VALUE 'KANSAS    KS'.
               10  FILLER              PIC X(12)  VALUE 'KENTUCKY  KY'.
               10  FILLER              PIC X(12)  VALUE 'LOUISIANA LA'.
               10  FILLER              PIC X(12)  VALUE 'MAINE     ME'.
               10  FILLER              PIC X(12)  VALUE 'MARYLAND  MD'.
               10  FILLER              PIC X(12)  VALUE 'MASSACHUSEMA'.
               10  FILLER              PIC X(12)  VALUE 'MICHIGAN  MI'.
               10  FILLER              PIC X(12)  VALUE 'MINNESOTA MN'.
               10  FILLER              PIC X(12)  VALUE 'MISSISSIPPMS'.
               10  FILLER              PIC X(12)  VALUE 'MISSOURI  MO'.
               10  FILLER              PIC X(12)  VALUE 'MONTANA   MT'.
               10  FILLER              PIC X(12)  VALUE 'NEBRASKA  NE'.
               10  FILLER              PIC X(12)  VALUE 'NEVADA    NV'.
               10  FILLER              PIC X(12)  VALUE 'NEW HAMPSHNH'.
               10  FILLER              PIC X(12)  VALUE 'NEW JERSEYNJ'.
               10  FILLER              PIC X(12)  VALUE 'NEW MEXICONM'.
               10  FILLER              PIC X(12)  VALUE 'NORTH CARONC'.
               10  FILLER              PIC X(12)  VALUE 'NORTH DAKOND'.
               10  FILLER              PIC X(12)  VALUE 'OHIO      OH'.
               10  FILLER              PIC X(12)  VALUE 'OREGON    OR'.
               10  FILLER              PIC X(12)  VALUE 'PENNSYLVANPA'.
               10  FILLER              PIC X(12)  VALUE 'RHODE ISLARI'.
               10  FILLER              PIC X(12)  VALUE 'SOUTH CAROSC'.
               10  FILLER              PIC X(12)  VALUE 'SOUTH DAKOSD'.
               10  FILLER              PIC X(12)  VALUE 'TENNESSEE TN'.
               10  FILLER              PIC X(12)  VALUE 'TEXAS     TX'.
               10  FILLER              PIC X(12)  VALUE 'UTAH      UT'.
               10  FILLER              PIC X(12)  VALUE 'VIRGINIA  VA'.
               10  FILLER              PIC X(12)  VALUE 'WASHINGTONWA'.
               10  FILLER              PIC X(12)  VALUE 'WEST VIRGIWV'.
               10  FILLER              PIC X(12)  VALUE 'WISCONSIN WI'.
               10  FILLER              PIC X(12)  VALUE 'WYOMING   WY'.
           05  FILLER REDEFINES WS-STATE-TABLE OCCURS 45.
               10  WS-STATE-10         PIC X(10).
               10  WS-STATE-ABBRV      PIC XX.

           05  WS-FULL-CONTROL.
               10  FILLER              PIC X(36) VALUE LOW-VALUES.
               10  WS-FULL-SFX         PIC X     VALUE LOW-VALUES.
           05  WS-SFX-TABLE            PIC X(36)   VALUE
               '0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ'.
           05  FILLER REDEFINES WS-SFX-TABLE.
               10  WS-CERT-SFX OCCURS 36
                                       PIC X.
           05  SUBSFX                  PIC S999  COMP-3 VALUE +0.
           05  WS-LF-COV1              PIC 9(7)  VALUE ZEROS.
           05  WS-LF-COV2              PIC 9(7)  VALUE ZEROS.
           05  WS-LF-COV3              PIC 9(7)  VALUE ZEROS.
           05  WS-LF-COV4              PIC 9(7)  VALUE ZEROS.
           05  WS-LF-COV5              PIC 9(7)  VALUE ZEROS.
           05  WS-LF-COV6              PIC 9(7)  VALUE ZEROS.
           05  WS-LF-COV7              PIC 9(7)  VALUE ZEROS.
           05  WS-LF-COVO              PIC 9(7)  VALUE ZEROS.
           05  WS-AH-COV1              PIC 9(7)  VALUE ZEROS.
           05  WS-AH-COV2              PIC 9(7)  VALUE ZEROS.
           05  WS-AH-COV3              PIC 9(7)  VALUE ZEROS.
           05  WS-AH-COV4              PIC 9(7)  VALUE ZEROS.
           05  WS-AH-COV5              PIC 9(7)  VALUE ZEROS.
           05  WS-AH-COV6              PIC 9(7)  VALUE ZEROS.
           05  WS-AH-COV7              PIC 9(7)  VALUE ZEROS.
           05  WS-AH-COV8              PIC 9(7)  VALUE ZEROS.
           05  WS-AH-COV9              PIC 9(7)  VALUE ZEROS.
           05  WS-AH-COV10             PIC 9(7)  VALUE ZEROS.
           05  WS-AH-COV11             PIC 9(7)  VALUE ZEROS.
           05  WS-AH-COV12             PIC 9(7)  VALUE ZEROS.
           05  WS-AH-COV13             PIC 9(7)  VALUE ZEROS.
           05  WS-AH-COVO              PIC 9(7)  VALUE ZEROS.
           05  WS-WORK-DAYS            PIC 999   VALUE ZEROS.
           05  WS-WORK-DAYS-X REDEFINES WS-WORK-DAYS.
               10  FILLER              PIC X.
               10  WS-WORK-DAYS-C      PIC XX.
           05  WS-WORK-AMT.
               10  WS-AMT1             PIC 9(8).
               10  FILLER              PIC X.
               10  WS-AMT2             PIC 99.
           05  WS-WORK-AMT-X           PIC X(10).
           05  WS-WORK-AMT-N REDEFINES WS-WORK-AMT-X
                                       PIC 9(8)V99.
           05  WS-WORK-APR-X           PIC X(7).
           05  WS-WORK-APR-N REDEFINES WS-WORK-APR-X
                                       PIC 9(3)V9(4).
           05  WS-WORK-COMM-X          PIC X(8).
           05  WS-WORK-COMM-N REDEFINES WS-WORK-COMM-X
                                       PIC 9(3)V9(5).
           05  WS-BIN-EFF-DT           PIC XX   VALUE LOW-VALUES.
           05  WS-BIN-LF-EXP-DT        PIC XX   VALUE LOW-VALUES.
           05  WS-BIN-AH-EXP-DT        PIC XX   VALUE LOW-VALUES.
           05  WS-BIN-LF-CANC-EXIT-DT  PIC XX   VALUE LOW-VALUES.
           05  WS-BIN-AH-CANC-EXIT-DT  PIC XX   VALUE LOW-VALUES.
           05  WS-BIN-LF-CANC-DT       PIC XX   VALUE LOW-VALUES.
           05  WS-BIN-AH-CANC-DT       PIC XX   VALUE LOW-VALUES.
           05  WS-BIN-LF-CLM-EXIT-DT   PIC XX   VALUE LOW-VALUES.
           05  WS-BIN-AH-CLM-EXIT-DT   PIC XX   VALUE LOW-VALUES.
           05  WS-BIN-1ST-PMT-DT       PIC XX   VALUE LOW-VALUES.
           05  WS-BIN-ENTRY-DT         PIC XX   VALUE LOW-VALUES.
           05  WS-WORK-DATE            PIC X(8).
           05  WS-WORK-DATE-N REDEFINES WS-WORK-DATE
                                       PIC 9(8).
           05  WS-DISPLAY-DATE         PIC ZZZ9(8).
           05  WS-DISPLAY-TERM         PIC Z99.
           05  WS-DISPLAY-RTERM        PIC Z99.99.
           05  WS-DISPLAY-PRM          PIC ZZZZZZZ.99.
           05  WS-DISPLAY-UEP          PIC ZZZZZZZ.99.

       01  WS-ABEND-AREA.
           05  WS-ABEND-FILE-STATUS    PIC X(02).
           05  WS-ABEND-MESSAGE        PIC X(80) VALUE SPACES.
           05  WS-RETURN-CODE          PIC S9(04)  COMP VALUE +0.
           05  WS-ZERO                 PIC S9(01) VALUE +0 COMP-3.

       01  WORK-ABEND-CODE.
           12  WAC-1                   PIC X.
           12  WAC-2                   PIC X.
           12  WAC-3-4.
               16  WAC-3               PIC X.
               16  WAC-4               PIC X.

       01  ABEND-FIELDS.
           12  PGM-SUB                 PIC S999 COMP  VALUE +158.
           12  FIRST-TIME-SW           PIC X  VALUE 'Y'.
               88  FIRST-TIME                 VALUE 'Y'.

                                       COPY ELCDATE.

                                       COPY ELCDTECX.

                                       COPY ELCDTEVR.
                                                                        
       PROCEDURE DIVISION.

       0001-DT-CRD-READ SECTION.
                                       COPY ELCDTERX.

           SORT SORT-FILE ON ASCENDING KEY SORT-KEY
                INPUT PROCEDURE 0002-INPUT
                                       THRU 0002-EXIT
                OUTPUT PROCEDURE 0003-OUTPUT
                                       THRU 0003-EXIT

           GOBACK

             .
       0002-INPUT SECTION.

           PERFORM 0010-INITIALIZE     THRU 0010-EXIT

           PERFORM 0020-OPEN-FILES     THRU 0020-EXIT

           PERFORM 0060-READ-INPUT     THRU 0060-EXIT

           PERFORM 0050-PROCESS-INPUT  THRU 0050-EXIT UNTIL
              END-OF-INPUT

           RELEASE SORT-RECORD   FROM CERTIFICATE-RECORD
           ADD 1 TO WS-REL-CNT

           .
       0002-EXIT.
           EXIT.

       0003-OUTPUT SECTION.

           MOVE ' '                    TO WS-EOF-SW

           PERFORM 0070-RETURN-REC     THRU 0070-EXIT

           PERFORM 0075-PROCESS-RECS THRU 0075-EXIT UNTIL
                END-OF-INPUT

           PERFORM 0030-CLOSE-FILES    THRU 0030-EXIT

           .
       0003-EXIT.
           EXIT.

       0010-INITIALIZE.

           MOVE SPACES                 TO CERTIFICATE-RECORD
           INITIALIZE                     CERTIFICATE-RECORD
           MOVE 'CR'                   TO CR-RECORD-ID
           MOVE X'04'                  TO CR-COMPANY-CD
           MOVE '9'                    TO CR-CARRIER
           MOVE '000000'               TO CR-GROUPING
           MOVE ZEROS                  TO CR-AGE
                                          CR-LF-DEV-CODE
                                          CR-AH-DEV-CODE
                                          CR-RATING-CLASS
           MOVE '2'                    TO CR-IND-GRP
           MOVE 'L140'                 TO CR-MORT
           MOVE '4'                    TO CR-ENTRY-STATUS

           PERFORM VARYING SUB1 FROM +1 BY +1 UNTIL
              SUB1 > +10
              MOVE +0                  TO CR-LCOM-L (SUB1)
                                          CR-LCOM-AH (SUB1)
              MOVE ZEROS               TO CR-COM-AGT (SUB1)
              MOVE ' '                 TO CR-AGT-TYPE (SUB1)
              IF SUB1 < +6
                 MOVE +0               TO CR-INCUR-DISAMT (SUB1)
                                          CR-INCUR-DISEXP (SUB1)
              END-IF
           END-PERFORM

           MOVE CERTIFICATE-RECORD     TO WS-INIT-CERT

           .
       0010-EXIT.
           EXIT.

       0020-OPEN-FILES.

           OPEN INPUT JMC-FILE-IN 
               OUTPUT CID-FILE-OUT

           .
       0020-EXIT.
           EXIT.

       0030-CLOSE-FILES.

           DISPLAY ' JMIC RECORDS INPUT    ' WS-INPUT-CNT
           DISPLAY ' CERT RECORDS RELEASED ' WS-REL-CNT
           DISPLAY ' CERT RECORDS OUTPUT   ' WS-OUTPUT-CNT
           DISPLAY ' NO ACCOUNT FOUND      ' WS-NO-ACCT-CNT

           CLOSE JMC-FILE-IN CID-FILE-OUT

           .
       0030-EXIT.
           EXIT.

       0050-PROCESS-INPUT.

           PERFORM 0080-PROCESS-INPUT  THRU 0080-EXIT

           PERFORM 0060-READ-INPUT     THRU 0060-EXIT

           .
       0050-EXIT.
           EXIT.

       0060-READ-INPUT.

           READ JMC-FILE-IN AT END
               SET END-OF-INPUT        TO TRUE
           END-READ

           IF NOT END-OF-INPUT
              ADD +1                   TO WS-INPUT-CNT
           END-IF

           .
       0060-EXIT.
           EXIT.

       0070-RETURN-REC.

           RETURN SORT-FILE     AT END
               SET END-OF-INPUT        TO TRUE
           END-RETURN

           .
       0070-EXIT.
           EXIT.

       0075-PROCESS-RECS.

           IF SORT-KEY > WS-FULL-CONTROL
              CONTINUE
           ELSE
              DISPLAY ' FOUND DUP ' SORT-KEY
              PERFORM VARYING SUBSFX FROM +1 BY +1 UNTIL
                 (SORT-KEY > WS-FULL-CONTROL)
                 OR (SUBSFX > +36)
                 MOVE WS-CERT-SFX (SUBSFX)
                                       TO SORT-CERT-SFX
              END-PERFORM
              IF SUBSFX > +36
                 DISPLAY ' FOUND TOO MANY DUPS FOR ABOVE CERT '
                 PERFORM ABEND-PGM
              END-IF
           END-IF
           MOVE SORT-KEY               TO WS-FULL-CONTROL
           MOVE SORT-RECORD            TO CID-RECORD-OUT

           WRITE CID-RECORD-OUT
           ADD 1                       TO WS-OUTPUT-CNT

           PERFORM 0070-RETURN-REC THRU 0070-EXIT

           .
       0075-EXIT.
           EXIT.

       0080-PROCESS-INPUT.

           IF JMC-CERT-RECORD (1:38) NOT = JMC-PREV-KEY
              IF JMC-PREV-KEY NOT = LOW-VALUES
                 IF CR-AGE = ZEROS
                    MOVE 42                  TO CR-AGE
                 END-IF
                 RELEASE SORT-RECORD   FROM CERTIFICATE-RECORD
                 ADD 1 TO WS-REL-CNT
                 MOVE ZEROS TO WS-EQ-CNT
              END-IF
              MOVE JMC-CERT-RECORD (1:38)
                                       TO JMC-PREV-KEY
              MOVE WS-INIT-CERT        TO CERTIFICATE-RECORD
              MOVE '00'                TO CR-LFTYP CR-AHTYP
           ELSE
              ADD 1 TO WS-EQ-CNT
           END-IF

           IF WS-EQ-CNT > 2
              DISPLAY ' MORE THAN 2 RECORDS ' JMC-CERT-RECORD (1:38)
           END-IF
           IF JMC-STATE = WS-STATE-10 (S1)
              MOVE WS-STATE-ABBRV (S1) TO CR-STATE
           ELSE
              PERFORM VARYING S1 FROM +1 BY +1 UNTIL
                 (S1 > +45)
                 OR (JMC-STATE = WS-STATE-10 (S1))
              END-PERFORM
              IF S1 < +46
                 MOVE WS-STATE-ABBRV (S1) TO CR-STATE
              ELSE
                 DISPLAY 'STATE NOT FOUND ' JMC-CERT-RECORD (1:38)
              END-IF
           END-IF

      *    IF JMC-ACCOUNT (3:8) = WS-ACCT-OLD (A1)
      *       MOVE WS-ACCT-ST (A1)     TO CR-STATE
      *       MOVE WS-ACCT-NEW (A1)    TO CR-ACCOUNT
      *    ELSE
      *       PERFORM VARYING A1 FROM +1 BY +1 UNTIL
      *          (A1 > +1465)
      *          OR (JMC-ACCOUNT (3:8) = WS-ACCT-OLD (A1))
      *       END-PERFORM
      *       IF A1 < +1465
      *          MOVE WS-ACCT-ST (A1)  TO CR-STATE
      *          MOVE WS-ACCT-NEW (A1) TO CR-ACCOUNT
      *       ELSE
      *          DISPLAY 'ACCOUNT NOT FOUND ' JMC-CERT-RECORD (1:38)
      *          ADD 1 TO WS-NO-ACCT-CNT
      *          MOVE '9'              TO CR-CARRIER
      *          MOVE '000000'         TO CR-GROUPING
      *          MOVE 'NE'             TO CR-STATE
      *          MOVE '0000782400'     TO CR-ACCOUNT
      *       END-IF
      *    END-IF

           MOVE JMC-ACCOUNT            TO CR-ACCOUNT

      *    IF (CR-STATE NOT = WS-STATE-ABBRV (S1))
      *       AND (CR-STATE NOT = 'NE')
      *       AND (CR-ACCOUNT NOT = '0000782400')
      *       DISPLAY ' HAD TO CHANGE STATE ' JMC-CERT-RECORD (1:38)
      *    END-IF

           IF CR-STATE = 'KY'
              MOVE '8'                 TO CR-CARRIER
           END-IF
           MOVE JMC-CERT-NO            TO CR-CERT-NO
           MOVE JMC-EFF-DATE           TO CR-DT
           MOVE CR-DT                  TO DC-GREG-DATE-CYMD

      *    IF DC-CYMD-MONTH = 01 OR 03 OR 05 OR 07 OR 08 OR 10 OR 12
      *       MOVE 31                  TO DC-CYMD-DAY
      *    ELSE
      *       IF DC-CYMD-MONTH = 04 OR 06 OR 09 OR 11
      *          MOVE 30               TO DC-CYMD-DAY
      *       ELSE
      *          DIVIDE DC-CYMD-YEAR BY 4 GIVING WS-DATE-1
      *             REMAINDER WS-DATE-2
      *          IF LEAP-YEAR
      *             MOVE 29            TO DC-CYMD-DAY
      *          ELSE
      *             MOVE 28            TO DC-CYMD-DAY
      *          END-IF
      *       END-IF
      *    END-IF
      *    MOVE DC-GREG-DATE-CYMD      TO CR-DT


           MOVE 'L'                    TO DC-OPTION-CODE
           PERFORM 8510-DATE-CONVERSION
                                       THRU 8590-EXIT
           IF NO-CONVERSION-ERROR
              MOVE DC-BIN-DATE-1       TO WS-BIN-EFF-DT
           ELSE
              DISPLAY ' EFFECT  DATE ERROR ON CERT ' CR-CERT
                   '  ' CR-DT
           END-IF

           MOVE WS-BIN-EFF-DT          TO DC-BIN-DATE-1
           MOVE +1                     TO DC-ELAPSED-MONTHS
           MOVE '6'                    TO DC-OPTION-CODE
           MOVE +0                     TO DC-ELAPSED-DAYS
           PERFORM 8510-DATE-CONVERSION
                                       THRU 8590-EXIT
           IF NO-CONVERSION-ERROR
              MOVE DC-GREG-DATE-1-YMD  TO CR-LOAN-1ST-PMT-DT
           ELSE
              DISPLAY '1ST PMT DATE ERROR ON CERT ' CR-CERT
                      '  ' CR-DT
           END-IF

           MOVE WS-BIN-EFF-DT          TO DC-BIN-DATE-1
           MOVE +1                     TO DC-ELAPSED-MONTHS
           MOVE '1'                    TO DC-END-OF-MONTH
           MOVE '6'                    TO DC-OPTION-CODE
           MOVE +0                     TO DC-ELAPSED-DAYS
           PERFORM 8510-DATE-CONVERSION
                                       THRU 8590-EXIT
           IF NO-CONVERSION-ERROR
              MOVE DC-GREG-DATE-CYMD   TO CR-ENTRY-DATE
           ELSE
              DISPLAY ' ENTRY  DATE ERROR ON CERT ' CR-CERT
                      '  ' CR-DT
           END-IF
           MOVE ' '                    TO DC-END-OF-MONTH

           IF CR-AGE = ZEROS
              MOVE JMC-AGE             TO CR-AGE
           END-IF
           MOVE 'M'                    TO CR-SEX
           
           IF JMC-COV-TYP (1:1) = 'A'
              MOVE '4'                 TO CR-AH-CURRENT-STATUS
              MOVE JMC-EXP-DATE        TO CR-AH-EXPIRE-DATE



      *       MOVE CR-AH-EXPIRE-DATE   TO DC-GREG-DATE-CYMD
      *       IF DC-CYMD-MONTH = 01 OR 03 OR 05 OR 07 OR 08 OR 10 OR 12
      *          MOVE 31                  TO DC-CYMD-DAY
      *       ELSE
      *          IF DC-CYMD-MONTH = 04 OR 06 OR 09 OR 11
      *             MOVE 30               TO DC-CYMD-DAY
      *          ELSE
      *             DIVIDE DC-CYMD-YEAR BY 4 GIVING WS-DATE-1
      *                REMAINDER WS-DATE-2
      *             IF LEAP-YEAR
      *                MOVE 29            TO DC-CYMD-DAY
      *             ELSE
      *                MOVE 28            TO DC-CYMD-DAY
      *             END-IF
      *          END-IF
      *       END-IF
      *       MOVE DC-GREG-DATE-CYMD      TO CR-AH-EXPIRE-DATE



              MOVE JMC-TERM            TO CR-AH-TERM
              MOVE JMC-PREM            TO CR-AHPRM
                                          CR-AHPRM-CALC
              MOVE JMC-MO-PMT          TO CR-AHAMT
              EVALUATE JMC-COV (1:2)
                 WHEN '07'
                    MOVE '03'          TO CR-AHTYP
                 WHEN '14'
                    MOVE '01'          TO CR-AHTYP
                 WHEN  '30'
                    MOVE '04'          TO CR-AHTYP
                 WHEN OTHER
                    DISPLAY 'INVALID AH COV ' JMC-CERT-RECORD (1:38)
              END-EVALUATE
           ELSE
              MOVE '4'                 TO CR-LF-CURRENT-STATUS
              MOVE JMC-EXP-DATE        TO CR-LF-EXPIRE-DATE



      *       MOVE CR-LF-EXPIRE-DATE   TO DC-GREG-DATE-CYMD
      *       IF DC-CYMD-MONTH = 01 OR 03 OR 05 OR 07 OR 08 OR 10 OR 12
      *          MOVE 31                  TO DC-CYMD-DAY
      *       ELSE
      *          IF DC-CYMD-MONTH = 04 OR 06 OR 09 OR 11
      *             MOVE 30               TO DC-CYMD-DAY
      *          ELSE
      *             DIVIDE DC-CYMD-YEAR BY 4 GIVING WS-DATE-1
      *                REMAINDER WS-DATE-2
      *             IF LEAP-YEAR
      *                MOVE 29            TO DC-CYMD-DAY
      *             ELSE
      *                MOVE 28            TO DC-CYMD-DAY
      *             END-IF
      *          END-IF
      *       END-IF
      *       MOVE DC-GREG-DATE-CYMD      TO CR-LF-EXPIRE-DATE



              MOVE JMC-TERM            TO CR-LF-TERM
              MOVE JMC-PREM            TO CR-LFPRM
                                          CR-LFPRM-CALC
              MOVE JMC-INIT-BEN        TO CR-LFAMT
      *       MOVE +12.0               TO CR-APR
              MOVE JMC-APR             TO CR-APR

              EVALUATE TRUE
                 WHEN CR-STATE = 'VA' OR 'TX'
                    MOVE 'L550'        TO CR-MORT
                 WHEN CR-STATE = 'NC'
                    MOVE 'L300'        TO CR-MORT
                 WHEN JMC-REIN-CO NOT = SPACES
                    MOVE 'L650'        TO CR-MORT
                 WHEN OTHER
                    MOVE 'L150'              TO CR-MORT
              END-EVALUATE

              EVALUATE JMC-COV (1:2)
                 WHEN 'SD'
                    MOVE '01'          TO CR-LFTYP
                 WHEN 'ST'
                    MOVE '01'          TO CR-LFTYP
                 WHEN 'SL'
                    MOVE '02'          TO CR-LFTYP
                 WHEN 'SN'
                    MOVE '05'          TO CR-LFTYP
                 WHEN 'JD'
                    MOVE '03'          TO CR-LFTYP
                 WHEN 'JT'
                    MOVE '03'          TO CR-LFTYP
                 WHEN 'JL'
                    MOVE '04'          TO CR-LFTYP
                 WHEN 'JN'              
                    MOVE '06'          TO CR-LFTYP
                    MOVE CR-AGE        TO CR-JOINT-AGE
                 WHEN OTHER
                    DISPLAY 'INVALID LF COV ' JMC-CERT-RECORD (1:38)
              END-EVALUATE
           END-IF

           MOVE '2'                    TO CR-IND-GRP

           MOVE +1                     TO SUB1
           MOVE CR-ACCOUNT             TO CR-COM-AGT (SUB1)
           MOVE 'D'                    TO CR-AGT-TYPE (SUB1)

      *    RELEASE SORT-RECORD         FROM CERTIFICATE-RECORD

           .
       0080-EXIT.
           EXIT.

       0110-READ-INPUT.

           READ JMC-FILE-IN AT END
              SET END-OF-INPUT TO TRUE
           END-READ

           IF NOT END-OF-INPUT
              ADD +1                   TO WS-INPUT-CNT
           END-IF

           .
       0110-EXIT.
           EXIT.

       8510-DATE-CONVERSION.

           CALL 'ELDATCX' USING DATE-CONVERSION-DATA

           .
       8590-EXIT.
           EXIT.

       ABEND-PGM.
                                       COPY ELCABEND.

